Repository: Kostenkov-2021/SoundTranscriber
Catalog: documentation/*/SoundTranscriberUserGuide.po
Languages: ar, es, fr, ru, tr, vi

source: - If you choose not to translate the User Guide and Updates file, Sound Transcriber will display them in English.
ar: - إذا اخترت عدم ترجمة دليل المستخدم وملف التحديثات، فسيعرضهم Sound Transcriber باللغة الإنجليزية.
es: - Si se elige no traducir la Guía del Usuario y el archivo de novedades Sound Transcriber los mostrará en inglés.
fr: - Si vous choisissez de ne pas traduire le guide de l'utilisateur et le fichier des mises à jour, Sound Transcriber les affichera en anglais.
ru: - Если вы решите не переводить руководство пользователя и файл обновлений, Sound Transcriber будет отображать их на английском языке.
tr: - Kullanıcı Kılavuzu ve Güncellemeler dosyasını çevirmemeyi seçerseniz, Sound Transcriber onları İngilizce olarak gösterecektir.
vi: - Nếu bạn chọn không dịch Hướng dẫn sử dụng và tệp Cập nhật, Sound Transcriber sẽ hiển thị chúng bằng tiếng Anh.

source: - Software translation is an ongoing effort, and we will liaise with you before releasing new updates so you can translate any new content.
ar: - تعد ترجمة البرامج جهدًا مستمرًا، وسنتواصل معك قبل إصدار تحديثات جديدة حتى تتمكن من ترجمة أي محتوى جديد.
es: - La traducción de software es un esfuerzo continuo, y nos pondremos en contacto con usted antes de lanzar nuevas actualizaciones para que pueda traducir cualquier contenido nuevo.
fr: - La traduction de logiciels est un effort continu, et nous vous contacterons avant de publier de nouvelles mises à jour afin que vous puissiez traduire tout nouveau contenu.
ru: - Перевод программного обеспечения - это постоянная работа, и мы будем связываться с вами перед выпуском новых обновлений, чтобы вы могли перевести всё новое содержимое.
tr: - Yazılım çevirisi devam eden bir çalışmadır ve yeni içerikleri çevirebilmeniz için güncellemeler yayınlamadan önce sizinle iletişime geçeceğiz.
vi: - Dịch thuật phần mềm là một nỗ lực liên tục, và chúng tôi sẽ liên lạc với bạn trước khi phát hành các bản cập nhật mới để bạn có thể dịch bất kỳ nội dung mới nào.

source: ## Sound Transcriber website:
ar: ## موقع Sound Transcriber:
es: ## Web de Sound Transcriber:
fr: ## Site web de Sound Transcriber :
ru: ## Веб - сайт Sound Transcriber:
tr: ## Sound Transcriber web sitesi:
vi: ## Trang web Sound Transcriber:

source: While there is no official website for Sound Transcriber, you can access all necessary resources in the Sound Transcriber repository on gitHub. This repository contains translation files and the latest version of the program.
ar: على الرغم من عدم وجود موقع ويب رسمي لـ Sound Transcriber، يمكنك الوصول إلى جميع الملفات الضرورية في مستودع البرنامج على GitHub. يحتوي هذا المستودع على ملفات الترجمة وأحدث إصدار من البرنامج.
es: Aunque no hay un sitio web oficial de Sound Transcriber, se puede acceder a todos los recursos necesarios en el repositorio de Sound Transcriber en GitHub. Este repositorio contiene los archivos de traducción y la última versión del programa.
fr: Bien qu'il n'y ait pas de site web officiel pour Sound Transcriber, vous pouvez accéder à toutes les ressources nécessaires dans le dépôt Sound Transcriber sur gitHub. Ce dépôt contient les fichiers de traduction et la dernière version du programme.
ru: Хотя официального сайта Sound Transcriber не существует, вы можете получить доступ ко всем необходимым ресурсам в репозитории Sound Transcriber на gitHub. В этом репозитории содержатся файлы перевода и последняя версия программы.
tr: Sound Transcriber'ın resmi bir web sitesi olmamasına rağmen, tüm gerekli kaynaklara GitHub'daki Sound Transcriber deposundan erişebilirsiniz. Bu depo, çeviri dosyalarını ve programın en son sürümünü içerir.
vi: Mặc dù không có trang web chính thức cho Sound Transcriber, bạn có thể truy cập tất cả các tài nguyên cần thiết trong kho lưu trữ Sound Transcriber trên gitHub. Kho lưu trữ này chứa các tệp dịch và phiên bản mới nhất của chương trình.

source: Note: Sound Transcriber is not open source at this time, and the repository does not contain the source code for the program.
ar: ملاحظة: برنامج Sound Transcriber ليس مفتوح المصدر في الوقت الحالي، ولا يحتوي المستودع على الكود المصدري للبرنامج.
es: Nota: Ahora mismo Sound Transcriber no es de código abierto, y por tanto, el repositorio no tiene el código fuente del programa.
fr: Note : Sound Transcriber n'est pas open source pour le moment, et le référentiel ne contient pas le code source du programme.
ru: Примечание: Sound Transcriber на данный момент не является программой с открытым исходным кодом, и репозиторий не содержит исходного кода программы.
tr: Not: Sound Transcriber şu anda açık kaynak değildir ve depo programın kaynak kodunu içermez.
vi: Lưu ý: Sound Transcriber hiện không phải là mã nguồn mở và kho lưu trữ không chứa mã nguồn của chương trình.

source: [Repository link.](https://github.com/tecwindow/SoundTranscriber)
ar: [رابط المستودع.](https://github.com/tecwindow/SoundTranscriber)
es: [Enlace al repositorio.](https://github.com/tecwindow/SoundTranscriber)
fr: (Lien vers le référentiel) (https://github.com/tecwindow/SoundTranscriber)
ru: [ Ссылка на репозиторий .](https://github.com/tecwindow/SoundTranscriber)
tr: [Depo bağlantısı.](https://github.com/tecwindow/SoundTranscriber)
vi: [Liên kết kho lưu trữ.](https://github.com/tecwindow/SoundTranscriber)

source: ## Contact us:
ar: ## اتصل بنا:
es: ## Contáctenos:
fr: ## Contactez-nous :
ru: ## Свяжитесь с нами :
tr: ## Bize Ulaşın:
vi: ## Liên hệ với chúng tôi:

source: If you are unable to access our contact list within Sound Transcriber, you can reach us via email using the following addresses:
ar: إذا لم تتمكن من الوصول إلى قائمة الاتصال بنا داخل Sound Transcriber، فيمكنك التواصل معنا عبر البريد الإلكتروني باستخدام العناوين التالية:
es: Si no puede acceder a nuestros datos de contacto dentro de Sound Transcriber, puede comunicarse con nosotros por correo electrónico usando las siguientes direcciones:
fr: Si vous ne parvenez pas à accéder à notre liste de contacts dans Sound Transcriber, vous pouvez nous contacter par courrier électronique aux adresses suivantes :
ru: Если вы не можете получить доступ к нашему списку контактов в Sound Transcriber, вы можете связаться с нами по электронной почте, используя следующие адреса:
tr: Sound Transcriber içinde iletişim listemize erişemiyorsanız, aşağıdaki e-posta adreslerini kullanarak bize ulaşabilirsiniz:
vi: Nếu bạn không thể truy cập danh sách liên hệ của chúng tôi trong Sound Transcriber, bạn có thể liên hệ với chúng tôi qua email bằng các địa chỉ sau:

source: - Qais Alrefai: ww258148@gmail.com
ar: - قيس الرفاعي: ww258148@gmail.com
ru: - Каис Алрефай : ww258148@gmail.com

source: - Mahmoud Atef: mahmoud.atef.987123@gmail.com
ar: - محمود عاطف: mahmoud.atef.987123@gmail.com
ru: - Махмуд Атеф : mahmoud.atef.987123@gmail.com

source: - Ahmed Bakr: AhmedBakr593@gmail.com
ar: - أحمد بكر: AhmadBakr593@gmail.com
ru: - Ахмед Бакр : AhmedBakr593@gmail.com

source: ## special thanks:
ar: ## شكر خاص:
es: ## Agradecimientos:
fr: ## Remerciement spécial :
ru: ## особая благодарность :
tr: ## Özel Teşekkürler:
vi: ## Lời cảm ơn đặc biệt:

source: - Many thanks to Riad Assoumfor translating Sound Transcriber into French, translating the user guide into English and proofreading the program's English and Arabic strings.
ar: - جزيل الشكر لرياض أسوم علىترجمة Sound Transcriber إلى الفرنسية, ترجمة دليل المستخدم إلى الإنجليزية وتدقيق نصوص البرنامج العربية والإنجليزية.
es: - Muchas gracias a Riad Assoum por traducir la guía del usuario al inglés y corregir las cadenas en inglés y árabe del programa.
fr: - Un grand merci à Riad Assoum pour la traduction du programme en français, la traduction du guide de l'utilisateur en anglais et la relecture des textes du programme en anglais et en arabe.
ru: - Большое спасибо Риаду Ассуму за перевод Sound Transcriber на французский язык, перевод руководства пользователя на английский язык и вычитку английской и арабской строк программы.
tr: - Sound Transcriber'ı Fransızcaya çeviren, kullanıcı kılavuzunu İngilizceye çeviren ve programın İngilizce ve Arapça dizelerini düzelten Riad Assoum'a teşekkür ederiz.
vi: - Xin chân thành cảm ơn Riad Assoum vì đã dịch Sound Transcriber sang tiếng Pháp, dịch hướng dẫn sử dụng sang tiếng Anh và hiệu đính chuỗi tiếng Anh và tiếng Ả Rập của chương trình.

source: - Many thanks to Georgiana Frincu for translating Sound Transcriber into Spanish.
ar: - جزيل الشكر لـ Georgiana Frincu على ترجمة Sound Transcriber إلى الإسبانية.
es: - Muchas gracias a Georgiana Frincu por traducir Sound Transcriber al español.
fr: - Merci à Georgiana Frincu pour la traduction de Sound Transcriber en espagnol.
ru: - Большое спасибо Георгиане Фринку за перевод Sound Transcriber на испанский язык.
tr: - Sound Transcriber'ı İspanyolcaya çeviren Georgiana Frincu'ya teşekkür ederiz.
vi: - Xin chân thành cảm ơn Georgiana Frincu vì đã dịch Sound Transcriber sang tiếng Tây Ban Nha.

source: - Many thanks to Danil for translating Sound Transcriber into Russian.
ar: - جزيل الشكر ل Danil على ترجمة Sound Transcriber إلى الروسية.
es: - Muchas gracias a Danil por traducir Sound Transcriber al ruso.
fr: - Merci à Danil pour la traduction de Sound Transcriber en russe.
ru: - Большое спасибо Данилу за перевод Sound Transcriber на русский язык.
tr: - Sound Transcriber'ı Rusçaya çeviren Danil'e teşekkür ederiz.
vi: - Cảm ơn Danil rất nhiều vì đã dịch Sound Transcriber sang tiếng Nga.

source: - Many thanks to Kadir öz for translating Sound Transcriber into Turkish.
ar: - جزيل الشكر لKadir öz على ترجمة Sound Transcriber إلى التركية.
es: - Muchas gracias a Kadir öz por traducir Sound Transcriber al turco.
fr: - Merci à Kadir öz pour la traduction de Sound Transcriber en turc.
ru: - Большое спасибо Kadir öz за перевод Sound Transcriber на турецкий язык.
tr: - Sound Transcriber'ı Türkçeye çeviren Kadir öz'e teşekkür ederiz.
vi: - Cảm ơn Kadir öz rất nhiều vì đã dịch Sound Transcriber sang tiếng Thổ Nhĩ Kỳ.

source: - Many thanks to Nguyen Anh Duc for translating Sound Transcriber into Vietnamese.
ar: - جزيل الشكر لـ Nguyen Anh Duc على ترجمة Sound Transcriber إلى اللغة الفيتنامية.
es: - Muchas gracias a Nguyen Anh Duc por la traducción de Sound Transcriber al Vietnamita.
fr: - Merci à Nguyen Anh Duc pour la traduction de Sound Transcriber en vietnamien.
ru: - Большое спасибо Нгуен Ань Дыку за перевод Sound Transcriber на вьетнамский язык.
tr: sound transcriber'i viyetnamcaya çeviren Nguyen Anh Duc' çok teşekkür ederiz.
vi: - Xin chân thành cảm ơn Nguyễn Anh Đức đã dịch Sound Transcriber sang tiếng Việt.
