Repository: Kostenkov-2021/SoundTranscriber
Catalog: documentation/*/SoundTranscriberUserGuide.po
Languages: ar, es, fr, ru, tr, vi

source: Click the "Start" button to initiate the conversion process.
ar: ثم زر "بدء Start" لبدء التحويل.
es: Pulse el botón "Iniciar" para iniciar el proceso de conversión.
fr: Cliquez sur le bouton "Démarrer" pour lancer le processus de conversion.
ru: Нажмите кнопку "Начать", чтобы запустить процесс преобразования.
tr: Dönüşüm sürecini başlatmak için "Başlat" düğmesine tıklayın.
vi: Nhấn nút "Bắt đầu" để bắt đầu quá trình chuyển đổi.

source: Next, you will find the "Save As" button, which allows you to specify the output saving preferences.
ar: يليه زر "حفظ بصيغة Save As" لتحديد طريقة حفظ الناتج.
es: A continuación, encontrará el botón "Guardar como", que permite especificar las preferencias de guardado del archivo de salida.
fr: Ensuite, vous trouverez le bouton "Enregistrer sous", qui vous permet de spécifier les préférences d'enregistrement de la sortie.
ru: Далее находится кнопка "Сохранить как", которая позволяет указать параметры сохранения выходного файла.
tr: Bir sonraki adımda, çıktı kaydetme tercihlerinizi belirlemenize olanak tanıyan "Farklı Kaydet" düğmesini bulacaksınız.
vi: Tiếp theo, bạn sẽ tìm thấy nút "Lưu dưới dạng", cho phép bạn chỉ định các tùy chọn lưu đầu ra.

source: Below that, there is a read-only edit box indicating the path or the link of the file to be transcribed.
ar: ثم مربع تحرير للقراءة فقط يحتوي على اسم أو رابط الملف المراد تحويله.
es: Debajo hay un cuadro de edición de sólo lectura que indica la ruta o el enlace del archivo que se va a transcribir.
fr: En dessous, il y a une boîte d'édition en lecture seule indiquant le chemin ou le lien du fichier à transcrire.
ru: Под ней находится поле для редактирования, доступное только для чтения, в котором указывается путь или ссылка на файл, подлежащий расшифровке.
tr: Bunun altında, dönüştürülecek dosyanın yolu veya bağlantısını gösteren salt okunur bir düzenleme kutusu bulunur.
vi: Dưới đó, có một hộp chỉnh sửa chỉ đọc cho biết đường dẫn hoặc liên kết của tập tin cần được phiên âm.

source: Use the "Browse" button to locate and select the file you want to transcribe.
ar: ثم زر "تصفح Browse" لتحديد مسار الملف المراد تحويله.
es: Utilice el botón "Examinar" para localizar y seleccionar el archivo que desea transcribir.
fr: Utilisez le bouton "Parcourir" pour localiser et sélectionner le fichier que vous souhaitez transcrire.
ru: Используйте кнопку "Обзор", чтобы найти и выбрать файл, который вы хотите расшифровать.
tr: Dönüştürmek istediğiniz dosyayı bulup seçmek için "Gözat" düğmesini kullanın.
vi: Sử dụng nút "Duyệt" để tìm và chọn tệp bạn muốn phiên âm.

source: Additionally, you can utilize keyboard shortcuts, which will be explained later.
ar: وكذلك يمكنك استخدام اختصارات لوحة المفاتيح كما هو مبين لاحقًا.
es: Además, puede utilizar atajos de teclado, que se explicarán más adelante.
fr: En outre, vous pouvez utiliser des raccourcis clavier, qui seront expliqués plus loin.
ru: Кроме того, вы можете использовать сочетания клавиш, которые будут описаны ниже.
tr: Ayrıca, daha sonra açıklanacak olan klavye kısayollarını da kullanabilirsiniz.
vi: Ngoài ra, bạn có thể sử dụng các phím tắt, sẽ được giải thích sau.

source: Please note that the order of items on the screen may differ when navigating with the Tab key.
ar: ملاحظة, يختلف ترتيب العناصر على الشاشة عن ترتيبها أثناء التنقل بمفتاح Tab.
es: Tenga en cuenta que el orden de los elementos en la pantalla puede variar al navegar con el tabulador.
fr: Veuillez noter que l'ordre des éléments à l'écran peut différer lorsque vous naviguez avec la touche de tabulation.
ru: Обратите внимание, что порядок элементов на экране может отличаться при навигации с помощью клавиши Tab.
tr: Unutmayın, sekme tuşuyla gezinirken ekrandaki öğelerin sırası farklı olabilir.
vi: Xin lưu ý rằng thứ tự các mục trên màn hình có thể khác khi điều hướng bằng phím Tab.

source: ## Menus
ar: ## القوائم
es: ## Menús
ru: ## Меню
tr: ## Menüler
vi: ## Các Menu

source: The program includes several menus accessible by pressing the Alt key.
ar: في البرنامج بعض القوائم التي يمكنك الوصول إليها عن طريق ضغط مفتاح Alt.
es: El programa incluye algunos menús a los que se puede acceder pulsando la tecla Alt.
fr: Le programme comprend plusieurs menus accessibles en appuyant sur la touche Alt.
ru: Программа содержит несколько меню, доступных при нажатии клавиши Alt.
tr: Program, Alt tuşuna basarak erişilebilen birkaç menü içerir.
vi: Chương trình bao gồm một số menu có thể truy cập bằng cách nhấn phím Alt.

source: ### File:
ar: ### ملف File:
es: ### Archivo:
fr: ### Fichier :
ru: ### Файл :
tr: ### Dosya:
vi: ### Tập tin:

source: - Open: Use this option to browse your device and search for a file to transcribe.
ar: - فتح Open لاستعراض جهازك والبحث عن ملف لتحويله.
es: - Abrir: Utilice esta opción para navegar por el dispositivo y buscar un archivo para transcribir.
fr: - Ouvrir : Utilisez cette option pour parcourir votre appareil et rechercher un fichier à transcrire.
ru: - Открыть : Используйте эту опцию для просмотра устройства и поиска файла для расшифровки .
tr: - Aç: Cihazınızda bir dosya aramak ve seçmek için bu seçeneği kullanın.
vi: - Mở: Sử dụng tùy chọn này để duyệt thiết bị của bạn và tìm kiếm tập tin để phiên âm.

source: - Save: Save the transcription result with the specified extension in the settings.
ar: - حفظ Save لحفظ نتيجة التحويل بامتدادات يتم تحديدها في الإعدادات.
es: - Guardar: Permite guardar el resultado de la transcripción con la extensión especificada en los ajustes.
fr: - Enregistrer : Enregistre le résultat de la transcription avec l'extension spécifiée dans les paramètres.
ru: - Сохранить : Сохранить результат транскрипции с указанным в настройках расширением .
tr: - Kaydet: Dönüştürme sonucunu ayarlarda belirtilen uzantıyla kaydedin.
vi: - Lưu: Lưu kết quả phiên âm với định dạng đã chỉ định trong cài đặt.

source: - Save As: Save the result with a specific extension.
ar: - حفظ بصيغة Save As لحفظ النتيجة بامتداد معين.
es: - Guardar como: Permite guardar el resultado con una extensión específica.
fr: - Enregistrer sous : Enregistrer le résultat avec une extension spécifique.
ru: - Сохранить как : Сохранить результат с определённым расширением .
tr: - Farklı Kaydet: Sonucu belirli bir uzantıyla kaydedin.
vi: - Lưu dưới dạng: Lưu kết quả với định dạng cụ thể.

source: - Settings: Access program options and customizations.
ar: - الإعدادات Settings تحتوي على خيارات البرنامج وتخصيصاته.
es: - Ajustes: Permite acceder a las opciones y personalizaciones del programa.
fr: - Paramètres : Accéder aux options du programme et aux personnalisations.
ru: - Настройки : Доступ к опциям и настройкам программы .
tr: - Ayarlar: Program seçeneklerine ve özelleştirmelere erişin.
vi: - Cài đặt: Truy cập các tùy chọn và tùy chỉnh chương trình.

source: - Open Log File: allows you to view the Sound Transcriber log file.
ar: - فتح ملف log: يسمح لك بعرض ملف سجل Sound Transcriber.
es: - Abrir Archivo De LOG: permite ver el archivo de log de Sound Transcriber.
fr: - Ouvrir le fichier journal : permet de visualiser le fichier journal (log) de Sound Transcriber.
ru: - Открыть файл журнала : позволяет просмотреть файл журнала программы Sound Transcriber.
tr: - Günlük Dosyasını Aç: Sound Transcriber günlük dosyasını görüntülemenizi sağlar.
vi: - Mở Tập tin Nhật kí: cho phép bạn xem tập tin nhật kí của Sound Transcriber.

source: - Exit: Exit the program.
ar: - إغلاق Exit للخروج من البرنامج.
es: - Salir: Sirve para salir del programa.
fr: - Quitter : Quitter le programme.
ru: - Выход : Выход из программы .
tr: - Çıkış: Programdan çıkın.
vi: - Thoát: Thoát chương trình.

source: ### Services:
ar: ### الخدمات:
es: ### Servicios:
ru: ### Сервисы :
tr: ### Servisler:
vi: ### Dịch vụ:

source: It contains the names of the services available for conversion, you can selecte any service.
ar: تحتوي على أسماء الخدمات المتاحة للتحويل, يمكنك اختيار أي خدمة.
es: Contiene los nombres de los servicios disponibles para la conversión, puede seleccionar cualquier servicio.
fr: Il contient les noms des services disponibles pour la conversion, vous pouvez sélectionner n'importe quel service.
ru: Содержит названия сервисов, доступных для конвертирования, вы можете выбрать любой сервис.
tr: Çevrim için mevcut hizmetlerin adlarını içerir, herhangi bir hizmeti seçebilirsiniz.
vi: - Nó chứa tên của các dịch vụ có sẵn để chuyển đổi, bạn có thể chọn bất kỳ dịch vụ nào.

source: ### Help:
ar: ### مساعدة Help:
es: ### Ayuda:
fr: ### Aide :
ru: ### Справка :
tr: ### Yardım:
vi: ### Trợ giúp:

source: - User Guide: View the currently accessed file.
ar: - دليل المستخدم User Guide لعرض الملف الذي تقرؤه حاليا.
es: - Guía de usuario: Ver este archivo.
fr: - Guide de l'utilisateur : Affiche le fichier actuellement consulté.
ru: - Руководство пользователя : Просмотр текущего файла .
tr: - Kullanım Kılavuzu: Şu anda erişilen dosyayı görüntüleyin.
vi: - Hướng dẫn sử dụng: Xem tập tin đang truy cập.

source: - What's new: View Sound Transcriber change log.
ar: - ما الجديد What's new لعرض مستجدات Sound Transcriber.
es: - Novedades: Ver el registro de cambios de Sound Transcriber.
fr: - Quoi de neuf : Voir le journal des modifications de Sound Transcriber.
ru: - Что нового : Просмотр журнала изменений Sound Transcriber.
tr: - Ne yeni: Sound Transcriber değişiklik günlüğünü görüntüleyin.
vi: - Có gì mới: Xem nhật ký thay đổi của Sound Transcriber.

source: - Check for Updates: Search for program updates.
ar: - التحقق من وجود تحديثات Check for Updates للبحث عن تحديثات البرنامج.
es: - Buscar actualizaciones: Buscar actualizaciones del programa.
fr: - Rechercher les mises à jour : Rechercher les mises à jour du programme.
ru: - Проверка обновлений : Поиск обновлений программы .
tr: - Güncelleme Kontrolü: Program güncellemelerini arayın.
vi: - Kiểm tra cập nhật: Tìm kiếm bản cập nhật cho chương trình.

source: - Contact Us: Display menus with options to contact the program developers.
ar: - اتصل بنا Contact us لعرض قوائم تحتوي على خيارات للتواصل مع مطوري البرنامج.
es: - Contacto: Mostrar menús con opciones para ponerse en contacto con los desarrolladores del programa.
fr: - Contactez-nous : Affiche des menus avec des options pour contacter les développeurs du programme.
ru: - Связаться с нами : Отображение меню с опциями для связи с разработчиками программы .
tr: - Bizimle iletişime geç: Program geliştiricileriyle iletişim kurma seçeneklerini içeren menüyü görüntüleyin.
vi: - Liên hệ với chúng tôi: Hiển thị menu với các tùy chọn để liên hệ với nhà phát triển chương trình.

source: - Donate: donate to the developers of Sound Transcriber.
ar: - التبرع Donate: التبرع لمطوري برنامج Sound Transcriber.
es: - Donar: Donar a los desarrolladores de Sound Transcriber.
fr: - Faire un don : soutenir les développeurs de Sound Transcriber.
ru: - Пожертвовать: пожертвуйте разработчикам Sound Transcriber.
tr: -bağıştabulun: sound transcriber geliştiricilerine bağışta bulunmanızı sağlar.
vi: - Quyên góp: ủng hộ các nhà phát triển Sound Transcriber.

source: - Open Repository: Opens Sound Transcriber repository on GitHub, the program is not open source.
ar: - فتح المستودع Open Repository: يفتح مستودع Sound Transcriber على GitHub، البرنامج ليس مفتوح المصدر.
es: - Abrir el repositorio: Abre el repositorio de Sound Transcriber en GitHub, el programa no es de código abierto.
fr: - Accéder au référentiel : Ouvre le référentiel de Sound Transcriber sur GitHub, le programme n'est pas open source.
ru: - Открыть репозиторий: Открывает репозиторий Sound Transcriber на GitHub, программа не имеет открытого исходного кода.
tr: - depoyu aç: sound transcriber github deposunu açar, program açık kaynak deyildir.
vi: - Mở Kho Lưu Trữ: Mở kho lưu trữ của Sound Transcriber trên GitHub, chương trình không phải mã nguồn mở.

source: - About: Provides information about Sound Transcriber.
ar: - حول About لعرض معلومات عن Sound Transcriber.
es: - Acerca de: Proporciona información sobre Sound Transcriber.
fr: - À propos de : Fournit des informations sur Sound Transcriber.
ru: - О программе : Предоставляет информацию о программе Sound Transcriber.
tr: - Hakkında: Sound Transcriber hakkında bilgi sağlar.
vi: - Về: Cung cấp thông tin về Sound Transcriber.

source: ## Sound Transcriber Settings:
ar: ## إعدادات Sound Transcriber:
es: ## Ajustes de Sound Transcriber:
fr: ## Paramètres de Sound Transcriber :
ru: ## Настройки Sound Transcriber:
tr: ## Sound Transcriber Ayarları:
vi: ## Cài đặt Sound Transcriber:

source: Similar to the NVDA screen reader settings, the Sound Transcriber settings are categorized into several sections, each containing various options. You can navigate between sections using the up and down arrows. Use the Tab and Shift+Tab keys to scroll through the options within the selected section.
ar: تنقسم إعدادات Sound Transcriber على نحو مشابه لإعدادات قارئ الشاشة NVDA إلى عدة تصنيفات, كلٌّ منها يحتوي على بعض الخيارات، ويمكنك الانتقال بالسهمين الأعلى والأسفل بين أقسام الإعدادات ثم استخدام مفتاح التنقل Tab و Shift+Tab لتصفح خيارات القسم المحدد.
es: De forma similar a la configuración del lector de pantalla NVDA, los ajustes de Sound Transcriber se clasifican en varias secciones, cada una de las cuales contiene varias opciones. Puede navegar entre las secciones utilizando las flechas arriba y abajo. Utilice las teclas Tab y Shift+Tab para desplazarse por las opciones dentro de la sección seleccionada.
fr: Tout comme les paramètres du lecteur d'écran NVDA, les paramètres de Sound Transcriber sont répartis en plusieurs sections, chacune contenant diverses options. Vous pouvez naviguer entre les sections à l'aide des flèches vers le haut et vers le bas. Utilisez les touches Tab et Shift+Tab pour faire défiler les options dans la section sélectionnée.
ru: Подобно настройкам программы чтения с экрана NVDA, настройки Sound Transcriber разделены на нескольккатегорий, каждый из которых содержит различные параметры. Перемещаться между разделами можно с помощью стрелок вверх и вниз. Используйте клавиши Tab и Shift+Tab для перемещения по параметрам в выбранном разделе.
tr: NVDA ekran okuyucu ayarlarına benzer şekilde, Sound Transcriber ayarları çeşitli bölümlere ayrılmıştır ve her biri çeşitli seçenekler içerir. Bölümler arasında yukarı ve aşağı ok tuşlarını kullanarak gezinebilirsiniz. Seçili bölümdeki seçenekler arasında gezinmek için Sekme ve Shift+Sekme tuşlarını kullanın.
vi: - Tương tự như cài đặt trình đọc màn hình NVDA, cài đặt Sound Transcriber được phân loại thành nhiều phần, mỗi phần chứa các tùy chọn khác nhau. Bạn có thể điều hướng giữa các phần bằng cách sử dụng các phím mũi tên lên và xuống. Sử dụng các phím Tab và Shift+Tab để cuộn qua các tùy chọn trong phần đã chọn.

source: ### General:
ar: ### عام General:
fr: ### Général :
ru: ### Общие :
tr: ### Genel:
vi: ### Tổng quan:

source: This section includes various program-wide options:
ar: يحتوي هذا القسم على عدة خيارات تخص البرنامج بأكمله, وهي على النحو الآتي:
es: Esta sección incluye varias opciones del programa:
fr: Cette section comprend diverses options applicables à l'ensemble du programme :
ru: В этом разделе содержатся различные параметры программы:
tr: Bu bölüm, program genelinde geçerli olan çeşitli seçenekleri içerir:
vi: - Phần này bao gồm các tùy chọn khác nhau cho toàn bộ chương trình:

source: - Interface Language: Specify the program's language.
ar: - لغة الواجهة Interface Language لتحديد لغة البرنامج وخياراته.
es: - Idioma de la interfaz: Especifique el idioma del programa.
fr: - Langue de l'interface : Spécifie la langue du programme.
ru: - Язык интерфейса : Укажите язык программы .
tr: - Arayüz Dili: Programın dilini belirtin.
vi: - Ngôn ngữ giao diện: Xác định ngôn ngữ của chương trình.

source: - Service: Define the service used for file transcription.
ar: - الخدمة Service لتحديد الخدمة التي يتم استخدامها في تحويل الملفات.
es: - Servicio: Definir el servicio utilizado para la transcripción de archivos.
fr: - Service : Spécifie le service utilisé pour la transcription des fichiers.
ru: - Сервис : Определите сервис , используемый для транскрипции файлов .
tr: - Servis: Dosya dönüştürme için kullanılan hizmeti tanımlayın.
vi: - Dịch vụ: Xác định dịch vụ được sử dụng để phiên âm tập tin.

source: - Files to transcribe simultaneously: This feature allows you to specify the number of files to be transcribed simultaneously. This feature controls the number of clips from the same file that will be sent simultaneously after it is split.
ar: - الملفات المراد تحويلها في وقت واحد Files to transcribe simultaneously: تتيح لك هذه الميزة تحديد عدد الملفات التي سيتم تحويلها في وقت واحد. This feature controls the number of clips from the same file that will be sent simultaneously after it is split.
es: - Archivos para transcribir simultáneamente: Esta función le permite especificar el número de archivos que se transcribirán de manera simultánea. Esta función controla la cantidad de clips del mismo archivo que se mandarán simultáneamente después de que éste se divida.
fr: - Fichiers à transcrire simultanément : Cette fonction vous permet de spécifier le nombre de fichiers à transcrire simultanément. Elle contrôle le nombre de segments du même fichier qui seront envoyés simultanément après sa division.
ru: - Файлы для одновременной транскрипции : Эта функция позволяет указать количество файлов , которые будут транскрибироваться одновременно .
tr: Aynı anda dönüştürülecek dosyalar: Bu özellik, aynı anda kaç dosyanın dönüştürüleceğini ve bir dosya bölündükten sonra aynı anda kaç parçanın gönderileceğini kontrol etmenize olanak tanır.
vi: - Các tập tin để phiên âm đồng thời: Tính năng này cho phép bạn chỉ định số lượng tập tin cần phiên âm đồng thời. Tính năng này kiểm soát số lượng clip từ cùng một tập tin sẽ được gửi đồng thời sau khi nó được chia nhỏ.

source: - Auto detect if there is a file in the clipboard: The program checks your clipboard on startup, and if it finds a supported file, it automatically selects its path for quick conversion.
ar: - الكشف التلقائي عن وجود ملف في الحافظة Auto detect if there is a file in the clipboard لجعل البرنامج يتحقق من حافظة جهازك عند فتحه في كل مرة؛ فإذا وجد ملفًا مدعومًا قام بتحديد مساره لبدء التحويل بسرعة.
es: - Detectar automáticamente si hay un archivo en el portapapeles: El programa comprueba el portapapeles al iniciarse y, si encuentra un archivo compatible, selecciona automáticamente su ruta para una conversión rápida.
fr: - Détection automatique de la présence d'un fichier dans le presse-papiers : Le programme vérifie votre presse-papiers au démarrage et, s'il trouve un fichier pris en charge, il sélectionne automatiquement son chemin d'accès pour une conversion rapide.
ru: - Автоопределение наличия файла в буфере обмена : Программа проверяет буфер обмена при запуске и , если находит поддерживаемый файл , автоматически выбирает путь к нему для быстрой конвертации .
tr: - Pano'da dosya olup olmadığını otomatik algıla: Program başlatıldığında panonuzu kontrol eder ve desteklenen bir dosya bulursa, hızlı dönüşüm için yolunu otomatik olarak seçer.
vi: - Tự động phát hiện nếu có tập tin trong khay nhớ tạm: Chương trình kiểm tra khay nhớ tạm của bạn khi khởi động, và nếu tìm thấy tập tin được hỗ trợ, nó sẽ tự động chọn đường dẫn của tập tin đó để chuyển đổi nhanh chóng.

source: - Ask what to do when a file is detected in the clipboard: If enabled, the program will prompt you on how to handle the detected file.
ar: - السؤال عما ينبغي فعله عند اكتشاف ملف في الحافظة Ask what to do when a file is detected in the clipboard هذا الخيار مرتبط بالخيار السابق؛ فإذا تم تحديده سألك البرنامج عما ينبغي فعله بالملف المكتشف.
es: - Preguntar qué hacer cuando se detecta un archivo en el portapapeles: Si está activado, el programa le preguntará cómo manejar el archivo detectado.
fr: - Demander ce qu'il faut faire lorsqu'un fichier est détecté dans le presse-papiers : Si cette option est activée, le programme vous demandera comment traiter le fichier détecté.
ru: - Спрашивать , что делать при обнаружении файла в буфере обмена : Если эта функция включена , программа спросит вас , как поступить с обнаруженным файлом .
tr: - Pano'da bir dosya algılandığında ne yapılacağını sor: Etkinleştirilirse, program algılanan dosyayla nasıl başa çıkılacağını size sorar.
vi: - Hỏi phải làm gì khi phát hiện tập tin trong khay nhớ tạm: Nếu được bật, chương trình sẽ nhắc bạn cách xử lý tập tin được phát hiện.

source: - Sounds: Activate alert sounds when the conversion starts and ends.
ar: - الأصوات Sounds لتفعيل أصوات التنبيهات عند بدء التحويل وانتهائه.
es: - Sonidos: Activa sonidos de alerta cuando se inicia y finaliza la conversión.
fr: - Sons : Activez les sons d'alerte au début et à la fin de la conversion.
ru: - Произносить действия : Включите функцию чтения с экрана для предоставления информации о состоянии преобразования .
tr: - Sesler: Dönüşüm başladığında ve bittiğinde uyarı seslerini etkinleştirin.
vi: - Âm thanh: Kích hoạt âm thanh cảnh báo khi quá trình chuyển đổi bắt đầu và kết thúc.

source: - Speak Actions: Enable the screen reader to provide conversion status information.
ar: - نطق الإجراءات Speak Actions لجعل قارئ الشاشة يعلمك عن حالة التحويل.
es: - Acciones habladas: Activar el lector de pantalla para proporcionar información sobre el estado de la conversión.
fr: - Enoncer les actions : Permet au lecteur d'écran de fournir des informations sur l'état de la conversion.
ru: - Автоматически проверять обновления : Автоматический поиск обновлений программы при запуске .
tr: - Eylemleri Sesli Olarak Söyle: Ekran okuyucunun dönüşüm durumu bilgilerini sağlamasına izin verir.
vi: - Nói hành động: Cho phép trình đọc màn hình cung cấp thông tin trạng thái chuyển đổi.

source: - Check for Updates Automatically: Automatically search for program updates upon startup.
ar: - التحقق التلقائي من التحديثات Check for Updates Automatically للبحث عن تحديثات البرنامج بشكل آلي عند فتحه.
es: - Buscar actualizaciones automáticamente: Buscar automáticamente actualizaciones del programa al iniciarse.
fr: - Rechercher automatiquement les mises à jour : Recherche automatiquement les mises à jour du programme au démarrage.
ru: - Автоматически проверять обновления : Автоматический поиск обновлений программы при запуске .
tr: - Güncellemeleri Otomatik Olarak Kontrol Et: Program başlatıldığında otomatik olarak güncellemeleri arar.
vi: - Kiểm tra cập nhật tự động: Tự động tìm kiếm bản cập nhật chương trình khi khởi động.

source: - Include beta versions when checking for updates: enables you to receive beta updates for the program. More details can be found in the beta updates section of this guide.
ar: - تضمين الإصدارات التجريبية عند التحقق من التحديثات Include beta versions when checking for updates: يمكنك من تلقي تحديثات تجريبية للبرنامج. يمكن العثور على مزيد من التفاصيل في قسم التحديثات التجريبية في هذا الدليل.
es: - Incluir versiones beta al buscar actualizaciones: permite recibir las actualizaciones beta para el programa. Se explican más detalles en el apartado de actualizaciones beta de esta guía.
fr: - Inclure les versions bêta dans la recherche de mises à jour : permet de recevoir les mises à jour bêta du programme. Vous trouverez plus de détails dans la section "Mises à jour bêta" de ce guide.
ru: - Включать бета - версии при проверке обновлений : позволяет получать бета - версии обновлений для программы . Более подробную информацию можно найти в разделе " Бета - версии " данного руководства .
tr: - Güncellemeleri kontrol ederken beta sürümlerini kapsa: Program için beta güncellemelerini almanızı sağlar. Bu kılavuzun beta güncellemeleri bölümünde daha fazla bilgi bulabilirsiniz.
vi: Bao gồm các phiên bản beta khi kiểm tra cập nhật: cho phép bạn nhận các bản cập nhật beta cho chương trình. Bạn có thể tìm thêm thông tin trong phần cập nhật beta của hướng dẫn này.
