Repository: Kostenkov-2021/SoundTranscriber
Catalog: documentation/*/SoundTranscriberUserGuide.po
Languages: ar, es, fr, ru, tr, vi

source: - Some options may not always be translated into your preferred language when using beta versions.
ar: - قد لا تتم دائمًا ترجمة بعض الخيارات إلى لغتك المفضلة عند استخدام الإصدارات التجريبية.
es: - Algunas opciones pueden no estar siempre traducidas a su idioma al usar versiones beta.
fr: - Certaines options ne sont pas toujours traduites dans la langue de votre choix lorsque vous utilisez les versions bêta.
ru: - При использовании бета - версий некоторые опции могут быть не всегда переведены на выбранный вами язык .
tr: - Beta sürümlerinde tüm seçenekler her zaman tercih ettiğiniz dile çevrilmeyebilir.
vi: - Một số tùy chọn có thể không phải lúc nào cũng được dịch sang ngôn ngữ ưa thích của bạn khi sử dụng phiên bản beta.

source: - We recommend beta testing only if you are comfortable with identifying and sharing bugs.
ar: - نوصي باختبار التحديثات التجريبية فقط إذا كنت تفضل العثور على الأخطاء ومشاركتها.
es: - Recomendamos probar la beta solo si se siente cómodo identificando y compartiendo errores.
fr: - Nous vous recommandons de ne procéder à des tests bêta que si vous êtes à l'aise avec l'identification et le partage des bogues.
ru: - Мы рекомендуем проводить бета - тестирование только в том случае , если вам удобно выявлять ошибки и делиться ими .
tr: - Beta testlerini, hataları belirlemekte ve paylaşmakta rahat olan kişilere öneririz.
vi: - Chúng tôi khuyên bạn chỉ nên thử nghiệm beta nếu bạn cảm thấy thoải mái với việc xác định và chia sẻ lỗi.

source: To opt into beta updates, navigate to Settings > General, enable the "Include beta versions when checking for updates" option, and then search for updates.
ar: للاشتراك في التحديثات التجريبية، انتقل إلى الإعدادات > عام، وقم بتمكين خيار "تضمين الإصدارات التجريبية عند التحقق من وجود تحديثات"، ثم ابحث عن التحديثات.
es: Para optar a las actualizaciones beta, navegue a los ajustes > General, habilite la opción "Incluir versiones beta al buscar actualizaciones" y luego busque actualizaciones.
fr: Pour bénéficier des mises à jour bêta, accédez à Paramètres > Général, activez l'option "Inclure les versions bêta lors de la recherche de mises à jour", puis recherchez les mises à jour.
ru: Чтобы перейти к бета-версиям, перейдите в "Настройки" > "Общие", включите опцию "Включать бета-версии при проверке обновлений", а затем выполните поиск обновлений.
tr: Beta güncellemelerine katılmak için Ayarlar > Genel bölümüne gidin, "Güncellemeleri kontrol ederken beta sürümlerini kapsa " seçeneğini etkinleştirin ve ardından güncellemeleri arayın.
vi: Để tham gia bản cập nhật beta, hãy vào Cài đặt > Chung, bật tùy chọn "Bao gồm các phiên bản beta khi kiểm tra cập nhật" và sau đó tìm kiếm bản cập nhật.

source: If you wish to revert to stable versions, simply disable the same option and then download and install the latest stable version.
ar: إذا كنت ترغب في العودة إلى الإصدارات المستقرة، فما عليك سوى تعطيل نفس الخيار ثم تنزيل أحدث إصدار مستقر وتثبيته.
es: Si desea volver a las versiones estables, simplemente desactive la misma opción y luego descargue e instale la última versión estable.
fr: Si vous souhaitez revenir aux versions stables, il vous suffit de désactiver cette même option, puis de télécharger et d'installer la dernière version stable.
ru: Если вы хотите вернуться к стабильным версиям, просто отключите ту же опцию, а затем загрузите и установите последнюю стабильную версию.
tr: Kararlı sürümlere geri dönmek isterseniz, aynı seçeneği devre dışı bırakın ve ardından en son kararlı sürümü indirin ve yükleyin.
vi: Nếu bạn muốn trở lại phiên bản ổn định, chỉ cần tắt tùy chọn tương tự, sau đó tải xuống và cài đặt phiên bản ổn định mới nhất.

source: We extend our heartfelt gratitude to everyone who contributes to testing Sound Transcriber, finding bugs, and sharing their insights.
ar: نود أن نشكر كل من يساهم في اختبار Sound Transcriber والعثور على الأخطاء ومشاركة الآراء والاقتراحات.
es: Extendemos nuestra más sincera gratitud a todos los que contribuyen probando Sound Transcriber, encontrando errores y compartiendo sus percepciones.
fr: Nous remercions sincèrement tous ceux qui contribuent à tester Sound Transcriber, à trouver des bogues et à partager leurs idées.
ru: Мы выражаем искреннюю благодарность всем, кто участвует в тестировании Sound Transcriber, находит ошибки и делится своими соображениями.
tr: Sound Transcriber'ı test eden, hataları bulan ve görüşlerini paylaşan herkese içtenlikle teşekkür ederiz.
vi: Chúng tôi gửi lời cảm ơn chân thành đến tất cả những người đã đóng góp vào việc thử nghiệm Sound Transcriber, tìm lỗi và chia sẻ những hiểu biết của họ.

source: ## How to Translate:
ar: ## كيفية الترجمة:
es: ## Cómo Traducir:
fr: ## Comment traduire :
ru: ## Как переводить :
tr: ## Nasıl Çevirilir:
vi: ## Cách dịch:

source: While Sound Transcriber currently supports only a limited number of languages in its interface options and user guide, it can transcribe speech to text in a wide array of languages.
ar: على الرغم من أن Sound Transcriber يدعم حاليًا عددًا محدودًا فقط من اللغات في خيارات الواجهة ودليل المستخدم، إلا إنه قادر على تحويل الكلام إلى نص بمجموعة واسعة من اللغات.
es: Aunque Sound Transcriber actualmente solo admite un número limitado de idiomas en sus opciones de interfaz y guía de usuario, puede transcribir el habla a texto en una amplia gama de idiomas.
fr: Bien que Sound Transcriber ne prenne actuellement en charge qu'un nombre limité de langues dans ses options d'interface et son guide de l'utilisateur, il peut transcrire la parole en texte dans un large éventail de langues.
ru: Хотя в настоящее время Sound Transcriber поддерживает лишь ограниченное число языков в опциях интерфейса и руководстве пользователя, он может транскрибировать речь в текст на широком спектре языков.
tr: Sound Transcriber şu anda yalnızca arayüz seçeneklerinde ve kullanıcı kılavuzunda sınırlı sayıda dili desteklemektedir, ancak çok geniş bir dil yelpazesinde konuşmayı metne dönüştürebilir.
vi: Mặc dù Sound Transcriber hiện chỉ hỗ trợ một số ngôn ngữ giới hạn trong các tùy chọn giao diện và hướng dẫn người dùng, nhưng nó có thể phiên âm giọng nói thành văn bản trong nhiều ngôn ngữ khác nhau.

source: However, we warmly welcome anyone interested in translating the program into their native language.
ar: ومع ذلك، فإننا نرحب ترحيبًا حارًا بأي شخص مهتم بترجمة البرنامج إلى لغته الأم.
es: Sin embargo, damos la bienvenida a cualquier persona interesada en traducir el programa a su idioma nativo.
fr: Cependant, nous accueillons chaleureusement toute personne intéressée par la traduction du programme dans sa langue maternelle.
ru: Тем не менее, мы приветствуем всех, кто заинтересован в переводе программы на свой родной язык.
tr: Bununla birlikte, programı ana dilinize çevirmek isteyen herkesi memnuniyetle karşılıyoruz.
vi: Tuy nhiên, chúng tôi nhiệt liệt chào đón bất kỳ ai quan tâm đến việc dịch chương trình sang ngôn ngữ mẹ đẻ của họ.

source: ### Interface translation:
ar: ### ترجمة الواجهة:
es: ### Traducción de la interfaz:
fr: ### Traduction de l'interface :
ru: ### Перевод интерфейса:
tr: ### arayüz çevirisi:
vi: ### Dịch giao diện:

source: The translation of interface options primarily relies on .po files, which can be edited using the Poedit program. You can download Poedit from its official website, then navigate to the Sound Transcriber repository on GitHub or locate the program folder on your device. Next, locate the messages.pot file and open it in Poedit. From there, you can translate the strings into your preferred language, save the file (which will generate both a .po and a .mo file), and share these files with us.
ar: تعتمد ترجمة خيارات الواجهة بشكل أساسي على ملفات .po، والتي يمكن تحريرها باستخدام برنامج Poedit. يمكنك تنزيل Poedit من موقعه الرسمي، ثم الانتقال إلى مستودع Sound Transcriber على GitHub أو تحديد موقع مجلد البرنامج على جهازك. بعد ذلك، ابحث عن ملف messages.pot وافتحه في Poedit. ومن هناك، يمكنك ترجمة النصوص إلى لغتك المفضلة، وحفظ الملف (الذي سيؤدي إلى إنشاء ملف .po و‎.mo)، ومشاركة هذه الملفات معنا.
es: La traducción de las opciones de interfaz se basa principalmente en archivos .po, que se pueden editar usando el programa Poedit. Puede descargar Poedit desde su sitio web oficial, luego navegar al repositorio de Sound Transcriber en GitHub o localizar la carpeta del programa en su dispositivo. A continuación, localice el archivo messages.pot y ábralo en Poedit. Desde allí, puede traducir las cadenas a su idioma, guardar el archivo (lo que generará tanto un archivo .po como un .mo) y compartir estos archivos con nosotros.
fr: La traduction des options d'interface repose principalement sur les fichiers .po, qui peuvent être édités à l'aide du programme Poedit. Vous pouvez télécharger Poedit sur son site officiel, puis naviguer vers le dépôt Sound Transcriber sur GitHub ou localiser le dossier du programme sur votre appareil. Localisez ensuite le fichier messages.pot et ouvrez-le dans Poedit. À partir de là, vous pouvez traduire les chaînes de caractères dans la langue de votre choix, enregistrer le fichier (qui générera un fichier .po et un fichier .mo) et partager ces fichiers avec nous.
ru: Перевод опций интерфейса в основном опирается на файлы . po, которые можно редактировать с помощью программы Poedit. Вы можете скачать Poedit с официального сайта, затем перейти в репозиторий Sound Transcriber на GitHub или найти папку с программой на вашем устройстве. Далее найдите файл messages.pot и откройте его в Poedit. После этого вы можете перевести строки на нужный вам язык, сохранить файл (при этом будут созданы файлы . po и . mo) и поделиться этими файлами с нами.
tr: Arayüz seçeneklerinin çevirisi öncelikle .po dosyalarına dayanır ve Poedit programı kullanılarak düzenlenebilir. Poedit'i resmi web sitesinden indirip, Sound Transcriber deposuna GitHub'da veya cihazınızdaki program klasörüne gidin. Daha sonra messages.pot dosyasını bulun ve Poedit'te açın. Buradan, dizeleri tercih ettiğiniz dile çevirebilir, dosyayı kaydedebilir (bu, hem .po hem de .mo dosyaları oluşturur) ve bu dosyaları bizimle paylaşabilirsiniz.
vi: Việc dịch các tùy chọn giao diện chủ yếu dựa vào các file .po, có thể được chỉnh sửa bằng chương trình Poedit. Bạn có thể tải xuống Poedit từ trang web chính thức của nó, sau đó điều hướng đến kho lưu trữ Sound Transcriber trên GitHub hoặc tìm thư mục chương trình trên thiết bị của bạn. Tiếp theo, tìm file messages.pot và mở nó trong Poedit. Từ đó, bạn có thể dịch các chuỗi sang ngôn ngữ ưa thích của mình, lưu file (sẽ tạo ra cả file .po và .mo), và chia sẻ những file này với chúng tôi.

source: ### Test translation:
ar: ### اختبار الترجمة:
es: ## Testear la Traducción:
fr: ### Tester un fichier de traduction :
ru: ### Тестирование перевода:
tr: ### çeviriyi testetme:
vi: ### Bản dịch kiểm tra:

source: Sound Transcriber can recognize and accommodate new translations, allowing you to test your translation before submitting it to us. To do this, navigate to the Languages folder, create a folder with the code for your language (the first two letters of the language), then create a subfolder named LC_MESSAGES, and place the .po and .mo files inside. Don't forget to name the files as SoundTranscriber.po and SoundTranscriber.mo.
ar: يستطيع برنامج Sound Transcriber التعرف على الترجمات الجديدة والتعامل معها، مما يمكنك اختبار ترجمتك قبل إرسالها إلينا. للقيام بذلك، انتقل إلى مجلد Languages، وأنشئ مجلدًا يحتوي على رمز لغتك (أول حرفين من اللغة)، ثم قم بإنشاء مجلد فرعي باسم LC MESSAGES، ثم ضع ملفات .po و.mo بداخله. لا تنس تسمية الملفات باسم SoundTranscriber.po و SoundTranscriber.mo.
es: Sound Transcriber puede reconocer nuevas traducciones, lo que permite probar su traducción antes de enviarla. Para hacer esto, navegue a la carpeta de Idiomas, cree una carpeta con el código del idioma (las primeras dos letras del idioma), luego cree una subcarpeta llamada LC_MESSAGES y coloque los archivos .po y .mo dentro. No olvide nombrar los archivos como SoundTranscriber.po y SoundTranscriber.mo.
fr: Sound Transcriber peut reconnaître et prendre en charge de nouvelles traductions, ce qui vous permet de tester votre traduction avant de nous la soumettre. Pour ce faire, allez dans le dossier Languages, créez un dossier avec le code de votre langue (les deux premières lettres de la langue), puis créez un sous-dossier nommé LC_MESSAGES, et placez-y les fichiers .po et .mo. N'oubliez pas de nommer les fichiers SoundTranscriber.po et SoundTranscriber.mo.
ru: Sound Transcriber может распознавать и адаптировать новые переводы, позволяя вам протестировать свой перевод перед отправкой нам. Для этого перейдите в папку Languages, создайте папку с кодом вашего языка (первые две буквы языка), затем создайте подпапку с именем LC_MESSAGES и поместите в неё файлы . po и . mo. Не забудьте назвать файлы SoundTranscriber.po и SoundTranscriber.mo.
tr: Sound Transcriber, yeni çevirileri tanıyabilir ve siz çevirinizi göndermeden önce test etmenize olanak tanır. Bunu yapmak için, Languages klasörüne gidin, dilinizin koduyla (dilin ilk iki harfi) bir klasör oluşturun, ardından LC\_MESSAGES adlı bir alt klasör oluşturun ve .po ve .mo dosyalarını içine yerleştirin. Dosyaları SoundTranscriber.po ve SoundTranscriber.mo olarak adlandırmayı unutmayın.
vi: Sound Transcriber có thể nhận biết và tiếp nhận các bản dịch mới, cho phép bạn kiểm tra bản dịch của mình trước khi gửi cho chúng tôi. Để làm điều này, hãy điều hướng đến thư mục Languages, tạo một thư mục có mã ngôn ngữ của bạn (hai chữ cái đầu tiên của ngôn ngữ), sau đó tạo một thư mục con có tên LC_MESSAGES và đặt các tệp .po và .mo vào bên trong. Đừng quên đặt tên cho các tệp là SoundTranscriber.po và SoundTranscriber.mo.

source: ### Documentation translation:
ar: ### ترجمة المستندات:
es: ### Traducción de la documentación:
fr: ### Traduction de la documentation :
ru: ### Перевод документации:
tr: ### dökümantasyon çevirisi:
vi: ### Bản dịch tài liệu:

source: While translation of the update log and user guide is not mandatory, you can translate them into your language using .pot files.
ar: في حين أن ترجمة سجل التحديثات ودليل المستخدم ليست إلزامية، يمكنك ترجمتها إلى لغتك باستخدام ملفات .pot.
es: Si bien la traducción de las novedades y de la guía de usuario no es obligatoria, puede traducirlas a su idioma usando archivos .pot.
fr: Bien que la traduction du journal des mises à jour et du guide de l'utilisateur ne soit pas obligatoire, vous pouvez les traduire dans votre langue à l'aide de fichiers .pot.
ru: Хотя перевод истории изменений и руководства пользователя не является обязательным, вы можете перевести их на свой язык с помощью pot-файлов.
tr: Güncelleme günlüğü ve kullanıcı kılavuzunu dilinize çevirmek zorunlu değilse de, bunu .pot dosyalarını kullanarak yapabilirsiniz.
vi: Mặc dù dịch nhật ký cập nhật và hướng dẫn sử dụng không bắt buộc, bạn có thể dịch chúng sang ngôn ngữ của mình bằng cách sử dụng các tập tin .pot.

source: We use .md files to create .pot files, which we then send to translators. After that, we convert the .po files we receive from the translators back into .md files and then into .html files to include with the program.
ar: نستخدم ملفات .md لإنشاء ملفات .pot، التي نرسلها بعد ذلك إلى المترجمين. بعد ذلك، نقوم بتحويل ملفات .po التي نتلقاها من المترجمين مرة أخرى إلى ملفات .md ثم إلى ملفات .html لتضمينها مع البرنامج.
es: Usamos ficheros .md para crear ficheros .pot, que luego mandamos a los traductores. Después, convertimos los ficheros .po que los traductores nos han vuelto a mandar de vuelta a ficheros .md, y después a ficheros.html para incluir con el programa.
fr: Nous utilisons des fichiers .md pour créer des fichiers .pot que nous envoyons ensuite aux traducteurs. Après quoi, nous reconvertissons les fichiers .po reçus des traducteurs en fichiers .md, puis en fichiers .html pour les inclure au programme.
ru: Мы используем .md-файлы для создания .pot-файлов, которые затем отправляем переводчикам. После этого мы конвертируем .po-файлы, полученные от переводчиков, обратно в .md-файлы, а затем в .html-файлы для включения в программу.
tr: .md dosyalarını kullanarak .pot dosyaları oluşturuyoruz ve bu dosyaları çevirmenlere gönderiyoruz. Çevirmenlerden aldığımız .po dosyalarını tekrar .md dosyalarına ve ardından .html dosyalarına dönüştürerek programa dahil ediyoruz.
vi: Chúng tôi sử dụng các tập tin .md để tạo các tập tin .pot, sau đó chúng tôi gửi tập tin này cho người dịch. Sau đó, chúng tôi chuyển đổi các tập tin .po mà chúng tôi nhận được từ người dịch thành tập tin .md rồi thành tập tin .html để đưa vào chương trình.

source: This allows us to make corrections to any part of the manual and changelog, ensuring they are applied consistently across all supported languages. It also ensures that files in different languages remain in exactly the same format and structure.
ar: يتيح لنا هذا إجراء تصحيحات على أي جزء من الدليل وسجل التغييرات، مما يضمن تطبيقها بشكل متسق عبر جميع اللغات المدعومة. كما يضمن أن تظل الملفات باللغات المختلفة بنفس التنسيق والهيكل تماماً.
es: Esto nos permite hacer correcciones a cualquier parte del manual y las novedades, asegurando que se aplican de manera consistente a todos los idiomas. También asegura que los ficheros en distintas lenguas permanecen en el mismo formato y estructura.
fr: Cela nous permet de corriger toute partie du manuel et du journal des modifications, en garantissant leur application cohérente dans toutes les langues prises en charge. Cela garantit également que les fichiers dans différentes langues conservent exactement le même format et la même structure.
ru: Это позволяет нам вносить исправления в любую часть руководства и систории изменений, гарантируя их единообразное применение на всех поддерживаемых языках. Это также гарантирует, что файлы на разных языках будут иметь одинаковый формат и структуру.
tr: Bu, kılavuzun ve güncelleme günlüğünün herhangi bir bölümünde düzeltme yapmamıza ve bu düzeltmelerin tüm desteklenen dillerde tutarlı bir şekilde uygulanmasını sağlamamıza izin verir. Ayrıca, farklı dillerdeki dosyaların tam olarak aynı format ve yapıda kalmasını sağlar.
vi: Điều này cho phép chúng tôi sửa lỗi bất kỳ phần nào của hướng dẫn và nhật ký thay đổi, đảm bảo chúng được áp dụng nhất quán trên tất cả các ngôn ngữ được hỗ trợ. Nó cũng đảm bảo rằng các tập tin ở các ngôn ngữ khác nhau vẫn giữ nguyên định dạng và cấu trúc.

source: To translate files, follow these steps:
ar: لترجمة الملفات، اتبع هذه الخطوات:
es: Para traducir ficheros, siga estos pasos:
fr: Pour traduire les fichiers, suivez ces étapes :
ru: Чтобы перевести файлы, выполните следующие действия:
tr: Dosyaları çevirmek için şu adımları takip edin:
vi: Để dịch các tập tin, hãy làm theo các bước sau:

source: - Get the .pot files from the repository on GitHub or from the Documentation folder in the Sound Transcriber directory.
ar: - احصل على ملفات .pot من المستودع على GitHub أو من مجلد Documentation في دليل Sound Transcriber.
es: - Obtenga los ficheros .pot del repositorio en GitHub o de la carpeta de documentación en el directorio de Sound Transcriber.
fr: - Récupérez les fichiers .pot depuis le référentiel GitHub ou depuis le dossier Documentation dans le répertoire de Sound Transcriber.
ru: - Получите файлы .pot из репозитория на GitHub или из папки документации в каталоге Sound Transcriber.
tr: - GitHub deposundan veya Sound Transcriber dizinindeki Documentation klasöründen .pot dosyalarını alın.
vi: - Lấy các tập tin .pot từ kho lưu trữ trên GitHub hoặc từ thư mục Documentation trong thư mục Sound Transcriber.

source: - Translate them using Poedit.
ar: - قم بترجمتها باستخدام برنامج Poedit.
es: - Tradúzcalos usando Poedit.
fr: - Utilisez Poedit pour les traduire.
ru: - Переведите их с помощью Poedit.
tr: - çevirmek için Poedit programını kullanın.
vi: - Dịch chúng bằng Poedit.

source: - You may find some phrases repeated with additional periods. We use this to distinguish between phrases, ensuring they stay in the correct positions. Add the same number of periods, and we will remove them when incorporating the translation.
ar: - قد تجد بعض العبارات مكررة مع نقاط إضافية. نستخدم هذا للتمييز بين العبارات، مما يضمن بقاءها في المواضع الصحيحة. أضف نفس عدد النقاط، وسنقوم بإزالتها عند دمج الترجمة.
es: - Puede ser que encuentre frases repetidas con puntos adicionales. Usamos esto para distinguir frases, asegurando que están en las posiciones correctas. Añada la misma cantidad de puntos, y nosotros los quitaremos al incorporar la traducción.
fr: - Vous pourriez trouver certaines phrases répétées avec des points supplémentaires. Nous utilisons cela pour distinguer les phrases, en veillant à ce qu'elles restent aux bonnes positions. Ajoutez le même nombre de points, et nous les retirerons lors de l'incorporation de la traduction.
ru: - Некоторые фразы могут повторяться с дополнительными точками. Мы используем это для того, чтобы различать фразы и следить за тем, чтобы они стояли в правильном порядке. Добавьте столько же точек, и мы уберём их при добавлении перевода в программу.
tr: - Bazı ifadelerin ek noktalarla tekrarlandığını görebilirsiniz. Bu, ifadeler arasında ayrım yapmak ve doğru konumlarında kalmalarını sağlamak için kullanılır. Aynı sayıda nokta ekleyin, biz çeviriyi dahil ederken bunları kaldıracağız.
vi: - Bạn có thể thấy một số cụm từ được lặp lại với dấu chấm bổ sung. Chúng tôi sử dụng điều này để phân biệt các cụm từ, đảm bảo chúng ở đúng vị trí. Thêm cùng số lượng dấu chấm, và chúng tôi sẽ xóa chúng khi kết hợp bản dịch.

source: - Note that the texts may not appear in the correct order if the translation is incomplete. Once translated correctly, reopen the file to view them in the correct order.
ar: - لاحظ أن النصوص قد لا تظهر بالترتيب الصحيح إذا كانت الترجمة غير مكتملة. بمجرد الترجمة بشكل صحيح، أعد فتح الملف لعرضها بالترتيب الصحيح.
es: - Tenga en cuenta que puede ser que los textos no aparezcan en el orden correcto si la traducción está incompleta. Cuando la traducción ya esté correcta, reabra el fichero para verlos en el orden correcto.
fr: - Notez que les textes peuvent ne pas apparaître dans le bon ordre si la traduction est incomplète. Une fois traduits correctement, rouvrez le fichier pour les voir dans le bon ordre.
ru: - Обратите внимание, что тексты могут располагаться в неправильном порядке, если перевод неполный. После правильного перевода снова откройте файл, чтобы просмотреть их в правильном порядке.
tr: - Çeviri tamamlanmamışsa metinler doğru sırada görünmeyebilir. Doğru şekilde çevrildikten sonra, doğru sırayla görüntülemek için dosyayı yeniden açın.
vi: Lưu ý rằng văn bản có thể không xuất hiện theo thứ tự chính xác nếu bản dịch chưa hoàn chỉnh. Sau khi dịch chính xác, hãy mở lại tập tin để xem chúng theo thứ tự chính xác.

source: - Finally, share your files with us.
ar: - أخيراً، شارك ملفاتك معنا.
es: - Finalmente, comparta los archivos con nosotros.
fr: - Enfin, partagez vos fichiers avec nous.
ru: - Наконец, поделитесь с нами своими файлами.
tr: son olarak, dosyaları bizimle paylaşın.
vi: - Cuối cùng, hãy chia sẻ tập tin của bạn với chúng tôi.

source: ### notes:
ar: ### ملاحظات:
es: ### Notas:
ru: ### примечания :
tr: ### Notlar:
vi: ### lưu ý:
