Repository: Kostenkov-2021/SoundTranscriber
Catalog: documentation/*/SoundTranscriberUserGuide.po
Languages: ar, es, fr, ru, tr, vi

source: - Enable Logging: This feature allows Sound Transcriber to write a log of the transcription process steps. It's particularly useful for troubleshooting errors. When needed, activate logging and send us the generated file. If logging is disabled, older logs will be deleted, but details of the last step will be retained, This ensures that the program can log errors that may occur, even if you are unable to run the program for the first time and activate logging.
ar: - تمكين السجلات Enable Logging: تسمح هذه الميزة لـ Sound Transcriber بكتابة سجل لخطوات عملية التحويل. مفيد بشكل خاص لاستكشاف الأخطاء وإصلاحها. عند الحاجة، قم بتفعيل الخيار وأرسل لنا الملف الذي تم إنشاؤه. إذا تم تعطيل السجلات، فسيتم حذف السجلات الأقدم، ولكن سيتم الاحتفاظ بتفاصيل الخطوة الأخيرة، مما يضمن قدرة البرنامج على تسجيل الأخطاء التي قد تحدث، حتى لو لم تتمكن من تشغيل البرنامج لأول مرة وتفعيل السجلات.
es: - Permitir logs: Esta función permite que Sound Transcriber genere un archivo de registro de los pasos de la transcripción. Es particularmente útil para solucionar errores. Cuando se requiera, active esta función y mándenos el archivo generado. Si está deshabilitada, los archivos de registro antiguos serán borrados, pero los últimos detalles serán conservados. Esto asegura que el programa pueda registrar errores que puedan darse, incluso si no puede usar el programa por primera vez y activar la opción.
fr: - Activer la journalisation : Cette fonction permet à Sound Transcriber d'écrire un journal des étapes du processus de transcription. Elle est particulièrement utile pour dépanner les erreurs. Si nécessaire, activez la journalisation et envoyez-nous le fichier généré. Si la journalisation est désactivée, les anciens journaux seront supprimés, mais les détails de la dernière étape seront conservés. Cela garantit que le programme peut enregistrer les erreurs qui peuvent se produire, même si vous n'êtes pas en mesure de lancer le programme pour la première fois et d'activer la journalisation.
ru: - Включить ведение журнала : Эта функция позволяет Sound Transcriber записывать в журнал шаги процесса транскрипции. Это особенно полезно для устранения ошибок. При необходимости активируйте ведение журнала и отправьте нам созданный файл. Если запись журнала отключена, старые журналы будут удалены, но детали последнего шага будут сохранены. Это гарантирует, что программа сможет регистрировать ошибки, которые могут возникнуть, даже если вы не сможете запустить программу в первый раз и активировать запись журнала.
tr: - Günlük tutmayıü Etkinleştir: Bu özellik, Sound Transcriber'ın dönüştürme süreci adımlarının bir günlüğünü yazmasına izin verir. Özellikle hataları gidermek için kullanışlıdır. Gerektiğinde, günlüğü etkinleştirin ve bize oluşturulan dosyayı gönderin. Günlük devre dışı bırakıldığında, eski günlükler silinir, ancak son adımın ayrıntıları saklanır. Bu, programı ilk kez çalıştırıp günlüğü etkinleştiremeseniz bile hataları kaydedebilmesini sağlar.
vi: - Bật Ghi Nhật ký: Tính năng này cho phép Sound Transcriber ghi nhật ký các bước trong quá trình phiên âm. Nó đặc biệt hữu ích để khắc phục sự cố. Khi cần, hãy kích hoạt ghi nhật ký và gửi cho chúng tôi tệp được tạo. Nếu ghi nhật ký bị tắt, các nhật ký cũ sẽ bị xóa, nhưng chi tiết của bước cuối cùng sẽ được giữ lại. Điều này đảm bảo rằng chương trình có thể ghi nhật ký các lỗi có thể xảy ra, ngay cả khi bạn không thể chạy chương trình lần đầu tiên và kích hoạt ghi nhật ký.

source: - Restore Default Settings: Reset the settings to their default values.
ar: - استعادة الإعدادات الافتراضية Restore Default Settings لإرجاع الإعدادات إلى وضعها الافتراضي.
es: - Restaurar ajustes por defecto: Restablecer la configuración a sus valores por defecto.
fr: - Restaurer les paramètres par défaut : Réinitialise les paramètres à leurs valeurs par défaut.
ru: - Восстановить настройки по умолчанию : Восстановление настроек до значений по умолчанию .
tr: - Varsayılan Ayarlara Geridön : Ayarları varsayılan değerlere sıfırlayın.
vi: - Khôi phục cài đặt mặc định: Đặt lại cài đặt về giá trị mặc định.

source: ### Save options:
ar: ### خيارات الحفظ Save options:
es: ### Opciones de guardado:
fr: ### Options d'enregistrement :
ru: ### Параметры сохранения :
tr: ### Kaydetme Seçenekleri:
vi: ### Tùy chọn lưu:

source: The options in this section affect the saving functionality in the program's File menu.
ar: تؤثر خيارات هذا القسم على خيار الحفظ الموجود في قائمة "ملف" في البرنامج.
es: Las opciones de esta sección afectan a la funcionalidad de guardado en el menú Archivo del programa.
fr: Les options de cette section affectent la fonctionnalité d'enregistrement dans le menu Fichier du programme.
ru: Опции этого раздела влияют на функцию сохранения в меню Файл программы.
tr: Bu bölümdeki seçenekler, programın Dosya menüsündeki kaydetme işlevini etkiler.
vi: - Các tùy chọn trong phần này ảnh hưởng đến chức năng lưu trong trình đơn Tập tin của chương trình.

source: - Auto Save Files: Enable automatic saving of the conversion results.
ar: - حفظ الملفات تلقائيا Auto Save files لجعل البرنامج يحفظ نتائج التحويل في ملفات بشكل آلي.
es: - Autoguardar archivos: Activa el guardado automático de los resultados de la conversión.
fr: - Enregistrement automatique des fichiers : Active l'enregistrement automatique des résultats de la conversion.
ru: - Автосохранение файлов : Включить автоматическое сохранение результатов конвертации . - Путь сохранения : Отображает текущий путь для сохранения файлов . Для его изменения используйте кнопку Обзор .
tr: - Dosyaları Otomatik Kaydet: Dönüştürme sonuçlarının otomatik olarak kaydedilmesini etkinleştirir.
vi: - Tự động lưu tập tin: Cho phép tự động lưu kết quả chuyển đổi.

source: - Save Path: Displays the current path for saving files. Use the Browse button to change it.
ar: - مسار الحفظ Save Path لمعرفة المسار المحدد لحفظ الملفات، ثم زر تصفح Browse لتغييره.
es: - Ruta de salida: Muestra la ruta actual en la que se guardan los archivos. Utilice el botón Examinar para cambiarla.
fr: - Chemin d'enregistrement : Affiche le chemin d'accès actuel pour l'enregistrement des fichiers. Utilisez le bouton Parcourir pour le modifier.
ru: - Путь сохранения : Отображает текущий путь для сохранения файлов . Для его изменения используйте кнопку Обзор .
tr: - Kaydetme Yolu: Dosyaların kaydedileceği geçerli yolu gösterir. Değiştirmek için Gözat düğmesini kullanın.
vi: - Đường dẫn lưu: Hiển thị đường dẫn hiện tại để lưu tập tin. Sử dụng nút Duyệt để thay đổi nó.

source: - Save as .txt: Enable automatic file saving with the .txt extension.
ar: - حفظ بصيغة .txt, Save as Text File لتفعيل حفظ الملف تلقائيا بهذا الامتداد.
es: - Guardar como fichero .txt: Permite guardar automáticamente los archivos con extensión .txt.
fr: - Enregistrer sous .txt : Active l'enregistrement automatique des fichiers avec l'extension .txt.
ru: - Сохранить как .txt: Включить автоматическое сохранение файлов с расширением . txt.
tr: - .txt Olarak Kaydet: Dosyanın .txt uzantısıyla otomatik olarak kaydedilmesini sağlar.
vi: - Lưu dưới dạng .txt: Cho phép tự động lưu tập tin với phần mở rộng .txt.

source: - Save as .docx: Save the file with the .docx extension.
ar: - حفظ بصيغة .docx, Save as .Docx File لحفظ الملف بهذا الامتداد.
es: - Guardar como fichero .docx: Guardar el archivo con la extensión .docx.
fr: - Enregistrer sous .docx : Enregistre le fichier avec l'extension .docx.
ru: - Сохранить как .docx: Сохранить файл с расширением . docx.
tr: - .docx Olarak Kaydet: Dosyayı .docx uzantısıyla kaydeder.
vi: - Lưu dưới dạng .docx: Lưu tập tin với phần mở rộng .docx.

source: - Save as Subtitle File: Save the file with the .srt extension.
ar: - حفظ بصيغة ملف ترجمات Save as Subtitle File لحفظ الملف بامتداد .srt.
es: - Guardar como fichero de subtítulos: Guardar el archivo con la extensión .srt.
fr: - Enregistrer comme fichier de sous-titres : enregistrer le fichier avec l'extension .srt.
ru: - Сохранить как файл субтитров : сохранение файла с расширением .srt.
tr: - Altyazı Dosyası Olarak Kaydet: Dosyayı .srt uzantısıyla kaydeder.
vi: - Lưu dưới dạng Tập tin phụ đề: Lưu tập tin với phần mở rộng .srt.

source: - Keep downloaded files. Files downloaded from the Internet will be kept after conversion. If it is disabled, the file will be downloaded, converted and then deleted.
ar: - الاحتفاظ بالملفات التي تم تنزيلها, سيتم الحتفاظ بالملفات التي تم تنزيلها من الإنترنت لتحويلها, في حال تم تعطيله, سيتم تنزيل الملف وتحويله ثم حذفه.
es: - Mantener archivos descargados. Los archivos descargados de Internet se conservarán después de la conversión. Si está desactivada, el archivo se descargará, se convertirá y luego se borrará.
fr: - Conserver les fichiers téléchargés : Les fichiers téléchargés sur Internet seront conservés après la conversion. Si cette option est désactivée, le fichier sera téléchargé, converti puis supprimé.
ru: - Сохранять загруженные файлы . Файлы , загруженные из Интернета , будут сохранены после преобразования . Если эта функция отключена , файл будет загружен , преобразован , а затем удален .
tr: - İndirilen dosyaları sakla: İnternetten indirilen dosyalar dönüşümden sonra saklanacaktır. Devre dışı bırakılırsa, dosya indirilecek, dönüştürülecek ve ardından silinecektir.
vi: - Giữ các tập tin đã tải xuống. Các tập tin tải về từ Internet sẽ được lưu giữ sau khi chuyển đổi. Nếu nó bị tắt, tập tin sẽ được tải xuống, chuyển đổi và sau đó bị xóa.

source: If the AutoSave feature is disabled, the "Save" option in the "File" menu will perform the same function, saving files according to the specified extensions and path.
ar: في حال قمت بتعطيل ميزة الحفظ التلقائي, فسيؤدي خيار "حفظ" في قائمة "ملف" الوظيفة نفسها, بمعنى أنه سيحفظ الملفات وفقا للامتدادات المحددة وفي المسار المحدد هنا.
es: Si la función Autoguardar está desactivada, la opción "Guardar" del menú "Archivo" realizará la misma función, guardando los archivos según las extensiones y la ruta especificadas.
fr: Si la fonction d'enregistrement automatique "Auto Save" est désactivée, l'option "Enregistrer" dans le menu "Fichier" exécutera la même fonction, en enregistrant les fichiers selon les extensions et le chemin spécifiés.
ru: Если функция автосохранения отключена, пункт "Сохранить" в меню "Файл" будет выполнять ту же функцию, сохраняя файлы в соответствии с указанными расширениями и путем.
tr: Otomatik Kaydetme özelliği devre dışı bırakıldığında, "Dosya" menüsündeki "Kaydet" seçeneği aynı işlevi yerine getirir, dosyaları belirtilen uzantılara ve yola göre kaydeder.
vi: - Nếu tính năng Lưu tự động bị tắt, tùy chọn "Lưu" trong trình đơn "Tập tin" sẽ thực hiện chức năng tương tự, lưu tệp theo phần mở rộng và đường dẫn đã chỉ định.

source: This section requires you to enter a secure API key in the provided text box named "Secret Key." You can click the edit button to modify the key. Additionally, you can adjust the segment duration by specifying the duration of each part of the file when using this service.
ar: ليس ثمة الكثير مما لذكره هنا, فلديك مربع كتابة آمن باسم Secret Key يحتوي على مفتاح API يمكنك الضغط على زر تعديل edit وتغييره, أو Segment duration by seconds لتغيير مدة كل جزء من أجزاء الملف عند استخدام هذه الخدمة.
es: Esta sección requiere que introduzca una clave API segura en el cuadro de texto "Clave secreta". Puede hacer clic en el botón de edición para modificar la clave. Además, puede ajustar la duración del segmento especificando la duración de cada parte del archivo cuando utilice este servicio.
fr: Dans cette section, vous devez saisir une clé API sécurisée dans la zone de texte intitulée "Clé secrète". Vous pouvez cliquer sur le bouton "Modifier" pour modifier la clé. En outre, vous pouvez ajuster la durée du segment en spécifiant la durée de chaque partie du fichier lorsque vous utilisez ce service.
ru: В этом разделе необходимо ввести безопасный ключ API в текстовое поле под названием "Секретный ключ". Вы можете нажать кнопку редактирования, чтобы изменить ключ. Кроме того, при использовании этой службы можно настроить длительность сегмента, указав длительность каждой части файла.
tr: Bu bölümde, sağlanan "Gizli Anahtar" adlı metin kutusuna güvenli bir API anahtarı girmeniz gerekmektedir. Anahtarı değiştirmek için düzenle düğmesine tıklayabilirsiniz. Ayrıca, bu hizmeti kullanırken dosyanın her bir kısmının süresini belirterek segment süresini ayarlayabilirsiniz.
vi: Phần này yêu cầu bạn nhập khóa API bảo mật vào hộp văn bản được cung cấp có tên "Khóa bí mật". Bạn có thể nhấp vào nút chỉnh sửa để sửa đổi khóa. Ngoài ra, bạn có thể điều chỉnh thời lượng phân đoạn bằng cách chỉ định thời lượng của mỗi phần của tập tin khi sử dụng dịch vụ này.

source: Note that the file needs to be divided into several segments for conversion. The maximum duration per segment for this service is one minute.
ar: فكما ذكرنا, ينبغي تقسيم الملف على عدة أجزاء حتى يتم تحويله. الحد الأقصى لهذه الخدمة هو دقيقة واحدة لكل ملف.
es: Tenga en cuenta que el archivo debe dividirse en varios segmentos para su conversión. La duración máxima por segmento para este servicio es de un minuto.
fr: Notez que le fichier doit être divisé en plusieurs segments pour la conversion. La durée maximale par segment pour ce service est d'une minute.
ru: Обратите внимание, что для преобразования файл необходимо разделить на несколько сегментов. Максимальная продолжительность одного сегмента для этого сервиса составляет одну минуту.
tr: Bu hizmet için maksimum segment süresi bir dakikadır.
vi: Lưu ý rằng tập tin cần được chia thành nhiều đoạn để chuyển đổi. Thời lượng tối đa cho mỗi đoạn cho dịch vụ này là một phút.

source: Similar to the previous service, this section allows you to enter an API key. However, the maximum length for each file when using OpenAI is 30 seconds.
ar: تنطبق الخيارات المذكورة في الخدمة السابقة نفسها هنا, باستثناء أن الحد الأقصى لكل ملف هو 30 ثانية.
es: Similar al servicio anterior, esta sección le permite introducir una clave API. Sin embargo, la duración máxima de cada archivo cuando se utiliza OpenAI es de 30 segundos.
fr: Comme pour le service précédent, cette section vous permet d'introduire une clé API. Cependant, la durée maximale pour chaque fichier lors de l'utilisation d'OpenAI est de 30 secondes.
ru: Как и предыдущий сервис, этот раздел позволяет ввести ключ API. Однако максимальная продолжительность каждого файла при использовании OpenAI составляет 30 секунд.
tr: Bu bölüm, önceki hizmete benzer şekilde bir API anahtarı girmenize olanak tanır. Ancak, OpenAI kullanıldığında her dosyanın maksimum uzunluğu 30 saniyedir.
vi: Tương tự như dịch vụ trước, phần này cho phép bạn nhập khóa API. Tuy nhiên, độ dài tối đa cho mỗi tập tin khi sử dụng OpenAI là 30 giây.

source: As Wit.ai separates languages based on API keys, this section allows you to combine languages as follows:
ar: نظرا لأن هذه الخدمة تفصل اللغات بحسب مفاتيح API فقد تم تصميم هذا القسم من الإعدادات ليجمع اللغات على النحو الآتي:
es: Como Wit.ai separa los idiomas en función de las claves API, esta sección permite combinar idiomas de la siguiente manera:
fr: Comme Wit.ai sépare les langues en fonction des clés API, cette section vous permet de combiner les langues comme suit :
ru: Поскольку Wit.ai разделяет языки на основе API- ключей, этот раздел позволяет комбинировать языки следующим образом:
tr: Wit.ai dilleri API anahtarlarına göre ayırdığı için, bu bölümde dilleri birleştirme olanağı sağlar:
vi: Vì Wit.ai phân tách ngôn ngữ dựa trên khóa API, phần này cho phép bạn kết hợp ngôn ngữ như sau:

source: You will find a list of currently added languages.
ar: ستجد قائمة باللغات المضافة حاليًا.
es: Encontrará una lista de los idiomas añadidos actualmente.
fr: Vous trouverez une liste des langues actuellement ajoutées.
ru: Вы найдёте список добавленных в данный момент языков.
tr: Eklenen dillerin bir listesini bulacaksınız.
vi: Bạn sẽ tìm thấy danh sách các ngôn ngữ hiện được thêm vào.

source: Each language has a corresponding hidden edit field for the API key.
ar: تحتوي كل لغة على حقل تحرير مخفي مطابق لمفتاح API.
es: Cada idioma tiene un campo de edición oculto correspondiente para la clave API.
fr: Chaque langue a un champ d'édition caché correspondant pour la clé API.
ru: Каждый язык имеет соответствующее скрытое поле для редактирования API- ключа.
tr: Her dilin API anahtarı için karşılık gelen gizli bir düzenleme alanı vardır.
vi: Mỗi ngôn ngữ đều có một trường chỉnh sửa ẩn tương ứng cho khóa API.

source: You can edit the key by removing the old one, pasting the new key, and then use the Edit button. Alternatively, you can use the Add button to add a new key.
ar: يمكنك تعديل المفتاح عن طريق إزالة المفتاح القديم، ولصق المفتاح الجديد، ثم استخدام الزر "تحرير". وبدلاً من ذلك، يمكنك استخدام الزر "إضافة" لإضافة مفتاح جديد.
es: Puede editar la clave eliminando la antigua, pegando la nueva clave, y usando el botón de editar. Alternativamente, puede usar el botón Añadir para agregar la nueva clave.
ru: Вы можете отредактировать ключ, удалив старый, вставив новый, а затем воспользовавшись кнопкой Редактировать. Также можно воспользоваться кнопкой Добавить, чтобы добавить новый ключ. Выберите язык, соответствующий вашему приложению в Wit.ai, вставьте ключ и нажмите кнопку Добавить.
tr: Anahtarı düzenleyebilir, eski anahtarı kaldırıp yeni anahtarı yapıştırabilir ve ardından Düzenle düğmesini kullanabilirsiniz. Alternatif olarak, yeni bir anahtar eklemek için Ekle düğmesini kullanabilirsiniz.
vi: Bạn có thể chỉnh sửa khóa bằng cách xóa khóa cũ, dán khóa mới và sau đó sử dụng nút Chỉnh sửa. Ngoài ra, bạn có thể sử dụng nút Thêm để thêm một khóa mới.

source: Select the language matching your application in Wit.ai, paste the key, and click Add.
ar: عند الضغط على زر "إضافة", قم بتحديد اللغة لتتطابق مع اللغة التي حددتها لتطبيقك في موقع wit.ai ثم قم بلصق المفتاح واضغط إضافة Add.
es: Seleccione el idioma que coincida con su aplicación en Wit.ai, pegue la clave y haga clic en Añadir.
fr: Sélectionnez la langue correspondant à votre application dans Wit.ai, collez la clé et cliquez sur Ajouter.
ru: Выберите язык, соответствующий вашему приложению в Wit.ai, вставьте ключ и нажмите кнопку Добавить.
tr: Wit.ai uygulamanızla eşleşen dili seçin, anahtarı yapıştırın ve Ekle düğmesine tıklayın.
vi: Chọn ngôn ngữ phù hợp với ứng dụng của bạn trong Wit.ai, dán khóa và nhấp vào Thêm.

source: Repeat these steps for each language you intend to use. After obtaining a key from the Wit.ai site, return to the settings window to add it.
ar: كرر الخطوات مع اللغات التي تستخدمها. وبعبارة أخرى: بعد الحصول على مفتاح من الموقع، عد إلى نافذة الإعدادات هنا وقم بإضافته.
es: Repita estos pasos para cada idioma que vaya a utilizar. Después de obtener una clave del sitio Wit.ai, vuelva a la ventana de ajustes para añadirla.
fr: Répétez ces étapes pour chaque langue que vous avez l'intention d'utiliser. Après avoir obtenu une clé sur le site Wit.ai, revenez à la fenêtre de configuration pour l'ajouter.
ru: Повторите эти шаги для каждого языка, который вы собираетесь использовать. Получив ключ на сайте Wit.ai, вернитесь в окно настроек, чтобы добавить его.
tr: Kullanmayı düşündüğünüz her dil için bu adımları tekrarlayın. Wit.ai sitesinden bir anahtar aldıktan sonra, geri dönüp ayarlar penceresine ekleyin.
vi: Lặp lại các bước này cho mỗi ngôn ngữ bạn dự định sử dụng. Sau khi lấy khóa từ trang web Wit.ai, hãy quay lại cửa sổ cài đặt để thêm nó.

source: You can delete individual keys or all saved keys associated with this service using the provided buttons.
ar: ستجد أزرارًا لحذف المفتاح المحدد, أو كل المفاتيح المحفوظة المرتبطة بهذه الخدمة.
es: Puede eliminar claves individuales o todas las claves guardadas asociadas a este servicio utilizando los botones proporcionados.
fr: Vous pouvez supprimer des clés individuelles ou toutes les clés enregistrées associées à ce service en utilisant les boutons prévus à cet effet.
ru: Вы можете удалить отдельные ключи или все сохранённые ключи, связанные с этим сервисом, используя соответствующие кнопки.
tr: Bu hizmetle ilişkili kaydedilmiş anahtarları tek tek veya toplu olarak silmek için sağlanan düğmeleri kullanabilirsiniz.
vi: Bạn có thể xóa từng khóa riêng lẻ hoặc tất cả các khóa đã lưu liên kết với dịch vụ này bằng cách sử dụng các nút được cung cấp.

source: Choose audio format: To specify the file extension when converting, choose ogg or mp3. If your internet connection is bad.
ar: اختر صيغة الصوت, Choose audio format: لتحديد امتداد الملف عند تحويله, اختر ogg أو mp3. في حال كان اتصال الإنترنت لديك سيئ.
es: Elija el formato de audio: Para especificar la extensión del archivo al convertirlo, elija ogg o mp3 si su conexión a internet es mala.
fr: Choisissez le format audio : Pour spécifier l'extension du fichier lors de la conversion. Choisissez ogg ou mp3 si votre connexion internet est mauvaise.
ru: Выберите формат аудио: Чтобы указать расширение файла при конвертации, выберите ogg или mp3. Если у вас плохое интернет-соединение.
tr: Ses formatını seçin: Dönüştürme sırasında kullanılacak dosya uzantısını belirtmek için ogg veya mp3 seçin. İnternet bağlantınız kötüyse wav'ı seçin.
vi: Chọn định dạng âm thanh: Để chỉ định phần mở rộng tập tin khi chuyển đổi, hãy chọn ogg hoặc mp3. Nếu kết nối internet của bạn không tốt.

source: Choosing wav will quickly split the file, but it will be larger.
ar: سيؤدي اختيار wav إلى تقسيم الملف بسرعة, لكنه سيكون بحجم أكبر.
es: Si elige wav, el archivo se dividirá rápidamente, pero será más grande.
fr: En choisissant wav, vous diviserez rapidement le fichier, mais il sera plus volumineux.
ru: Выбор wav позволит быстро разделить файл, но он будет больше по размеру.
tr: Son olarak, her dosya parçasının süresini 4 ila 20 saniye arasında belirtebilirsiniz. En iyi sonuçları veren süreyi seçin.
vi: Chọn wav sẽ chia tách tập tin nhanh hơn, nhưng kích thước tập tin sẽ lớn hơn.

source: Lastly, you can specify the duration of each file segment, ranging from 4 to 20 seconds. Choose the duration that yields the best results.
ar: أخيرا, ستجد مدة كل ملف عند التقسيم, وهي بين 4 و20 ثانية. اختر ما يناسبك للحصول على أفضل نتيجة.
es: Por último, puede especificar la duración de cada segmento de archivo, que oscila entre 4 y 20 segundos. Elija la duración que ofrezca los mejores resultados.
fr: Enfin, vous pouvez spécifier la durée de chaque segment de fichier, de 4 à 20 secondes. Choisissez la durée que vous pensez donnera les meilleurs résultats.
ru: Наконец, вы можете указать продолжительность каждого сегмента файла - от 4 до 20 секунд. Выберите длительность, которая даёт наилучшие результаты.
tr: Ayarları yaptıktan sonra Tamam'a basın.
vi: Cuối cùng, bạn có thể chỉ định thời lượng của mỗi phân đoạn tập tin, từ 4 đến 20 giây. Chọn thời lượng mang lại kết quả tốt nhất.

source: Press OK when you have finished adjusting the settings.
ar: ثم اضغط ok عند الانتهاء من ضبط الإعدادات.
es: Pulse OK cuando haya terminado de ajustar la configuración.
fr: Appuyez sur OK lorsque vous avez terminé de régler les paramètres.
ru: Нажмите OK, когда закончите настраивать параметры.
tr: Ayarları yaptıktan sonra Tamam'a basın.
vi: Nhấn OK khi bạn đã hoàn tất việc điều chỉnh cài đặt.

source: ## Keyboard Shortcuts::
ar: ## اختصارات لوحة المفاتيح:
es: ## Atajos de teclado::
fr: ## Raccourcis clavier: :
ru: ## Сочетания клавиш ::
tr: ## Klavye Kısayolları:
vi: ## Phím Tắt::
