Repository: Kostenkov-2021/SoundTranscriber
Catalog: documentation/*/SoundTranscriberUserGuide.po
Languages: ar, es, fr, ru, tr, vi

source: Sound Transcriber version {} User Guide
ar: دليل استخدام Sound Transcriber الإصدار {}
es: Guía de usuario de la versión {} de Sound Transcriber
fr: Guide de l'utilisateur de Sound Transcriber version {}
ru: Руководство пользователя Sound Transcriber версия {}
tr: Sound Transcriber Sürüm {} Kullanıcı Kılavuzu
vi: Hướng Dẫn Sử Dụng Sound Transcriber Phiên Bản {}

source: # Sound Transcriber User Guide
ar: # دليل استخدام Sound Transcriber
es: # Guía de usuario de Sound Transcriber
fr: # Guide de l'utilisateur de Sound Transcriber
ru: # Руководство пользователя Sound Transcriber
tr: # Sound Transcriber KullanıcıKılavuzu
vi: # Hướng Dẫn Sử Dụng Sound Transcriber

source: This user guide aims to provide you with a comprehensive understanding of Sound Transcriber and help you make the most of its features.
ar: سيرشدك هذا الدليل للحصول على أقصى استفادة من برنامج Sound Transcriber.
es: El objetivo de esta guía de usuario es proporcionarle un conocimiento exhaustivo de Sound Transcriber y ayudarle a sacar el máximo partido de sus funciones.
fr: Ce guide de l'utilisateur a pour but de vous fournir une compréhension complète de Sound Transcriber et de vous aider à tirer le meilleur parti de ses fonctionnalités.
ru: Это руководство пользователя призвано дать вам полное представление о программе Sound Transcriber и помочь вам использовать её возможности на полную катушку.
tr: Bu kullan ı c ı k ı lavuzu, Sound Transcriber' ı kapsaml ı bir ş ekilde anlaman ı z ı ve özelliklerinden en iyi şekilde yararlanmanızı sağlamayı amaçlamaktadır.
vi: Hướng dẫn người dùng này nhằm cung cấp cho bạn một hiểu biết toàn diện về Sound Transcriber và giúp bạn tận dụng tối đa các tính năng của nó.

source: We highly recommend reading this guide to ensure optimal usage of the program.
ar: ينصح بقراءته لتحصل على أقصى استفادة من البرنامج.
es: Le recomendamos encarecidamente que lea esta guía para garantizar un uso óptimo del programa.
fr: Nous vous recommandons vivement de lire ce guide pour garantir une utilisation optimale du programme.
ru: Мы настоятельно рекомендуем прочитать это руководство, чтобы обеспечить оптимальное использование программы.
tr: Programın optimal kullanımı için bu kılavuzu okumanızı şiddetle tavsiye ederiz.
vi: Chúng tôi khuyến nghị bạn nên đọc hướng dẫn này để đảm bảo sử dụng chương trình một cách tối ưu.

source: ## Introduction to Sound Transcriber:
ar: ## ما هو Sound Transcriber:
es: ## Introducción a Sound Transcriber:
fr: ## Introduction à Sound Transcriber:
ru: ## Введение в Sound Transcriber:
tr: ## Sound Transcriber'a Giriş:
vi: ## Giới thiệu về Sound Transcriber:

source: Sound Transcriber is an accessible audio-to-text conversion program designed to transcribe audio and video files, it offers support for extracting subtitle files and more.
ar: برنامج Sound Transcriber هو برنامج متوافق مع قارئات الشاشة لتحويل الصوت لنص مع دعم استخراج ملفات الترجمات والمزيد.
es: Sound Transcriber es un programa accesible de conversión de audio a texto diseñado para transcribir archivos de audio y vídeo, ofrece soporte para extraer archivos de subtítulos y mucho más.
fr: Sound Transcriber est un programme de conversion audio/texte accessible, conçu pour transcrire des fichiers audio et vidéo, il permet d'extraire des fichiers de sous-titres et bien plus encore.
ru: Sound Transcriber - это доступная программа для преобразования звука в текст, предназначенная для расшифровки аудио- и видеофайлов, поддерживающая извлечение файлов субтитров и многое другое.
tr: Sound Transcriber, ses ve video dosyalarını metne dönüştürmek için tasarlanmış erişilebilir bir ses-metin dönüştürme programıdır. Altyazı dosyalarını çıkarma ve daha fazlasını destekler.
vi: "Sound Transcriber" là một chương trình chuyển đổi âm thanh thành văn bản dễ tiếp cận, được thiết kế để phiên âm các tệp âm thanh và video, nó hỗ trợ trích xuất các tệp phụ đề và nhiều hơn nữa.

source: Developed by Mahmoud Atef, Ahmed Bakr, and Qais Alrefai from the TecWindow team.
ar: Sound Transcriber من تطوير: محمود عاطف, أحمد بكر, قيس الرفاعي, من فريق نافذة التقنية TecWindow.
es: Desarrollado por Mahmoud Atef, Ahmed Bakr y Qais Alrefai del equipo TecWindow.
ru: Разработана Махмудом Атефом, Ахмедом Бакром и Каисом Алрефаем из команды TecWindow.
tr: Mahmoud Atef, Ahmed Bakr ve Qais Alrefai tarafından TecWindow ekibinde geliştirilmiştir.
vi: Được phát triển bởi Mahmoud Atef, Ahmed Bakr và Qais Alrefai từ nhóm TecWindow.

source: ## Features:
ar: ## الميزات:
es: ## Características:
fr: ## Fonctionnalités:
ru: ## Особенности:
tr: ## Özellikler:
vi: ## Tính năng:

source: Sound Transcriber offers the following features:
ar: يوفر برنامج Sound Transcriber الميزات التالية:
es: Sound Transcriber ofrece las siguientes características:
fr: Sound Transcriber offre les fonctionnalités suivantes :
ru: Sound Transcriber предлагает следующие возможности:
tr: Sound Transcriber aşağıdaki özellikleri sunar:
vi: Sound Transcriber cung cấp các tính năng sau:

source: - Conversion of audio and video files to text using various transcription services.
ar: - تحويل ملفات الصوت والفيديو إلى نص بالاعتماد على عدة خدمات.
es: - Conversión de archivos de audio y vídeo a texto utilizando varios servicios de transcripción.
fr: - Conversion de fichiers audio et vidéo en texte à l'aide de divers services de transcription.
ru: - Преобразование аудио- и видеофайлов в текст с помощью различных сервисов расшифровки.
tr: - Çeşitli transkripsiyon hizmetleri kullanarak ses ve video dosyalarının metne dönüştürülmesi.
vi: - Chuyển đổi tập tin âm thanh và video thành văn bản bằng nhiều dịch vụ phiên âm khác nhau.

source: - Saving conversion results as .txt and .doc files or as .SRT subtitle files.
ar: - حفظ نتائج التحويل بامتدادات .txt و.doc أو بامتداد ملفات التسميات التوضيحية subtitles .SRT.
es: - Guardar los resultados de la conversión como archivos .txt y .doc o como archivos de subtítulos .SRT.
fr: - Enregistrement des résultats de la conversion sous forme de fichiers .txt et .doc ou de fichiers de sous-titres .SRT.
ru: - Сохранение результатов конвертации в файлы .txt и .doc или в файлы субтитров .SRT.
tr: - Dönüşüm sonuçlarını .txt, .doc dosyaları veya .SRT altyazı dosyaları olarak kaydetme.
vi: - Lưu kết quả chuyển đổi dưới dạng tập tin .txt và .doc hoặc dưới dạng file phụ đề .SRT.

source: - Convert videos from platforms like YouTube, Facebook, and X by downloading the file directly, with an option to save the file for easy access and future use.
ar: - تحويل مقاطع الفيديو من منصات مثل Youtube, Facebook, x, عن طريق تنزيل الملف مباشرة، مع خيار حفظ الملف للوصول السهل والاستخدام المستقبلي.
es: - Convierta vídeos de plataformas como YouTube, Facebook, o X descargando el archivo directamente, con una opción que permite guardar el archivo para un acceso más sencillo y usarlo en el futuro.
fr: Téléchargement de vidéos de plateformes telles que YouTube, Facebook et X directement, avec la possibilité de les enregistrer pour un accès facile et une utilisation future.
ru: - Преобразование видео с таких платформ, как YouTube, Facebook и X с загрузкой файла напрямую, с возможностью сохранения файла для удобного доступа и использования в будущем.
tr: YouTube, Facebook ve X gibi platformlardan videoları doğrudan dosyayı indirerek dönüştürün. Dosyayı kolay erişim ve gelecekteki kullanım için kaydetme seçeneğiyle.
vi: - Chuyển đổi video từ các nền tảng như YouTube, Facebook và X bằng cách tải xuống tập tin trực tiếp, với tùy chọn lưu tập tin để dễ dàng truy cập và sử dụng trong tương lai.

source: ## Planned features:
ar: ## الميزات المخطط لها:
es: ## Características previstas:
fr: ## Fonctionnalités prévues :
ru: ## Планируемые возможности::
tr: ## Planlanan Özellikler:
vi: ## Các tính năng dự kiến:

source: We have several planned features in the pipeline, including:
ar: لدينا العديد من الميزات المخطط لها في المستقبل، بما في ذلك:
es: Tenemos varias características previstas para el futuro, incluyendo:
fr: Plusieurs fonctionnalités sont en cours d'élaboration, notamment :
ru: В разработке находится несколько запланированных функций, в том числе:
tr: Geliştirme aşamasında olan birkaç özellik:
vi: Chúng tôi có một số tính năng dự kiến trong kế hoạch, bao gồm:

source: - Translation of conversion results into multiple languages.
ar: - ترجمة نتائج التحويل إلى لغات متعددة.
es: - Traducción de los resultados de la conversión a varios idiomas.
fr: - Traduction des résultats de la conversion en plusieurs langues.
ru: - Перевод результатов расшифровки на несколько языков.
tr: - Dönüşüm sonuçlarının birden fazla dile çevrilmesi.
vi: - Dịch kết quả chuyển đổi sang nhiều ngôn ngữ.

source: - Spell check functionality with dictionaries.
ar: - إضافة قواميس لتصحيح النتائج.
es: - Corrección ortográfica con diccionarios.
fr: - Fonctionnalité de vérification orthographique avec dictionnaires.
ru: - Проверка орфографии с помощью словарей.
tr: - Sözlüklerle yazım denetimi fonksiyonu.
vi: Chức năng "kiểm tra chính tả" với từ điển.

source: - Conversion of results into audio using text-to-speech engines.
ar: - تحويل النتائج إلى صوت باستخدام محركات تحويل النص إلى صوت text to speech.
es: - Conversión de resultados en audio utilizando motores de texto a voz.
fr: - Conversion des résultats en audio à l'aide de moteurs de synthèse vocale.
ru: - Преобразование результатов в аудио с помощью механизмов преобразования текста в речь.
tr: - Sonuçların metin-okuma motorları kullanılarak sese dönüştürülmesi.
vi: Chuyển đổi kết quả thành âm thanh bằng cách sử dụng các công cụ chuyển văn bản thành giọng nói.

source: ## Supported services:
ar: ## الخدمات المدعومة:
es: ## Servicios soportados:
fr: ## Services pris en charge :
ru: ## Поддерживаемые сервисы:
tr: ## Desteklenen Hizmetler:
vi: ## Các dịch vụ được hỗ trợ:

source: The software currently only supports online conversion using Google's speech recognition, OpenAi's Whisper, and Meta's wit.ai.
ar: يدعم البرنامج حاليا التحويل عبر الإنترنت فقط عن طريق التعرف على الكلام من Google و Whisper من OpenAi و wit.ai من Meta.
es: Actualmente, el software sólo admite la conversión en línea mediante el reconocimiento de voz de Google, Whisper de OpenAi y wit.ai de Meta.
fr: Le logiciel ne prend actuellement en charge que la conversion en ligne à l'aide de la reconnaissance vocale de Google, de Whisper d'OpenAi et de wit.ai de Meta.
ru: В настоящее время программа поддерживает только онлайн-конвертацию с помощью распознавания речи Google, Whisper от OpenAi и wit.ai от Meta.
tr: Yazılım şu anda yalnızca Google'ın konuşma tanıma, OpenAI'nin Whisper ve Meta'nın wit.ai hizmetleriyle çevrimiçi dönüşümü desteklemektedir.
vi: Phần mềm hiện chỉ hỗ trợ chuyển đổi trực tuyến bằng cách sử dụng tính năng nhận dạng giọng nói của Google, Whisper của OpenAi và wit.ai của Meta.

source: ## Important notes:
ar: ## ملاحظات هامة:
es: ## Notas importantes:
fr: ## Notes importantes :
ru: ## Важные замечания:
tr: ## Önemli Notlar:
vi: ## Chú ý quan trọng:

source: Please take note of the following important information:
ar: يرجى ملاحظة المعلومات الهامة التالية:
es: Tenga en cuenta la siguiente información importante:
fr: Veuillez prendre note des informations importantes suivantes :
ru: Пожалуйста, примите к сведению следующую важную информацию:
tr: Lütfen aşağıdaki önemli bilgileri dikkate alın:
vi: Hãy lưu ý những thông tin quan trọng sau:

source: - By default, the program uses the Google service. To utilize other services, you need to obtain an API key from the respective service provider.
ar: - يعمل البرنامج افتراضيًا مع خدمة Google; لاستخدام خدمات أخرى, عليك الحصول على مفتاح API من تلك الخدمات.
es: - Por defecto, el programa utiliza el servicio de Google. Para utilizar otros servicios, es necesario obtener una clave API del respectivo proveedor de servicios.
fr: - Par défaut, le programme utilise le service Google. Pour utiliser d'autres services, vous devez obtenir une clé API auprès du fournisseur de services concerné.
ru: - По умолчанию программа использует сервис Google. Чтобы использовать другие сервисы, необходимо получить API-ключ у соответствующего поставщика услуг.
tr: - Varsayılan olarak program Google hizmetini kullanır. Diğer hizmetleri kullanmak için ilgili hizmet sağlayıcısından bir API anahtarı almanız gerekir.
vi: - Theo mặc định, chương trình sử dụng dịch vụ của Google. Để sử dụng các dịch vụ khác, bạn cần lấy khóa API từ nhà cung cấp dịch vụ tương ứng.

source: - For the best results with Arabic language transcription, we recommend using wit.ai.
ar: - نوصي باستخدام wit.ai مع اللغة العربية لكونها تعطي أفضل النتائج.
es: - Para obtener los mejores resultados con la transcripción en árabe, recomendamos utilizar wit.ai.
fr: - Pour obtenir les meilleurs résultats en matière de transcription en langue arabe, nous vous recommandons d'utiliser wit.ai.
ru: - Для достижения наилучших результатов при расшифровке арабского языка мы рекомендуем использовать wit.ai.
tr: - Arapça dil transkripsiyonu için en iyi sonuçlar için wit.ai kullanmanızı öneririz.
vi: - Để có kết quả tốt nhất với phiên âm tiếng Ả Rập, chúng tôi khuyên bạn nên sử dụng wit.ai.

source: - OpenAI's Whisper has been included based on previous experiences, but it may not function as intended or may not work at all. We appreciate your feedback and experiences to help us resolve any issues.
ar: - خدمة Whisper من OpenAI تمت إضافتها بناءً على تجربة سابقة, قد لا تعمل بالشكل المطلوب, وقد لا تعمل كليًا, فيرجى مشاركة تجربتك معنا للعمل على حلها.
es: - Se ha incluido Whisper de OpenAI basándose en experiencias anteriores, pero es posible que no funcione como está previsto o que no funcione en absoluto. Agradecemos comentarios y experiencias para ayudarnos a resolver cualquier problema.
fr: - Whisper d'OpenAI a été inclus sur la base d'expériences antérieures, mais il se peut qu'il ne fonctionne pas comme prévu ou qu'il ne fonctionne pas du tout. Nous apprécions vos commentaires et vos expériences pour nous aider à résoudre les problèmes.
ru: - Whisper от OpenAI был добавлен на основе предыдущего опыта, но он может работать не так, как задумано, или не работать вообще. Мы ценим ваши отзывы и опыт, которые помогут нам решить любые проблемы.
tr: - OpenAI'Whisper, önceki deneyimlere dayanarak eklenmiştir, ancak beklenildiği gibi çalışmayabilir veya hiç çalışmayabilir. Herhangi bir sorunu çözmemize yardımcı olmak için geri bildiriminizi ve deneyimlerinizi minnetle bekliyoruz .

source: - Unlike OpenAI, Wit.ai provides free API keys.
ar: - توفر لك wit.ai مفاتيح API مجانية على عكس OpenAI.
es: - A diferencia de OpenAI, Wit.ai proporciona claves API gratuitas.
fr: Contrairement à OpenAI, Wit.ai offre des clés API gratuites.
ru: - В отличие от OpenAI, Wit.ai предоставляет бесплатные API-ключи.
tr: - OpenAI'nin aksine, Wit.ai ücretsiz API anahtarları sağlar.
vi: Khác với OpenAI, Wit.ai cung cấp khóa API miễn phí.

source: - When converting a file, ensure that you select the appropriate language before initiating the conversion process. If a file is multilingual, words in languages other than the selected language may not be accurately converted due to limitations of the services.
ar: - لتحويل ملف, ينبغي اختيار اللغة قبل عملية التحويل. وفي حال كان الملف متعدد اللغات, قد لا يتم تحويل الكلمات باللغات غير اللغة المختارة بسبب الخدمات نفسها ولا يمكننا القيام بأي شيء حيال ذلك في الوقت الراهن.
es: - Al convertir un archivo, asegúrese de seleccionar el idioma adecuado antes de iniciar el proceso de conversión. Si un archivo es multilingüe, es posible que las palabras en idiomas distintos al seleccionado no se conviertan con precisión debido a las limitaciones de los servicios.
fr: - Lors de la conversion d'un fichier, veillez à sélectionner la langue appropriée avant de lancer le processus de conversion. Si un fichier est multilingue, les mots dans des langues autres que la langue sélectionnée peuvent ne pas être convertis avec précision en raison des limitations des services.
ru: - При расшифровке файла убедитесь, что вы выбрали нужный язык, прежде чем начать процесс конвертации. Если файл многоязычный, слова на языках, отличных от выбранного, могут быть преобразованы неточно из-за ограничений сервиса.
tr: - Bir dosyayı dönüştürürken, dönüşüm sürecini başlatmadan önce uygun dili seçtiğinizden emin olun. Eğer bir dosya çok dilliyse, seçilen dil dışındaki dillerdeki kelimeler hizmetlerin sınırlamaları nedeniyle doğru şekilde dönüştürülemeyebilir.
vi: - Khi chuyển đổi một tập tin, hãy đảm bảo rằng bạn chọn ngôn ngữ thích hợp trước khi bắt đầu quá trình chuyển đổi. Nếu tập tin đa ngôn ngữ, các từ ở ngôn ngữ khác ngôn ngữ đã chọn có thể không được chuyển đổi chính xác do những hạn chế của dịch vụ.

source: - Prior to conversion, files are split into segments of up to 60 seconds, depending on the limitations of each service. Consequently, some words may be lost during this process. To achieve optimal results, we recommend adjusting the segment duration based on the silence time, file length, and segment duration allowed by each service.
ar: - قبل التحويل، يتم تقسيم الملفات إلى أجزاء تصل مدة الواحد منها بحده الأقصى إلى 60 ثانية حسب الوقت المسموح به لكل خدمة. ونتيجة لذلك, قد يتم فقدان بعض الكلمات. للحصول على أفضل نتيجة, نوصي بتغيير مدة التقسيم بحسب مدة السكتات وطول الملف الذي تقوم بتحويله والمدة التي تتيحها كل خدمة.
es: - Antes de la conversión, los archivos se dividen en segmentos de hasta 60 segundos, dependiendo de las limitaciones de cada servicio. En consecuencia, es posible que se pierdan algunas palabras durante este proceso. Para obtener resultados óptimos, recomendamos ajustar la duración del segmento en función del tiempo de silencio, la longitud del archivo y la duración del segmento permitidos por cada servicio.
fr: - Avant la conversion, les fichiers sont divisés en segments d'une durée maximale de 60 secondes, en fonction des limites de chaque service. Par conséquent, certains mots peuvent être perdus au cours de ce processus. Pour obtenir des résultats optimaux, nous recommandons d'ajuster la durée du segment en fonction du temps de silence, de la longueur du fichier et de la durée du segment autorisés par chaque service.
ru: - Перед конвертированием файлы разбиваются на сегменты длительностью до 60 секунд, в зависимости от ограничений каждого сервиса. Следовательно, некоторые слова могут быть потеряны во время этого процесса. Для достижения оптимальных результатов мы рекомендуем регулировать длительность сегмента в зависимости от времени молчания, длины файла и длительности сегмента, допустимых каждым сервисом.
tr: - Dönüştürmeden önce dosyalar, her hizmetin sınırlamalarına bağlı olarak 60 saniyeye kadar olan parçalara bölünür. Bu nedenle, bazı kelimeler bu işlem sırasında kaybolabilir. Optimal sonuçlar elde etmek için, hizmetlerin izin verdiği sessizlik süresi, dosya uzunluğu ve parça süresi baz alınarak parça süresini ayarlamanızı öneririz.
vi: Trước khi chuyển đổi, các tập tin được chia thành các đoạn có thời lượng tối đa 60 giây, tùy thuộc vào giới hạn của từng dịch vụ. Do đó, một số từ có thể bị mất trong quá trình này.

source: - For optimal results with .srt files, we recommend selecting a short duration, such as 5 seconds, for the segments.
ar: - للحصول على أفضل النتائج مع ملفات .srt، نوصي بتحديد مدة قصيرة، مثل 5 ثوانٍ، للمقاطع.
es: - Para resultados óptimos con archivos .srt, recomendamos seleccionar una duración corta, como por ejemplo 5 segundos, para los segmentos.
fr: - Pour des résultats optimaux avec les fichiers .srt, nous recommandons de sélectionner une courte durée, par exemple 5 secondes, pour les segments.
ru: - Для достижения оптимальных результатов при работе с файлами .srt рекомендуется выбирать для сегментов небольшую продолжительность, например 5 секунд.
tr: - .srt dosyaları ile optimal sonuçlar için, parçalar için kısa bir süre, örneğin 5 saniye, seçmenizi öneririz.
vi: - Để có kết quả tối ưu với các tệp .srt, chúng tôi khuyên bạn nên chọn khoảng thời gian ngắn, chẳng hạn như 5 giây, cho các đoạn.

source: - Sound Transcriber requires [Microsoft Visual C++ 2015-2022 Redistributable X64](https://aka.ms/vs/17/release/vc_redist.x64.exe) and [Microsoft Visual C++ 2013 Redistributable X64.](https://aka.ms/highdpimfc2013x64enu) If the program does not work for you, please use the previous links to download and install the required files.
ar: - يتطلب Sound Transcriber وجود [Microsoft Visual C++ 2015-2022 Redistributable X64](https://aka.ms/vs/17/release/vc redist.x64.exe) و[Microsoft Visual C++ 2013 Redistributable X64.](https:/ /aka.ms/highdpimfc2013x64enu) في حال عدم عمل البرنامج لديك, يرجى استخدام الروابط السابقة لتحميل وتثبيت الملفات المطلوبة.
es: - Sound Transcriber requiere [Microsoft Visual C++ 2015-2022 Redistributable X64](https://aka.ms/vs/17/release/vc_redist.x64.exe) y [Microsoft Visual C++ 2013 Redistributable X64](https://aka.ms/highdpimfc2013x64enu). Si el programa no le funciona, por favor utilice los enlaces anteriores para descargar e instalar los archivos requeridos.
fr: - Sound Transcriber nécessite [Microsoft Visual C++ 2015-2022 Redistributable X64](https://aka.ms/vs/17/release/vc_redist.x64.exe) et [Microsoft Visual C++ 2013 Redistributable X64.](https://aka.ms/highdpimfc2013x64enu) Si le programme ne fonctionne pas pour vous, veuillez utiliser les liens précédents pour télécharger et installer les fichiers requis.
ru: - Для работы Sound Transcriber требуется [Microsoft Visual C++ 2015-2022 Redistributable X64](https://aka.ms/vs/17/release/vc_redist.x64.exe) и [Microsoft Visual C++ 2013 Redistributable X64.](https://aka.ms/highdpimfc2013x64enu) Если программа не работает, пожалуйста, воспользуйтесь вышеупомянутыми ссылками для загрузки и установки необходимых файлов.
tr: - Sound Transcriber, [Microsoft Visual C++ 2015-2022 Redistributable X64](https://aka.ms/vs/17/release/vc_redist.x64.exe) ve [Microsoft Visual C++ 2013 Redistributable X64](https://aka.ms/highdpimfc2013x64enu) gerektirir. Program sizde çalışmıyorsa, lütfen gerekli dosyaları indirmek ve yüklemek için önceki bağlantıları kullanın.
vi: - Sound Transcriber yêu cầu [Microsoft Visual C++ 2015-2022 Redistributable X64](https://aka.ms/vs/17/release/vc redist.x64.exe) và [Microsoft Visual C++ 2013 Redistributable X64.](https:/ /aka.ms/highdpimfc2013x64enu) Nếu chương trình không hoạt động với bạn, vui lòng sử dụng các liên kết trước đó để tải xuống và cài đặt các tệp cần thiết.

source: - Currently, Sound Transcriber supports the following languages: Arabic, English, Spanish, French, Russian, Turkish, And Vietnamese.
ar: - يدعم برنامج Sound Transcriber حاليًا اللغات التالية: العربية، الإنجليزية، الإسبانية، الفرنسية، الروسية, التركية, والفيتنامية.
es: - Actualmente, Sound Transcriber se encuentra en los siguientes idiomas: árabe, inglés, español, francés, ruso, turco y vietnamita.
fr: - Actuellement, Sound Transcriber prend en charge les langues suivantes : arabe, anglais, espagnol, français, russe, turc et vietnamien.
ru: - В настоящее время Sound Transcriber поддерживает следующие языки: английский, арабский, вьетнамский, испанский, французский, русский и турецкий.
tr: Sound Transcriber şu anda Arapça, İngilizce, İspanyolca, Fransızca, Rusça, Türkçe ve Vietnamca dillerini desteklemektedir.
vi: - Hiện tại, Sound Transcriber hỗ trợ các ngôn ngữ sau: Tiếng Ả Rập, Tiếng Anh, Tiếng Tây Ban Nha, Tiếng Pháp, Tiếng Nga, Tiếng Thổ Nhĩ Kỳ và Tiếng Việt.
