Repository: Kostenkov-2021/SoundTranscriber
Catalog: documentation/*/SoundTranscriberUserGuide.po
Languages: ar, es, fr, ru, tr, vi

source: Sound Transcriber provides several keyboard shortcuts to enhance speed and ease of use.
ar: يقدم لك Sound Transcriber العديد من اختصارات لوحة المفاتيح التي تجعل استخدامه أسرع وأسهل.
es: Sound Transcriber trae algunos atajos de teclado para poder usar el programa más rápido y de manera más sencilla.
fr: Sound Transcriber propose plusieurs raccourcis clavier pour améliorer la rapidité et la facilité d'utilisation.
ru: В Sound Transcriber предусмотрено несколько сочетаний клавиш для повышения скорости и удобства использования.
tr: Sound Transcriber, hız ve kullanım kolaylığını artırmak için birkaç klavye kısayolu sağlar.
vi: Sound Transcriber cung cấp một số phím tắt để tăng tốc độ và dễ sử dụng.

source: - Ctrl+O: Open the file browsing window to select a file for conversion.
ar: - Ctrl+O: فتح نافذة تصفح جهازك لتحديد ملف لتحويله.
es: - Ctrl+O: Abrir la ventana de examinar para seleccionar un archivo a convertir.
fr: - Ctrl+O : Ouvre la fenêtre d'exploration des fichiers pour sélectionner un fichier à convertir.
ru: - Ctrl+O: Открыть окно просмотра файлов, чтобы выбрать файл для преобразования.
tr: - Ctrl+O: Dönüştürmek için bir dosya seçmek için dosya gözatma penceresini açar.
vi: - Ctrl+O: Mở cửa sổ duyệt tập tin để chọn tập tin cần chuyển đổi.

source: - Ctrl+V: Paste a file from your clipboard for conversion.
ar: - Ctrl+V: لصق ملف من حافظتك لتحويله.
es: - Ctrl+V: Copiar un fichero del portapapeles para la conversion.
fr: - Ctrl+V : Coller un fichier de votre presse-papiers pour le convertir.
ru: - Ctrl+V: Вставить файл из буфера обмена для преобразования.
tr: - Ctrl+V: Pano'dan dönüştürmek için bir dosya yapıştırır.
vi: - Ctrl+V: Dán tập tin từ khay nhớ tạm của bạn để chuyển đổi.

source: - Ctrl+1: Switch to the Google service.
ar: - Ctrl+1: التبديل إلى خدمة Google.
es: - Ctrl+1: Cambiar al servicio de Google.
fr: - Ctrl+1 : Basculer vers le service Google.
ru: - Ctrl+1: переключиться на сервис Google.
tr: - Ctrl+1: Google hizmetine geçer.
vi: - Ctrl+1: Chuyển sang dịch vụ Google.

source: - Ctrl+2: Switch to the Wit.ai service.
ar: - Ctrl+2: التبديل إلى خدمة wit.ai.
es: - Ctrl+2: Cambiar al servicio de Wit.ai.
fr: - Ctrl+2 : Basculer vers le service Wit.ai.
ru: - Ctrl+2: Переключиться на сервис Wit.ai.
tr: - Ctrl+2: Wit.ai hizmetine geçer.
vi: - Ctrl+2: Chuyển sang dịch vụ Wit.ai.

source: - Ctrl+3: Switch to Whisper.
ar: - Ctrl+3: التبديل إلى خدمة Whisper.
es: - Ctrl+3: Cambiar a Whisper.
fr: - Ctrl+3 : Basculer vers Whisper.
ru: - Ctrl + 3: переключиться на сервис Whisper.
tr: - Ctrl+3: Whisper'a geçer.
vi: - Ctrl+3: Chuyển sang Whisper.

source: - Ctrl+Enter: Start the conversion process.
ar: - Ctrl+Enter: بدء عملية التحويل.
es: - Ctrl+Enter: Iniciar el proceso de conversion.
fr: - Ctrl+Entrée : Lancer le processus de conversion.
ru: - Ctrl+Enter: Начать процесс конвертации.
tr: - Ctrl+Enter: Dönüştürme sürecini başlatır.
vi: - Ctrl+Enter: Bắt đầu quá trình chuyển đổi.

source: - P: Display the current percentage of conversion progress.
ar: - P: معرفة نسبة تقدم عملية التحويل.
es: - P: Mostrar el porcentaje actual de la conversion.
fr: - P : Enoncer le pourcentage actuel de l'avancement de la conversion.
ru: - P: Отображение текущего процента выполнения конвертации.
tr: - P: Dönüştürme ilerlemesinin mevcut yüzdesini görüntüler.
vi: - P: Hiển thị phần trăm tiến độ chuyển đổi hiện tại.

source: - Ctrl+S: Open the save options.
ar: - Ctrl+s: فتح خيارات الحفظ. - Ctrl+s: فتح خيارات الحفظ.
es: - Ctrl+S: Abrir los ajustes de guardado.
fr: - Ctrl+S : Ouvrir les options d'enregistrement.
ru: - Ctrl+S: Открыть опции сохранения.
tr: - Ctrl+S: Kaydetme seçeneklerini açar.
vi: - Ctrl+S: Mở các tùy chọn lưu.

source: - Ctrl+Shift+S: Save the result as .srt.
ar: - Ctrl+Shift+s: حفظ النتيجة بامتداد .srt.
es: - Ctrl+Shift+S: Guardar el resultado como .srt.
fr: - Ctrl+Shift+S : Enregistrer le résultat au format .srt.
ru: - Ctrl+Shift+S: сохранить результат в формате . srt.
tr: - Ctrl+Shift+S: Sonucu .srt olarak kaydeder.
vi: - Ctrl+Shift+S: Lưu kết quả dưới dạng .srt.

source: - Ctrl+Shift+T: Save the result as .txt.
ar: - Ctrl+shift+t حفظ النتيجة بامتداد .txt.
es: - Ctrl+Shift+T: Guardar el resultado como .txt.
fr: - Ctrl+Shift+T : Enregistrer le résultat au format .txt.
ru: - Ctrl+Shift+T: сохранить результат в формате . txt.
tr: - Ctrl+Shift+T: Sonucu .txt olarak kaydeder.
vi: - Ctrl+Shift+T: Lưu kết quả dưới dạng .txt.

source: - Ctrl+Shift+D: Save the result as .docx.
ar: - Ctrl+Shift+d: حفظ النتيجة بامتداد .docx.
es: - Ctrl+Shift+D: Guardar el resultado como .docx.
fr: - Ctrl+Shift+D : Enregistrer le résultat au format .docx.
ru: - Ctrl+Shift+D: сохранить результат в формате . docx.
tr: - Ctrl+Shift+D: Sonucu .docx olarak kaydeder.
vi: - Ctrl+Shift+D: Lưu kết quả dưới dạng .docx.

source: - Ctrl+U or F3: Check for updates.
ar: - Ctrl+U أو F3: البحث عن التحديثات.
es: - Ctrl+U o F3: Buscar actualizaciones.
fr: - Ctrl+U ou F3 : Vérifier les mises à jour.
ru: - Ctrl+U или F3: Проверить наличие обновлений.
tr: - Ctrl+U veya F3: Güncellemeleri kontrol eder.
vi: - Ctrl+U hoặc F3: Kiểm tra các bản cập nhật.

source: - Alt+S or F8: Open the Settings.
ar: - Alt+s أو F8: فتح الإعدادات.
es: - Alt+S o F8: Abrir los ajustes.
fr: - Alt+S ou F8 : Ouvrir les paramètres.
ru: - Alt+S или F8: открыть настройки.
tr: - Alt+S veya F8: Ayarları açar.
vi: - Alt+S hoặc F8: Mở Cài đặt.

source: - F1: Open the user guide.
ar: - F1: فتح دليل المستخدم.
es: - F1: Abrir la guía de usuario.
fr: - F1 : Ouvrir le guide de l'utilisateur.
ru: - F1: Открыть руководство пользователя.
tr: - F1: Kullanıcı kılavuzunu açar.
vi: - F1: Mở hướng dẫn sử dụng.

source: - F2: View updates.
ar: - F2: عرض المستجدات.
es: - F2: Ver novedades.
fr: - F2 : Voir les mises à jour.
ru: - F2: Просмотр обновлений.
tr: - F2: Güncellemeleri görüntüler.
vi: - F2: Xem thông tin bản cập nhật.

source: - F5: Donate.
ar: - F5: تبرع.
es: - F5: Donar.
fr: - F5 : Faire un don.
ru: - F5: Пожертвовать.
tr: - F5: Bağış yap.
vi: - F5: Quyên góp.

source: - F6: Open repository.
ar: - F6: فتح المستودع.
es: - F6: Abrir el repositorio.
fr: - F6 : Ouvrir le dépôt.
ru: - F6: Открыть репозиторий.
tr: - F6: Depoyu açar.
vi: - F6: Mở kho lưu trữ.

source: - F7: Open Log file.
ar: - F7: فتح ملف السجل.
es: - F7: Abrir Archivo De LOG.
fr: - F7 : Ouvrir le fichier journal.
ru: - F7: Открыть файл журнала.
tr: - F7: Günlük dosyasını açar.
vi: - F7: Mở tập tin nhật ký.

source: - F9: About.
ar: - F9: حول.
es: - F9: Acerca De.
fr: - F9 : À propos.
ru: - F9: О программе.
tr: - F9: Hakkında.
vi: - F9: Về.

source: - Ctrl+W or Ctrl+F4: Close Sound Transcriber.
ar: - Ctrl+w أو Ctrl+F4: إغلاق Sound Transcriber.
es: - Ctrl+W o Ctrl+F4: cerrar Sound Transcriber.
fr: - Ctrl+W ou Ctrl+F4 : Fermer Sound Transcriber.
ru: - Ctrl+W или Ctrl+F4: Закрыть Sound Transcriber.
tr: - Ctrl+W veya Ctrl+F4: Sound Transcriber'ı kapatır.
vi: - Ctrl+W hoặc Ctrl+F4: Đóng Sound Transcriber.

source: ## How to Convert Files:
ar: ## كيفية تحويل الملفات:
es: ## Cómo convertir archivos:
fr: ## Comment convertir des fichiers :
ru: ## Как конвертировать файлы :
tr: ## Dosyalar Nasıl Dönüştürülür:
vi: ## Cách chuyển đổi tập tin:

source: To convert files, open Sound Transcriber and either browse for the file by clicking "Browse" or use the shortcut Ctrl+O. Alternatively, you can copy the file from your device and paste it using Ctrl+V.
ar: لتحويل الملفات, افتح Sound Transcriber, اضغط على تصفح أو الاختصار ctrl+o وحدد الملف المراد تحويله، أو انسخ الملف من جهازك والصقه عن طريق Ctrl+V.
es: Para convertir archivos, abra Sound Transcriber y busque el archivo haciendo clic en "Examinar" o utilice el atajo de teclado Ctrl+O. También puede copiar el archivo desde su dispositivo y pegarlo utilizando Ctrl+V.
fr: Pour convertir des fichiers, ouvrez Sound Transcriber et recherchez le fichier en cliquant sur "Parcourir" ou en utilisant le raccourci Ctrl+O. Vous pouvez également copier le fichier depuis votre appareil et le coller en utilisant Ctrl+V.
ru: Чтобы конвертировать файлы, откройте Sound Transcriber и найдите файл, нажав кнопку "Обзор" или воспользовавшись сочетанием клавиш Ctrl+O. Кроме того, вы можете скопировать файл с устройства и вставить его с помощью Ctrl+V.
tr: Dosyaları dönüştürmek için Sound Transcriber'ı açın ve "Gözat" düğmesine tıklayarak dosyayı seçin veya Ctrl+O kısayolunu kullanın. Alternatif olarak, cihazınızdan dosyayı kopyalayıp Ctrl+V kısayolunu kullanarak yapıştırabilirsiniz.
vi: Để chuyển đổi tập tin, hãy mở Sound Transcriber và duyệt tìm tập tin bằng cách nhấp vào "Duyệt" hoặc sử dụng phím tắt Ctrl+O. Ngoài ra, bạn có thể sao chép tập tin từ thiết bị của mình và dán bằng Ctrl+V.

source: You can also utilize the option available in the context menu for supported files, the Send To menu in Windows, or simply drag and drop.
ar: يمكنك أيضًا الاستفادة من الخيار المتاح في قائمة السياق للملفات المدعومة، أو قائمة "إرسال إلى Send to" في Windows، أو ببساطة السحب والإفلات.
es: Además puede usar la opción disponible en el menú contextual para archivos compatibles, la opción de enviar a de los menús Windows, o simplemente arrastrar y soltar.
fr: Vous pouvez également utiliser l'option disponible dans le menu contextuel pour les fichiers pris en charge, le menu Envoyer à dans Windows, ou simplement glisser-déposer.
ru: Вы также можете воспользоваться опцией, доступной в контекстном меню для поддерживаемых файлов, меню "Отправить в" в Windows или просто перетащить файл.
tr: Desteklenen dosyalar için bağlam menüsünde bulunan seçeneği, Windows'taki Gönder menüsünü kullanabilir veya sürükle ve bırak işlemi yapabilirsiniz.
vi: Bạn cũng có thể sử dụng tùy chọn có sẵn trong menu ngữ cảnh cho các tệp được hỗ trợ, menu Gửi đến trong Windows hoặc đơn giản là kéo và thả.

source: You can alternatively copy a video link from sites such as Facebook, Twitter (X), Youtube, SoundCloud among others.
ar: أو قم بنسخ رابط فيديو من مواقع مثل facebook, Twitter (X), Youtube, SoundCloud وغيرهم.
es: O también puede copiar un enlace de vídeo de sitios como Facebook, Twitter (X), Youtube, SoundCloud y otros.
fr: Vous pouvez également copier un lien vidéo à partir de sites tels que Facebook, Twitter (X), Youtube, SoundCloud et autres.
ru: Кроме того, можно скопировать ссылку на видео с таких сайтов, как Facebook, Twitter (X), Youtube, SoundCloud и других.
tr: Ayrıca Facebook, Twitter (X), Youtube, SoundCloud gibi sitelerden video bağlantısını kopyalayabilirsiniz.
vi: Bạn cũng có thể sao chép liên kết video từ các trang web như Facebook, Twitter (X), Youtube, SoundCloud và nhiều trang web khác.

source: Choose the desired language and service using the provided shortcuts or adjust them in the settings. Press "Start" or use the shortcut Ctrl+Enter to initiate the conversion.
ar: حدد اللغة وغيِّر الخدمة عن طريق الاختصارات أو من الإعدادات لتحويل الملف بالخدمة المفضلة واللغة المناسبة، ثم اضغط على بدء Start أو الاختصار Ctrl+Enter للتحويل.
es: Elija el idioma y el servicio deseados utilizando los accesos directos proporcionados o cámbielos en los ajustes. Pulse "Inicio" o utilice el atajo Ctrl+Enter para iniciar la conversión.
fr: Choisissez la langue et le service souhaités à l'aide des raccourcis fournis ou réglez-les dans les paramètres. Appuyez sur "Démarrer" ou utilisez le raccourci Ctrl+Enter pour lancer la conversion.
ru: Выберите нужный язык и сервис с помощью предлагаемых ярлыков или настройте их в настройках. Нажмите "Пуск" или воспользуйтесь сочетанием клавиш Ctrl+Enter, чтобы начать конвертацию.
tr: Sağlanan kısayolları kullanarak veya ayarlarda ayarlayarak istenilen dili ve hizmeti seçin. Dönüşümü başlatmak için "Başlat" düğmesine basın veya Ctrl+Enter kısayolunu kullanın.
vi: Chọn ngôn ngữ và dịch vụ mong muốn bằng cách sử dụng các phím tắt được cung cấp hoặc điều chỉnh chúng trong cài đặt. Nhấn "Bắt đầu" hoặc sử dụng phím tắt Ctrl+Enter để bắt đầu chuyển đổi.

source: Did you know, you can open Sound Transcriber by pressing Windows + R to open the Run dialog, and then typing st.
ar: هل تعلم أنه يمكنك فتح برنامج Sound Transcriber بالضغط على Windows + R لفتح محاورة Run، ثم كتابة st.
es: Por si no lo sabía, puede abrir Sound Transcriber pulsando Windows + R para abrir el diálogo de ejecutar, y escribiendo st.
fr: Saviez-vous que vous pouvez ouvrir Sound Transcriber en appuyant sur Windows + R pour ouvrir la boîte de dialogue Exécuter, puis en tapant st.
ru: Знаете ли вы, что открыть Sound Transcriber можно, нажав Windows + R, чтобы открыть диалог "Выполнить", а затем набрав st.
tr: Windows + R tuşlarına basarak Çalıştır iletişim kutusunu açıp st yazarak Sound Transcriber'ı açabileceğinizi biliyor muydunuz.
vi: Bạn có biết rằng, bạn có thể mở Sound Transcriber bằng cách nhấn Windows + R để mở hộp thoại Run, sau đó nhập st.

source: ### Notes:
ar: ### ملاحظات:
es: ### Notas:
ru: ### Примечания :
tr: ### Notlar:
vi: ### Lưu ý:

source: - While a conversion is underway, you have the option to pause it, be it during the extraction of text or the downloading of a file. However, it's important to note that initiating a new process will result in the disregard of anything associated with the previous process.
ar: - أثناء تقدم عملية التحويل, يمكنك إيقافها مؤقتا أثناء استخراج النص, وأثناء التنزيل لكن في حال بدأت عملية جديدة سيتم تجاهل كل ما يخص العملية السابقة.
es: - Mientras el proceso de conversión está en curso, se puede pausar durante la extracción del texto, y durante la descarga, pero si se inicia un nuevo proceso, todo lo relacionado con el proceso anterior será ignorado.
fr: - Pendant qu'une conversion est en cours, vous avez la possibilité de la mettre en pause, que ce soit pendant l'extraction du texte ou le téléchargement d'un fichier. Cependant, il est essentiel de noter qu'initier un nouveau processus entraînera l'ignorance de tout ce qui est lié au processus précédent.
ru: - В процессе конвертирования вы можете приостановить его , будь то извлечение текста или загрузка файла . Однако важно отметить , что начало нового процесса приведёт к удалению всего , что связано с предыдущим процессом .
tr: - Dönüşüm sırasında, metin çıkarma veya bir dosya indirme sırasında olsa da duraklatma seçeneğiniz vardır. Ancak, yeni bir işlem başlatıldığında, önceki işle ile ilgili her şey göz ardı edilir.
vi: - Trong khi quá trình chuyển đổi đang diễn ra, bạn có thể tạm dừng nó, bất kể là trong quá trình trích xuất văn bản hay tải xuống tập tin. Tuy nhiên, điều quan trọng cần lưu ý là việc khởi động một quy trình mới sẽ dẫn đến việc bỏ qua mọi thứ liên quan đến quy trình trước đó.

source: - If the process is stopped during splitting the files, it cannot be resumed.
ar: - في حال أوقفت العملية أثناء التقسيم, لا يمكن استأنافها.
es: - Si el proceso se detiene durante la división de los ficheros, no podrá reanudarse.
fr: - Si le processus est arrêté pendant la division des fichiers, il ne pourra pas être repris.
ru: - Если процесс будет остановлен во время разделения файлов , его нельзя будет возобновить .
tr: - Dosyaları bölme işlemi sırasında süreç durdurulursa, devam ettirilemez.
vi: - Nếu quá trình bị dừng trong khi chia tách các tập tin, nó không thể được tiếp tục.

source: ## Report Bugs:
ar: ## الإبلاغ عن الأخطاء:
es: ## Informar de errores:
fr: ## Signaler les bogues :
ru: ## Сообщайте об ошибках :
tr: ## Hataları Bildirin:
vi: ## Báo cáo lỗi:

source: If you encounter any bug with Sound Transcriber, you can use the communication methods available in the "Contact Us" menu under the "Help" section. Provide a detailed explanation of the actions that led to the bug. We recommend sharing the Sound Transcriber.log file, which will assist us in understanding and resolving the bug more effectively.
ar: في حال واجهت أي خطأ مع Sound Transcriber, يمكنك استخدام أي من وسائل التواصل المتاحة في قائمة "اتصل بنا" داخل قائمة "مساعدة"، ثمّ اشرح ما فعلته وتسبب في حدوث الخطأ. يُفَضَّل أن تشارك معنا ملف Sound Transcriber.log الذي سيساعدنا على فهم الخطأ وحله بشكل أكبر.
es: Si encuentra algún error en Sound Transcriber, puede utilizar los métodos de comunicación disponibles en el menú "Contacto" de la sección "Ayuda". Proporcione una explicación detallada de las acciones que provocaron el fallo. Le recomendamos que comparta el archivo Sound Transcriber.log, que nos ayudará a comprender y resolver el fallo con mayor eficacia.
fr: Si vous rencontrez un bogue avec Sound Transcriber, vous pouvez utiliser les méthodes de communication disponibles dans le menu "Contactez-nous" de la section "Aide". Fournissez une explication détaillée des actions qui ont conduit au bogue. Nous vous recommandons de partager le fichier Sound Transcriber.log, qui nous aidera à comprendre et à résoudre le problème plus efficacement.
ru: Если вы столкнулись с какой-либо ошибкой в работе Sound Transcriber, вы можете воспользоваться способами связи, доступными в меню "Связаться с нами" в разделе "Помощь". Предоставьте подробное объяснение действий, которые привели к ошибке. Мы рекомендуем предоставить файл Sound Transcriber.log, который поможет нам лучше понять и устранить ошибку.
tr: Sound Transcriber ile ilgili bir hata ile karşılaşırsanız, "Yardım" bölümündeki "Bize Ulaşın" menüsünde bulunan iletişim yöntemlerini kullanarak bildirebilirsiniz. Hataya neden olan eylemleri ayrıntılı olarak açıklayın. Sound Transcriber.log dosyasını paylaşmanızı öneririz, bu bize hatayı daha etkili bir şekilde anlamamıza ve çözmemize yardımcı olacaktır.
vi: Nếu bạn gặp phải lỗi nào với Sound Transcriber, bạn có thể sử dụng các phương thức liên lạc có sẵn trong menu "Liên hệ với chúng tôi" dưới phần "Trợ giúp". Cung cấp một lời giải thích chi tiết về các hành động dẫn đến lỗi. Chúng tôi khuyên bạn nên chia sẻ tập tin Sound Transcriber.log, điều này sẽ giúp chúng tôi hiểu và giải quyết lỗi hiệu quả hơn.

source: Go to Settings > General and enable logging. Then repeat the steps that led to encountering the error. Don't forget to disable logging after sending the file. Note that keeping the option enabled may result in a large .log file. However, you can choose to keep the log enabled if you wish.
ar: انتقل إلى الإعدادات > عام وقم بتمكين تفعيل السجل. ثم كرر الخطوات التي أدت إلى حدوث الخطأ. لا تنس تعطيل السجل بعد إرسال الملف. لاحظ أن إبقاء الخيار ممكّنًا قد يؤدي إلى ملف .log كبير. ومع ذلك، يمكنك اختيار إبقاء السجل ممكنًا إذا كنت ترغب في ذلك.
es: Vaya a Ajustes > General y active la opción de permitir logs. Ahora, repita los pasos que generaron el error. No se olvide de desactivar la opción de permitir logs después de enviar el fichero. Tenga en cuenta que mantener la opción habilitada puede resultar en un archivo de registro muy largo. Sin embargo, puede optar por mantenerla habilitada si lo desea.
fr: Allez dans Paramètres > Général et activez la journalisation. Répétez ensuite les étapes qui ont conduit à l'erreur. N'oubliez pas de désactiver la journalisation après avoir envoyé le fichier. Notez que le fait de maintenir l'option activée peut entraîner la création d'un fichier .log volumineux. Toutefois, vous pouvez choisir de maintenir l'option de journalisation activée si vous le souhaitez.
ru: Перейдите в раздел "Настройки" > "Общие" и включите ведение журнала. Затем повторите действия, которые привели к возникновению ошибки. Не забудьте отключить ведение журнала после отправки файла. Обратите внимание, что включение этой опции может привести к созданию большого файла . log. Однако при желании вы можете оставить журнал включённым.
tr: Ayarlar > Genel bölümüne gidin ve günlüğü etkinleştirin. Ardından hatayı karşılaşmanıza neden olan adımları tekrarlayın. Dosyayı gönderdikten sonra günlüğü devre dışı bırakmayı unutmayın. Bu seçeneği etkin bırakmak büyük bir .log dosyasına neden olabilir. Ancak, günlüğü etkin bırakmayı seçebilirsiniz.
vi: Vào Cài đặt > Chung và bật ghi nhật ký. Sau đó lặp lại các bước dẫn đến lỗi. Đừng quên tắt ghi nhật ký sau khi gửi tập tin. Lưu ý rằng việc giữ tùy chọn bật có thể dẫn đến tập tin .log có kích thước lớn. Tuy nhiên, bạn có thể chọn giữ nhật ký bật nếu muốn.

source: You can find the file in the following path:
ar: يمكنك العثور على الملف في المسار التالي:
es: Puede encontrar el archivo en la siguiente ruta:
fr: Vous trouverez ce fichier dans le chemin suivant :
ru: Файл можно найти по следующему пути:
tr: Dosyayı şu yolda bulabilirsiniz:
vi: Bạn có thể tìm thấy tập tin theo đường dẫn sau:

source: ## Beta Updates:
ar: ## التحديثات التجريبية Beta Updates:
es: ## Actualizaciones Beta:
fr: ## Mises à jour bêta :
ru: ## Бета - обновления :
tr: ## Beta Güncellemeleri:
vi: ## Các bản cập nhật Beta:

source: Sound Transcriber offers a beta update system, allowing you to test new features and assist us in identifying bugs. While activating this feature is straightforward, there are some important points to consider:
ar: يقدم Sound Transcriber نظام التحديثات التجريبية، مما يسمح لك باختبار الميزات الجديدة ومساعدتنا في تحديد الأخطاء. على الرغم من أن تفعيل هذه الميزة أمر بسيط، إلا أن هناك بعض النقاط المهمة التي يجب مراعاتها:
es: Sound Transcriber ofrece un sistema de actualizaciones beta, lo que le permite probar nuevas funciones y ayudarnos a identificar errores. Aunque activar esta característica es sencillo, hay algunos puntos importantes a considerar:
fr: Sound Transcriber propose un système de mise à jour bêta, vous permettant de tester les nouvelles fonctionnalités et de nous aider à identifier les bogues. Bien que l'activation de cette fonction soit simple, il y a quelques points importants à prendre en compte :
ru: Sound Transcriber предлагает систему бета-обновлений, позволяющую вам тестировать новые функции и помогать нам в выявлении ошибок. Хотя активировать эту функцию несложно, есть несколько важных моментов, которые следует учитывать:
tr: Sound Transcriber, yeni özellikleri test etmenizi ve hataları belirlememize yardımcı olmanızı sağlayan bir beta güncelleme sistemi sunar. Bu özelliği etkinleştirmek kolay olsa da, dikkate almanız gereken bazı önemli noktalar vardır:
vi: Sound Transcriber cung cấp một hệ thống cập nhật beta, cho phép bạn thử nghiệm các tính năng mới và hỗ trợ chúng tôi xác định lỗi. Mặc dù việc kích hoạt tính năng này khá đơn giản, nhưng có một số điểm quan trọng cần lưu ý:

source: - Beta updates may be unstable, and we cannot guarantee the immediate release of fixes for any issues you encounter.
ar: - قد تكون التحديثات التجريبية غير مستقرة، ولا يمكننا ضمان الإصدار الفوري لإصلاحات أي مشكلات تواجهها.
es: - Las actualizaciones beta pueden ser inestables, y no podemos garantizar la liberación inmediata de soluciones para cualquier problema que usted encuentre.
fr: - Les mises à jour bêta peuvent être instables et nous ne pouvons pas garantir la publication immédiate de correctifs pour les problèmes que vous rencontrez.
ru: - Бета - версии могут быть нестабильными , и мы не можем гарантировать немедленный выпуск исправлений для любых проблем , с которыми вы столкнётесь .
tr: - Beta güncellemeleri kararsız olabilir ve karşılaştığınız sorunlar için hemen düzeltmeler yayınlanacağını garanti edemeyiz.
vi: - Các bản cập nhật beta có thể không ổn định, và chúng tôi không thể đảm bảo việc phát hành ngay lập tức các bản sửa lỗi cho bất kỳ vấn đề nào bạn gặp phải.

source: - In certain cases, we may release up to three updates within the same week.
ar: - في بعض الحالات، قد نقوم بإصدار ما يصل إلى ثلاثة تحديثات خلال نفس الأسبوع.
es: - En ciertos casos, podríamos lanzar hasta tres actualizaciones en la misma semana.
fr: - Dans certains cas, nous pouvons publier jusqu'à trois mises à jour au cours de la même semaine.
ru: - В некоторых случаях мы можем выпустить до трёх обновлений в течение одной недели .
tr: - Bazı durumlarda, aynı hafta içinde üç güncellemeye kadar yayınlayabiliriz.
vi: - Trong một số trường hợp, chúng tôi có thể phát hành tối đa ba bản cập nhật trong vòng một tuần.
