Repository: Kostenkov-2021/SoundTranscriber
Catalog: documentation/*/SoundTranscriberUserGuide.po
Languages: ar, es, fr, ru, tr, vi

source: - Sound Transcriber is compatible with Windows 8 and above, but only in 64-bit systems.
ar: - برنامج Sound Transcriber متوافق مع Windows 8 والإصدارات الأحدث، لكنه يدعم أنظمة 64 بت فقط.
es: - Sound Transcriber es compatible con sistemas que tengan Windows 8 o superior, pero solo con sistemas de 64-bits systems.
fr: - Sound Transcriber est compatible avec Windows 8 et plus, mais uniquement avec les systèmes 64 bits.
ru: - Sound Transcriber совместим с Windows 8 и выше, но только в 64-битных системах.
tr: - Sound Transcriber, yalnızca 64 bit sistemlerde Windows 8 ve üzeri ile uyumludur.
vi: - Sound Transcriber tương thích với Windows 8 trở lên, nhưng chỉ trên hệ thống 64-bit.

source: ## Supported file extensions:
ar: ## الامتدادات المدعومة:
es: ## Extensiones de archivo compatibles:
fr: ## Extensions de fichiers supportées :
ru: ## Поддерживаемые расширения файлов:
tr: ## Desteklenen Dosya Uzantıları:
vi: Các định dạng tập tin được hỗ trợ:

source: Sound Transcriber supports the following file extensions for conversion:
ar: يدعم Sound Transcriber امتدادات الملفات التالية للتحويل:
es: Sound Transcriber admite las siguientes extensiones de archivo para la conversión:
fr: Sound Transcriber prend en charge les extensions de fichiers suivantes pour la conversion :
ru: Sound Transcriber поддерживает следующие расширения файлов для конвертирования:
tr: Sound Transcriber dönüşüm için aşağıdaki dosya uzantılarını destekler:
vi: Sound Transcriber hỗ trợ các định dạng tập tin sau để chuyển đổi:

source: ## Obtaining API Keys:
ar: ## الحصول على مفاتيح API:
es: ## Obtener claves API:
fr: ## Obtention des clés API :
ru: ## Получение ключей API:
tr: ## API Anahtarlarının Alınması:
vi: ## Lấy Khóa API:

source: If we were to include an API key within the program itself, it would likely be blocked after widespread usage by multiple users.
ar: إذا قمنا بتوفير مفتاح API في البرنامج, فسيتم حظره بعد استخدام البرنامج من قبل العديد من الأشخاص.
es: Si incluyéramos una clave API en el propio programa, probablemente se bloquearía tras un uso generalizado por parte de múltiples usuarios.
fr: Si nous devions inclure une clé API dans le programme lui-même, elle serait probablement bloquée après une utilisation généralisée par de nombreux utilisateurs.
ru: Если бы мы включили API-ключ в саму программу, он, скорее всего, был бы заблокирован после широкого использования несколькими пользователями.
tr: Program içinde bir API anahtarı eklemiş olsak, muhtemelen çok sayıda kullanıcı tarafından yaygın kullanım sonrası engellenirdi.
vi: Nếu chúng tôi bao gồm một khóa API trong chính chương trình, nó có thể sẽ bị chặn sau khi nhiều người dùng sử dụng rộng rãi.

source: Moreover, wit.ai provides distinct API keys for each language. This means that you need to create an application in the desired language and obtain its corresponding API key.
ar: كما أن wit.ai توفر مفاتيح منفصلة لكل لغة, أي إنك بحاجة لإنشاء تطبيق (App) باللغة التي تريد التحويل بها ثم الحصول على مفتاح خاص به.
es: Además, wit.ai proporciona claves API distintas para cada idioma. Esto significa que es necesario crear una aplicación en el idioma deseado y obtener su clave API correspondiente.
fr: De plus, wit.ai fournit des clés API distinctes pour chaque langue. Cela signifie que vous devez créer une application dans la langue souhaitée et obtenir la clé API correspondante.
ru: Более того, wit.ai предоставляет отдельные API-ключи для каждого языка. Это означает, что вам необходимо создать приложение на нужном языке и получить соответствующий API-ключ.
tr: Ayrıca, wit.ai her dil için ayrı API anahtarları sağlar. Bu, istenilen dilde bir uygulama oluşturmanız ve ilgili API anahtarını almanız gerektiği anlamına gelir.
vi: Hơn nữa, "wit.ai" cung cấp các khóa API riêng biệt cho mỗi ngôn ngữ. Điều này có nghĩa là bạn cần tạo một ứng dụng trong ngôn ngữ mong muốn và lấy khóa API tương ứng của nó.

source: Unfortunately, it is not feasible for us to gather API keys for all languages since they vary based on individual preferences.
ar: ولا يمكننا جمع كل اللغات المستخدمة لإنشاء مفاتيح لها.
es: Lamentablemente, no nos es posible reunir claves API para todos los idiomas, ya que varían en función de las preferencias individuales.
fr: Malheureusement, il n'est pas possible pour nous de rassembler les clés API pour toutes les langues car elles varient en fonction des préférences individuelles.
ru: К сожалению, мы не можем собрать API-ключи для всех языков, поскольку они зависят от индивидуальных предпочтений.
tr: Ne yazık ki, bireysel tercihlere göre değişiklik gösterdikleri için tüm diller için API anahtarlarını toplamak mümkün değildir.
vi: Rất tiếc, việc thu thập khóa API cho tất cả các ngôn ngữ là không khả thi vì chúng khác nhau dựa trên sở thích cá nhân.

source: Therefore, we will provide you with instructions on how to obtain your own private API key.
ar: نتيجة لكل ما سبق, نرشدكم إلى طريقة الحصول على مفتاح خاص بكم.
es: Por lo tanto, le proporcionaremos instrucciones sobre cómo obtener su propia clave API privada.
fr: C'est pourquoi nous vous fournissons des instructions sur la manière d'obtenir votre propre clé API privée.
ru: Поэтому мы предоставим вам инструкции по получению вашего собственного частного ключа API.
tr: Bu nedenle, size kendi özel API anahtarınızı nasıl alacağınız konusunda talimatlar vereceğiz.
vi: Do đó, "chúng tôi" sẽ cung cấp cho bạn hướng dẫn về cách lấy khóa API riêng của bạn.

source: Although the following steps may appear extensive, they are straightforward and only need to be completed once.
ar: قد تبدو الخطوات كثيرة, لكنها سهلة وستحتاج لتنفيذها مرة واحدة فقط.
es: Aunque los pasos siguientes pueden parecer extensos, son sencillos y sólo hay que completarlos una vez.
fr: Bien que les étapes suivantes puissent sembler longues, elles sont simples et ne doivent être effectuées qu'une seule fois.
ru: Хотя следующие шаги могут показаться сложными, они просты и их нужно выполнить только один раз.
tr: Aşağıdaki adımlar geniş görünebilir, ancak basittir ve yalnızca bir kez tamamlanmaları gerekmektedir.
vi: Mặc dù các bước sau đây có vẻ dài dòng, nhưng chúng rất đơn giản và chỉ cần hoàn thành một lần.

source: - Open the [wit.ai website](https://wit.ai)
ar: - افتح [موقع wit.ai](https://wit.ai)
es: - Abra el [sitio web de wit.ai](https://wit.ai)
fr: - Ouvrez le [site web wit.ai](https://wit.ai)
ru: - Откройте сайт [wit.ai](https://wit.ai).
tr: - [wit.ai web sitesini](https://wit.ai) açın.
vi: - Mở [trang web wit.ai](https://wit.ai)

source: - Log in with your Meta account by clicking "Continue with Meta."
ar: - اضغط على "Continue With Meta" ثم قم بتسجيل الدخول باستخدام حسابك في Meta.
es: - Inicie sesión con una cuenta Meta pulsando "Continue With Meta".
fr: - Connectez-vous avec votre compte Meta en cliquant sur "Continue with Meta".
ru: - Войдите в свою учётную запись Meta, нажав "Продолжить с Meta".
tr: - "Meta ile Devam Et" seçeneğine tıklayarak Meta hesabınızla giriş yapın.
vi: - Đăng nhập bằng tài khoản Meta của bạn bằng cách nhấp vào "Continue With Meta."

source: - Follow the normal account creation steps or press "Continue with Facebook"
ar: - تابع خطوات إنشاء الحساب الاعتيادية, أو اضغط على "Continue with Facebook".
es: - Siga los pasos normales de creación de cuenta o pulse "Continuar con Facebook"
fr: - Suivez les étapes normales de création de compte ou cliquez sur "Continue with Facebook/Continuer avec Facebook"
ru: - Выполните обычные шаги по созданию учётной записи или нажмите "Продолжить с Facebook".
tr: - Normal hesap oluşturma adımlarını izleyin veya "Facebook ile Devam Et" seçeneğine basın.
vi: - Thực hiện các bước tạo tài khoản bình thường hoặc nhấn "Continue with Facebook"

source: - Go to the top of the page, press h or 1 for screen reader users.
ar: - انتقل ؟إلى العنوان الأول في الصفحة, اضغط h أو 1 لمستخدمي قارئات الشاشة.
es: - Vaya a la parte superior de la página, o pulse h o 1 para los usuarios de lectores de pantalla.
fr: - Allez en haut de la page, appuyez sur h ou 1 pour les utilisateurs de lecteurs d'écran.
ru: - Перейдите в верхнюю часть страницы, нажмите h или 1 для пользователей программ чтения с экрана.
tr: - Sayfanın üst kısmına gidin, ekran okuyucu kullanıcıları için h veya 1 tuşuna basın.
vi: - Đi đến đầu trang, nhấn h hoặc 1 cho người dùng trình đọc màn hình.

source: - Click "New App" and give the app any English name, such as test or my app.
ar: - اضغط على "New App" ثم قم بتسمية التطبيق بأي اسم إنجليزي, على سبيل المثال, test أو my app.
es: - Haga clic en "New App" y escriba cualquier nombre en inglés para la aplicación, como test o my app.
fr: - Cliquez sur ""New App/Nouvelle application" et donnez à l'application un nom quelconque en utilisant les lettres de l'alphabit latin, tel que test, mon application ou my app.
ru: - Нажмите "Новое приложение" и дайте приложению любое английское название, например test или my app.
tr: - "Yeni Uygulama"ya tıklayın ve uygulamaya test veya benim uygulamam gibi herhangi bir İngilizce isim verin.
vi: - Nhấp vào "New App" và đặt tên cho ứng dụng bằng bất kỳ tên tiếng Anh nào, chẳng hạn như test hoặc my app.

source: - You will find an options box for the app's language, open it and choose the appropriate language. The audio files will be converted to the language you choose.
ar: - من لغة التطبيق, ستجد صندوق خيارات قم بفتحه واختر اللغة المناسبة, سيتم تحويل الملفات الصوتية باللغة التي اخترتها.
es: - Encontrará un cuadro de opciones para el idioma de la app, ábralo y elija el idioma apropiado. Los archivos de audio se convertirán al idioma elegido.
fr: - Vous trouverez une boîte d'options pour la langue de l'application, ouvrez-la et choisissez la langue appropriée. Les fichiers audio seront convertis dans la langue choisie.
ru: - Вы найдёте поле для выбора языка приложения, откройте его и выберите подходящий язык. Аудиофайлы будут преобразованы на выбранном вами языке.
tr: - Uygulamanın dili için bir seçenek kutusu bulacaksınız, açın ve uygun dili seçin. Ses dosyaları seçtiğiniz dile dönüştürülecektir.
vi: - Bạn sẽ tìm thấy một hộp tùy chọn cho ngôn ngữ của ứng dụng, hãy mở nó và chọn ngôn ngữ phù hợp. Các tệp âm thanh sẽ được chuyển đổi sang ngôn ngữ bạn chọn.

source: - Finally click "Create".
ar: - أخيرا, اضغط على "Create".
es: - Por último, haga clic en "Create".
fr: - Enfin, cliquez sur "Create/Créer".
ru: - Наконец, нажмите "Создать".
tr: - Son olarak "Oluştur" düğmesine tıklayın.
vi: Cuối cùng nhấn "Create".

source: - Find the name of the application you created, click on it, and then navigate to the "Management" button.
ar: - بعد ذلك, تحرك في الصفحة لتجد اسم التطبيق الذي قمت بإنشائه, اضغط عليه, ثم اضغط حرف h أو رقم 3, أو انتقل بالعنوان الثالث لمستخدمي قارئ الشاشة. ويكمن هدفك هنا في إيجاد زر باسم Management.
es: - Busque el nombre de la aplicación creada, haga clic en él y, a continuación, desplácese hasta el botón "Management".
fr: - Trouvez le nom de l'application que vous avez créée, cliquez dessus, puis naviguez jusqu'au bouton "Management/Gestion".
ru: - Найдите название созданного вами приложения, нажмите на него, а затем перейдите к кнопке "Управление".
tr: - Oluşturduğunuz uygulamanın adını bulun, üzerine tıklayın ve ardından "Yönetim" düğmesine gidin.
vi: - Tìm tên của ứng dụng bạn đã tạo, nhấp vào nó, và sau đó điều hướng đến nút "Management".

source: - When you reach this button, press the letter b to find a button called Settings. Press this button.
ar: - بعد الوصول إلى هذا الزر, تحرك بحرف b لتجد زرًّا باسم Settings.اضغط على هذا الزر.
es: - Al llegar a este botón, pulse la letra b para encontrar un botón llamado "Settings". Pulse este botón.
fr: - Lorsque vous atteignez ce bouton, appuyez sur la lettre b pour trouver un bouton appelé "Settings/Paramètres". Appuyez sur ce bouton.
ru: - Когда вы доберётесь до этой кнопки, нажмите на букву b, чтобы найти кнопку "Настройки". Нажмите на эту кнопку.
tr: - Bu düğmeye ulaştığınızda, ayarlar düğmesini bulmak için b tuşuna basın. Bu düğmeye basın.
vi: - Khi bạn đến nút này, nhấn chữ b để tìm một nút gọi là Settings. Nhấn nút này.

source: - Move with the number 4 or h for screen reader users until you find a heading called Client Access Token, scroll down and you will find your key as a button. You can select the text manually to copy it or press the same button to for it to be automatically copied.
ar: - ثم تحرك بالرقم 2 أو h لمستخدمي قارئ الشاشة, حتى تجد عنوانًا باسم Client Access Token, انزل وستجد مفتاحك عبارة عن زر. يمكنك تحديد النص يدويًا أو الضغط على المفتاح نفسه لنسخه.
es: - Muévase con el número 4 o h para los usuarios de lectores de pantalla hasta encontrar un encabezado llamado Client Access Token, desplácese hacia abajo y encontará su clave como un botón. Puede seleccionar el texto manualmente para copiarlo o pulsar el mismo botón para que se copie automáticamente.
fr: - Déplacez-vous avec le chiffre 4 ou h pour les utilisateurs de lecteurs d'écran jusqu'à ce que vous trouviez une rubrique intitulée "Client Access Token", faites défiler vers le bas et vous trouverez votre clé sous la forme d'un bouton. Vous pouvez sélectionner le texte manuellement pour le copier ou appuyer sur le même bouton pour qu'il soit automatiquement copié.
ru: - Двигайтесь с помощью цифры 4 или h для пользователей программы чтения с экрана, пока не найдёте заголовок под названием Client Access Token (Токен доступа клиента), прокрутите вниз, и вы найдёте свой ключ в виде кнопки. Вы можете выделить текст вручную, чтобы скопировать его, или нажать ту же кнопку, чтобы он скопировался автоматически.
tr: - Müşteri Erişim Simgesi adlı bir başlık bulana kadar ekran okuyucu kullanıcıları için numara 4 veya h tuşlarıyla hareket edin, aşağı kaydırın ve anahtarınızı bir düğme olarak bulacaksınız. Metni manuel olarak seçip kopyalayabilir veya aynı düğmeye basarak otomatik olarak kopyalayabilirsiniz. - Sound Transcriber'a geri dönün ve API anahtarınızı sağlanan alana yapıştırın.
vi: - Di chuyển với số 4 hoặc h cho người dùng trình đọc màn hình cho đến khi bạn tìm thấy một tiêu đề có tên Client Access Token, cuộn xuống và bạn sẽ thấy khóa của mình dưới dạng một nút. Bạn có thể chọn văn bản thủ công để sao chép hoặc nhấn nút tương tự để nó được sao chép tự động.

source: - Return to Sound Transcriber and paste your API key into the provided field.
ar: - عد إلى Sound Transcriber وقم بلصق مفتاحك في الحقل المخصص له كما سيرد لاحقا.
es: - Vuelva a Sound Transcriber y pegue la clave API en el campo correspondiente.
fr: - Retournez à Sound Transcriber et collez votre clé API dans le champ prévu à cet effet.
ru: - Вернитесь в Sound Transcriber и вставьте свой API-ключ в соответствующее поле.
tr: - Sound Transcriber'a geri dönün ve API anahtarınızı sağlanan alana yapıştırın.
vi: - Trở lại Sound Transcriber và dán khóa API của bạn vào trường được cung cấp.

source: You can repeat these steps and create a new application with a different name to obtain an API key for transcribing in another language. If you want to use multiple languages with wit.ai, simply repeat the steps to obtain an API key for each language.
ar: هذا كل شيء, فقط ستحتاج لتكرار الخطوات وإنشاء تطبيق جديد باسم مختلف والحصول على الرمز في حال كنت تريد أن يقوم Sound Transcriber بالتحويل باستخدام لغة أخرى.
es: Puede repetir estos pasos y crear una nueva aplicación con un nombre diferente para obtener una clave API para transcribir en otro idioma. Si quiere utilizar varios idiomas con wit.ai, sólo tiene que repetir los pasos para obtener una clave de API para cada idioma.
fr: Vous pouvez répéter ces étapes et créer une nouvelle application avec un nom différent pour obtenir une clé API pour la transcription dans une autre langue. Si vous souhaitez utiliser plusieurs langues avec wit.ai, répétez simplement les étapes pour obtenir une clé API pour chaque langue.
ru: Вы можете повторить эти шаги и создать новое приложение с другим именем, чтобы получить API-ключ для расшифровки на другом языке. Если вы хотите использовать несколько языков с wit.ai, просто повторите эти шаги, чтобы получить API-ключ для каждого языка.
tr: Bu adımları tekrarlayarak farklı bir adla yeni bir uygulama oluşturup başka bir dilde transkripsiyon yapmak için bir API anahtarı alabilirsiniz. wit.ai ile birden fazla dil kullanmak istiyorsanız, her dil için bir API anahtarı almak üzere adımları tekrarlayın.
vi: Bạn có thể lặp lại các bước này và tạo một ứng dụng mới với tên khác để lấy khóa API cho việc phiên âm bằng một ngôn ngữ khác. Nếu bạn muốn sử dụng nhiều ngôn ngữ với wit.ai, chỉ cần lặp lại các bước để lấy khóa API cho mỗi ngôn ngữ.

source: Sound Transcriber supports transcription through the use of OpenAI's Whisper API keys, which are not available for free.
ar: يدعم Sound Transcriber التحويل باستخدام مفاتيح API المقدمة من OpenAI لخدمة Whisper, وهي غير مجانية.
es: Sound Transcriber admite la transcripción mediante el uso de claves de API Whisper de OpenAI, que no están disponibles de forma gratuita.
fr: Sound Transcriber prend en charge la transcription en utilisant les clés API Whisper d'OpenAI, qui ne sont pas disponibles gratuitement.
ru: Sound Transcriber поддерживает транскрибацию с помощью ключей API Whisper от OpenAI, которые не предоставляются бесплатно.
tr: Sound Transcriber, OpenAI'nin Whisper API anahtarları kullanılarak transkripsiyonu destekler, ancak bu anahtarlar ücretsiz değildir.
vi: Sound Transcriber hỗ trợ phiên âm thông qua việc sử dụng các khóa API Whisper của OpenAI, những khóa này không có sẵn miễn phí.

source: The pricing is based on the number of characters transcribed, and specific plans are not mentioned here.
ar: يمكنك الدفع مقابل عدد الحروف, ولسنا هاهنا بصدد ذكر الخطط.
es: El precio se basa en el número de caracteres transcritos, y aquí no se mencionan planes específicos.
fr: La tarification est basée sur le nombre de caractères transcrits, et les plans spécifiques ne sont pas mentionnés ici.
ru: Цена зависит от количества расшифрованных символов, и конкретные тарифные планы здесь не упоминаются.
tr: Fiyatlandırma transkripsiyon yapılan karakter sayısına dayanmaktadır ve burada belirli planlar belirtilmemiştir.
vi: Giá cả dựa trên số lượng ký tự được phiên âm, và các gói cụ thể không được đề cập ở đây.

source: To get detailed information about the limits and subscription options, please visit [this page/.](https://platform.openai.com/account/billing/overview) Keep in mind that signing in and adding a payment method is at your own risk.
ar: راجع الحدود والاشتراكات من [هذه الصفحة/.](https://platform.openai.com/account/billing/overview)
es: Para obtener información detallada sobre los límites y las opciones de suscripción, visite [esta página/.](https://platform.openai.com/account/billing/overview). Tenga en cuenta que iniciar sesión y añadir un método de pago es bajo su propia responsabilidad.
fr: Pour obtenir des informations détaillées sur les limites et les options d'abonnement, veuillez consulter [cette page/.](https://platform.openai.com/account/billing/overview). N'oubliez pas que la connexion et l'ajout d'une méthode de paiement se font à vos risques et périls.
ru: Чтобы получить подробную информацию об ограничениях и вариантах подписки, посетите [эту страницу.](https://platform.openai.com/account/billing/overview) Помните, что вход в систему и добавление способа оплаты осуществляются на ваш страх и риск.
tr: Sınırlamalar ve abonelik seçenekleri hakkında ayrıntılı bilgi almak için lütfen [bu sayfayı](https://platform.openai.com/account/billing/overview) ziyaret edin. Giriş yapmanın ve ödeme yöntemi eklemenin kendi sorumluluğunuzda olduğunu unutmayın.
vi: Để có thông tin chi tiết về các giới hạn và tùy chọn đăng ký, vui lòng truy cập [trang này/.](https://platform.openai.com/account/billing/overview). Hãy nhớ rằng việc đăng nhập và thêm phương thức thanh toán là do bạn tự chịu rủi ro.

source: To obtain an API key for Sound Transcriber, go to the [API key page](https://platform.openai.com/account/api-keys) and click on "Create new secret key." Copy the generated key and proceed to add it in the program settings as demonstrated later.
ar: للحصول على مفتاح API لـ Sound Transcriber، افتح [ صفحة مفاتيح API](https://platform.openai.com/account/api-keys) واضغط على "Create new secret key" وقم بنسخ المفتاح. ثم قم بإضافته في إعدادات البرنامج كما سيرد لاحقًا .
es: Para obtener una clave API para Sound Transcriber, vaya a la [página de la clave API](https://platform.openai.com/account/api-keys) y haga clic en "Create new secret key." Copie la clave generada y proceda a añadirla en los ajustes del programa como se demuestra más adelante.
fr: Pour obtenir une clé API pour Sound Transcriber, rendez-vous sur la [page API key/clé API](https://platform.openai.com/account/api-keys) et cliquez sur "Create new secret key/Créer une nouvelle clé secrète". Copiez la clé générée et ajoutez-la dans les paramètres du programme comme indiqué ci-dessous.
ru: Чтобы получить API-ключ для Sound Transcriber, перейдите на страницу [API-ключи] (https://platform.openai.com/account/api-keys) и нажмите на кнопку "Создать новый секретный ключ". Скопируйте сгенерированный ключ и добавьте его в настройки программы, как показано далее.
tr: Sound Transcriber için bir API anahtarı almak üzere, [API anahtarları sayfasına](https://platform.openai.com/account/api-keys) gidin ve "Yeni gizli anahtar oluştur" seçeneğine tıklayın. Oluşturulan anahtarı kopyalayın ve daha sonra program ayarlarına ekleyin.
vi: Để lấy khóa API cho Sound Transcriber, hãy truy cập trang [khóa API](https://platform.openai.com/account/api-keys) và nhấp vào "Create new secret key." Sao chép khóa được tạo ra và tiếp tục thêm nó vào cài đặt chương trình như được trình bày sau.

source: ## Sound Transcriber Interface:
ar: ## واجهة Sound Transcriber:
es: ## Interfaz de Sound Transcriber:
fr: ## Interface de Sound Transcriber :
ru: ## Интерфейс Sound Transcriber:
tr: ## Sound Transcriber Arayüzü:
vi: ## Giao diện Sound Transcriber:

source: Upon opening the program, you will find an edit box displaying the transcribed result. Use the tab key to navigate through the other options.
ar: عند فتح البرنامج, ستجد مربع تحرير للنتيجة, تنقل بمفتاح tab لتصفح بقية الخيارات.
es: Al abrir el programa, encontrará un cuadro de edición que muestra el resultado transcrito. Utiliza el tabulador para navegar por el resto de opciones.
fr: À l'ouverture du programme, vous trouverez une boîte d'édition affichant le résultat de la transcription. Utilisez la touche de tabulation pour naviguer dans les autres options.
ru: После открытия программы вы увидите поле редактирования, в котором отображается результат расшифровки. Используйте клавишу табуляции для перемещения по другим опциям.
tr: Programı açtığınızda, dönüştürülen sonucu gösteren bir düzenleme kutusu bulacaksınız. Diğer seçenekler arasında gezinmek için sekme tuşunu kullanın.
vi: Khi mở chương trình, bạn sẽ thấy một hộp chỉnh sửa hiển thị kết quả đã được phiên âm. Sử dụng phím tab để điều hướng qua các tùy chọn khác.

source: The "Language" box allows you to specify the language of the file you want to transcribe. Select the appropriate language using the arrow keys.
ar: صندوق اللغة لتحديد لغة الملف المراد تحويله, تحرك بالأسهم وحدد لغتك المناسبة.
es: La casilla "Idioma" le permite especificar el idioma del archivo que desea transcribir. Seleccione el idioma adecuado utilizando las flechas.
fr: La case "Langue" vous permet de spécifier la langue du fichier que vous souhaitez transcrire. Sélectionnez la langue appropriée à l'aide des touches fléchées.
ru: В поле "Язык" можно указать язык файла, который вы хотите расшифровать. Выберите нужный язык с помощью клавиш-стрелок.
tr: "Dil" kutusu, dönüştürmek istediğiniz dosyanın dilini belirtmenize olanak tanır. Uygun dili seçmek için ok tuşlarını kullanın.
vi: Hộp "Ngôn ngữ" cho phép bạn chỉ định ngôn ngữ của tập tin mà bạn muốn phiên âm. Chọn ngôn ngữ phù hợp bằng cách sử dụng các phím mũi tên.
