Repository: Kostenkov-2021/SoundTranscriber
Catalog: documentation/*/WhatsNew.po
Languages: ar, es, fr, ru, tr, vi

source: - Updated the version of Python used to Python 3.11.7.
ar: - تم تحديث إصدار بايثون المستخدم إلى بايثون 3.11.7.
es: - Actualizada la versión de python usada a python 11.3.7.
fr: - Mise à jour de la version de Python utilisée à Python 3.11.7.
ru: - Обновлена версия используемого Python до Python 3.11.7.
tr: - Kullanılan Python sürümü Python 3.11.7'ye güncellendi.
vi: - Cập nhật phiên bản Python được sử dụng lên Python 3.11.7.

source: - Several minor improvements....
ar: - تحسينات صغيرة.
es: - Varios cambios menores.
fr: - Diverses améliorations mineures.
ru: - Несколько незначительных улучшений .
tr: - Birkaç küçük iyileştirme.
vi: - Một số cải tiến nhỏ....

source: ## Version 1.3.2:
ar: ## الإصدار 1.3.2:
es: ## Versión 1.3.2:
ru: ## Версия 1.3.2:
tr: ## Sürüm 1.3.2:
vi: ## Phiên bản 1.3.2:

source: - You can now add files using drag and drop.
ar: - يمكنك الآن إضافة ملفات باستخدام السحب والإفلات.
es: - Ahora se pueden añadir ficheros con la opción de arrastrar y soltar.
fr: - Vous pouvez désormais ajouter des fichiers par glisser-déposer.
ru: - Теперь вы можете добавлять файлы с помощью перетаскивания .
tr: - Artık sürükle ve bırak kullanarak dosya ekleyebilirsiniz.
vi: - Bây giờ bạn có thể thêm tập tin bằng cách kéo và thả.

source: - Fixed a major bug that caused extracted text to appear in the wrong order when converting long files.
ar: - تم إصلاح خطأ كبير يتسبب في ظهور النصوص المستخرجة بترتيب غير صحيح عند تحويل ملفات طويلة.
es: - Arreglado un error que hacía que al extraer texto apareciera en un orden diferente al esperado al convertir ficheros.
fr: - Correction d'un bogue majeur qui faisait que le texte extrait apparaissait dans le mauvais ordre lors de la conversion de longs fichiers.
ru: - Исправлена ошибка , из - за которой извлечённый текст отображался в неправильном порядке при конвертировании длинных файлов .
tr: - Uzun dosyaları dönüştürürken çıkarılan metnin yanlış sırada görünmesine neden olan büyük bir hata düzeltildi.
vi: - Đã sửa một lỗi nghiêm trọng khiến văn bản được trích xuất xuất hiện theo thứ tự sai khi chuyển đổi các tệp dài.

source: - Fixed a bug that caused the save option to be disabled if the conversion was canceled before completion.
ar: - تم إصلاح خطأ يتسبب في تعطيل خيار الحفظ عند إيقاف التحويل قبل اكتماله.
es: - Arreglado un error que hacía que la opción de guardado se deshabilitara si la conversión no había finalizado.
fr: - Correction d'un bogue qui entraînait la désactivation de l'option d'enregistrement si la conversion était annulée avant d'être terminée.
ru: - Исправлена ошибка , приводившая к отключению опции сохранения , если конвертация была отменена до завершения .
tr: - Dönüştürme tamamlanmadan iptal edilirse kaydetme seçeneğinin devre dışı kalmasına neden olan bir hata düzeltildi.
vi: - Đã sửa lỗi khiến tùy chọn lưu bị vô hiệu nếu quá trình chuyển đổi bị hủy trước khi hoàn tất.

source: - Several improvements to the Arabic translation. Many thanks to Zeinab Bahaa.
ar: - بعض التحسينات على الترجمة العربية. جزيل الشكر لزينب بهاء.
es: - Varias mejoras a la traducción al árabe. Muchas gracias a Zeinab Bahaa.
fr: - Plusieurs améliorations de la traduction arabe. Un grand merci à Zeinab Bahaa.
ru: - Несколько улучшений в арабском переводе . Большое спасибо Зейнаб Бахаа .
tr: - Arapça çeviriye birkaç iyileştirme yapıldı. Zeinab Bahaa'ya çok teşekkürler.
vi: - Một số cải tiến cho bản dịch tiếng Ả Rập. Xin cảm ơn Zeinab Bahaa rất nhiều.

source: - Various minor improvements.
ar: - بعض التحسينات الصغيرة.
es: - Otros cambios menores.
fr: - Diverses améliorations mineures ont été apportées pour une meilleure expérience utilisateur.
ru: - Различные мелкие улучшения .
tr: - Çeşitli küçük iyileştirmeler.
vi: - Nhiều cải tiến nhỏ khác nhau.

source: ## Version 1.3.1:
ar: ## الإصدار 1.3.1:
es: ## Versión 1.3.1:
ru: ## Версия 1.3.1:
tr: ## Sürüm 1.3.1:
vi: ## Phiên bản 1.3.1:

source: Some fixes and improvements.
ar: بعض التصحيحات والتحسينات.
es: Algunas correcciones y mejoras.
fr: Quelques corrections et améliorations.
ru: Некоторые исправления и улучшения.
tr: Bazı düzeltmeler ve iyileştirmeler.
vi: Một số sửa lỗi và cải tiến.

source: ## Version 1.3.0:
ar: ## الإصدار 1.3.0:
es: ## Versión 1.3.0:
ru: ## Версия 1.3.0:
tr: ## Sürüm 1.3.0:
vi: ## Phiên bản 1.3.0:

source: - French translation added. Many thanks to Riad Assoum.
ar: - تمت إضافة الترجمة الفرنسية, جزيل الشكر لرياض أسوم.
es: - Añadida traducción al francés. Muchas gracias a Riad Assoum.
fr: - Ajout de la traduction française. Un grand merci à Riad Assoum.
ru: - Добавлен французский перевод . Большое спасибо Риаду Ассуму .
tr: - Fransızca çeviri eklendi. Riad Assoum'a çok teşekkürler.
vi: - Đã thêm bản dịch tiếng Pháp. Cảm ơn Riad Assoum rất nhiều.

source: - You can now open files in Sound Transcriber to Transcribe them from the context menu of supported file types.
ar: - أصبح بإمكانك فتح ملفات في Sound Transcriber لتحويلها من قائمة السياق لأنواع الملفات المدعومة.
es: - Ahora se pueden abrir archivos en Sound Transcriber para transcribirlos desde el menú contextual de los tipos de archivo compatibles.
fr: - Vous pouvez maintenant ouvrir des fichiers dans Sound Transcriber pour les transcrire à partir du menu contextuel des types de fichiers pris en charge.
ru: - Теперь вы можете открывать файлы в Sound Transcriber, чтобы транскрибировать их из контекстного меню поддерживаемых типов файлов.
tr: - Desteklenen dosya türlerinin bağlam menüsünden dosya açarak Sound Transcriber'da transkripsiyon yapabilirsiniz.
vi: - Giờ bạn có thể mở tập tin trong Sound Transcriber để phiên âm chúng từ menu ngữ cảnh của các loại tập tin được hỗ trợ.

source: - You can now access Sound Transcriber swiftly by simply typing 'st' in the Run dialog.
ar: - أصبح بإمكانك فتح Sound Transcriber من نافذة التشغيل Run عن طريق كتابة الكلمة st.
es: - Ahora se puede acceder rápidamente a Sound Transcriber con sólo escribir 'st' en el cuadro de diálogo de Ejecutar.
fr: - Vous pouvez désormais accéder rapidement à Sound Transcriber en tapant simplement "st" dans la boîte de dialogue Exécuter.
ru: - Теперь вы можете быстро получить доступ к Sound Transcriber, просто набрав ' st' в диалоге "Выполнить".
tr: - Çalıştır iletişim kutusunda 'st' yazarak Sound Transcriber'a hızlıca erişebilirsiniz.
vi: - Giờ đây, bạn có thể truy cập Sound Transcriber nhanh chóng bằng cách chỉ cần nhập 'st' trong hộp thoại Run.

source: - Sound Transcriber is now able to automatically recognize interface translations and integrate new help files. To contribute, translate the messages.pot file using Poedit and save the files in the same order as the existing language files.
ar: - أصبح Sound Transcriber قادرا على التعرف على ترجمات الواجهة وملفات المساعدة الجديدة بشكل تلقائي. قم بترجمة ملف messages.pot باستخدام Poedit ثم احفظ الملفات بنفس ترتيب ملفات اللغات المدعومة حاليا.
es: - Sound Transcriber es ahora capaz de reconocer automáticamente las traducciones de la interfaz e integrar nuevos archivos de ayuda. Para contribuir, traduzca el archivo messages.pot utilizando Poedit y guarde los archivos en el mismo orden que los archivos de idioma existentes.
fr: - Sound Transcriber est désormais capable de reconnaître automatiquement les traductions de l'interface et d'intégrer de nouveaux fichiers d'aide. Pour y contribuer, traduisez le fichier messages.pot à l'aide de Poedit et enregistrez les fichiers dans le même ordre que les fichiers de langue existants.
ru: - Sound Transcriber теперь может автоматически распознавать переводы интерфейса и интегрировать новые файлы справки. Чтобы внести свой вклад, переведите файл messages.pot с помощью Poedit и сохраните файлы в том же порядке, что и существующие языковые файлы.
tr: - Sound Transcriber artık arayüz çevirilerini otomatik olarak tanıyabilir ve yeni yardım dosyalarını entegre edebilir. Katkıda bulunmak için messages.pot dosyasını Poedit kullanarak çevirin ve dosyaları mevcut dil dosyalarıyla aynı sırayla kaydedin.
vi: - Sound Transcriber giờ đây có thể tự động nhận dạng bản dịch giao diện và tích hợp các tệp trợ giúp mới. Để đóng góp, hãy dịch tệp messages.pot bằng Poedit và lưu các tệp theo cùng thứ tự với các tệp ngôn ngữ hiện có.

source: - When the option to keep downloaded files is turned off, Sound Transcriber will retain them until the program is closed. This is particularly handy if you wish to repeat the conversion process with different options.
ar: - في حال تعطيل خيار الاحتفاظ بالملفات التي تم تنزيلها, سيحتفظ Sound Transcriber بالملفات التي تم تنزيلها حتى يتم إغلاق البرنامج, وهو أمر مفيد في حال أردت تكرار عملية التحويل بخيارات مختلفة.
es: - Si se desactiva la opción de conservar los archivos descargados, Sound Transcriber los conservará hasta que se cierre el programa. Esto resulta especialmente práctico si desea repetir el proceso de conversión con diferentes opciones.
fr: - Lorsque l'option de conservation des fichiers téléchargés est désactivée, Sound Transcriber les conserve jusqu'à la fermeture du programme. Ceci est particulièrement pratique si vous souhaitez répéter le processus de conversion avec différentes options.
ru: - Если отключить опцию сохранения загруженных файлов , Sound Transcriber будет сохранять их до закрытия программы. Это особенно удобно, если вы хотите повторить процесс конвертации с разными опциями.
tr: - İndirilen dosyaları saklama seçeneği kapalı olduğunda, Sound Transcriber program kapatılana kadar onları saklayacaktır. Bu, farklı seçeneklerle dönüşüm işlemini tekrarlamak isterseniz özellikle kullanışlıdır.
vi: - Khi tùy chọn giữ tệp đã tải xuống bị tắt, Sound Transcriber sẽ giữ chúng cho đến khi chương trình được đóng. Điều này đặc biệt hữu ích nếu bạn muốn lặp lại quá trình chuyển đổi với các tùy chọn khác nhau.

source: - Several bugs related to the paste from clipboard feature have been fixed. Like ignoring certain paths, failure to start conversions from the detection message, pasting links at any time, and more. Many thanks to Dawlat Hassan for the note that helped uncover many of these bugs associated with this feature.
ar: - تم إصلاح أخطاء عديدة مرتبطة بميزة اللصق من الحافظة, بما في ذلك تجاهل بعض المسارات وفشل بدء التحويل من رسالة الاكتشاف ولصق روابط في أي وقت وغير ذلك. جزيل الشكر لـ أ. دولت حسن على الملاحظة التي كانت سبباً لاكتشاف الكثير من الأخطاء المرتبطة بهذه الميزة.
es: - Se han corregido varios errores relacionados con la función de pegar desde el portapapeles. Como ignorar ciertas rutas, fallos al iniciar las conversiones desde el mensaje de detección, pegar enlaces en cualquier momento, y más. Muchas gracias a Dawlat Hassan por el comentario que ayudó a descubrir muchos de estos errores relacionados con esta función.
fr: - Merci à Dawlat Hassan pour l'information - de nombreux bogues liés à la fonction de collage dans le presse-papiers ont été éliminés. Des problèmes tels que l'ignorance de certains chemins, l'impossibilité de lancer la conversion à partir du message de détection, le collage de liens à n'importe quel moment, et bien d'autres encore, appartiennent désormais au passé.
ru: - Исправлено несколько ошибок , связанных с функцией вставки из буфера обмена . Например , игнорирование определённых путей , невозможность начать конвертацию из сообщения об обнаружении , вставка ссылок в любое время и многое другое . Большое спасибо Давлату Хассану за заметку , которая помогла обнаружить многие из этих ошибок , связанных с данной функцией .
tr: - Pano özelliğinden yapıştırma ile ilgili birkaç hata düzeltildi. Belirli yolları görmezden gelme, algılama mesajından dönüşümleri başlatamama, her zaman bağlantıları yapıştırma gibi. Bu özellik ile ilgili birçok hatanın ortaya çıkarılmasına yardımcı olan not için Dawlat Hassan'a teşekkürler.
vi: - Một số lỗi liên quan đến tính năng dán từ khay nhớ tạm đã được sửa. Như bỏ qua một số đường dẫn, không bắt đầu chuyển đổi từ thông báo phát hiện, dán liên kết bất kỳ lúc nào và hơn thế nữa. Cảm ơn rất nhiều Dawlat Hassan vì ghi chú đã giúp phát hiện ra nhiều lỗi liên quan đến tính năng này.

source: - Fixed a bug that occasionally caused Sound Transcriber to start in a different language after the last update.
ar: - تم إصلاح خطأ كان يتسبب في بدء Sound Transcriber بلغة مختلفة عن اللغة الحالية بعد التحديث أحيانا.
es: - Arreglado un error que a veces provocaba que Sound Transcriber se iniciara en otro idioma después de la última actualización.
fr: - Correction d'un bogue qui provoquait parfois le démarrage de Sound Transcriber dans une langue différente après la dernière mise à jour.
ru: - Исправлена ошибка , из - за которой после последнего обновления Sound Transcriber иногда запускался на другом языке.
tr: - Son güncellemeden sonra Sound Transcriber'ın bazen farklı bir dilde başlamasına neden olan bir hata düzeltildi.
vi: - Đã sửa lỗi đôi khi khiến Sound Transcriber bắt đầu bằng một ngôn ngữ khác sau lần cập nhật cuối cùng.

source: - You can no longer open two instances of Sound Transcriber simultaneously.
ar: - لم يعد بإمكانك فتح نافذتين من Sound Transcriber في الوقت نفسه.
es: - Ya no se pueden abrir dos instancias de Sound Transcriber simultáneamente.
fr: - Vous ne pouvez plus ouvrir deux instances de Sound Transcriber simultanément.
ru: - Вы больше не можете открыть два экземпляра Sound Transcriber одновременно.
tr: - Aynı anda iki Sound Transcriber örneğini açamazsınız.
vi: - Bạn không thể mở hai phiên bản Sound Transcriber cùng một lúc nữa.

source: - Implemented changes to the conversion stopping method.
ar: - أُجريَت بعض التعديلات على طريقة إيقاف التحويل.
es: - Se han introducido cambios en el método de detención de la conversión.
fr: - Des changements ont été apportés à la méthode d'arrêt de la conversion pour une expérience plus fluide.
ru: - Внесены изменения в метод остановки конвертации .
tr: - Dönüşüm durdurma yönteminde değişiklikler uygulandı.
vi: - Thực hiện các thay đổi đối với phương pháp dừng chuyển đổi.

source: - Various minor improvements...
ar: - بعض التحسينات الصغيرة.
es: - Otros cambios menores.
fr: - Diverses améliorations mineures ont été apportées pour une meilleure expérience utilisateur.
ru: - Различные мелкие улучшения .
tr: - Çeşitli küçük iyileştirmeler.
vi: - Những cải tiến nhỏ khác nhau...

source: ## Version 1.2.0:
ar: ## الإصدار 1.2.0:
es: ## Versión 1.2.0:
ru: ## Версия 1.2.0:
tr: ## Sürüm 1.2.0:
vi: ## Phiên bản 1.2.0:

source: Important, starting with this version, Sound Transcriber will only support 64 bit versions of Windows.
ar: هام, بدءاً من هذا الإصدار, سيدعم Sound Transcriber إصدارات Windows 64 bit فقط.
es: Importante, a partir de esta versión, Sound Transcriber sólo soportará versiones de 64 bits de Windows.
fr: Important, à partir de cette version, Sound Transcriber ne prendra en charge que les versions 64 bits de Windows.
ru: Важно, начиная с этой версии, Sound Transcriber будет поддерживать только 64-битные версии Windows.
tr: Önemli, bu sürümden itibaren Sound Transcriber yalnızca 64 bit Windows sürümlerini destekleyecektir.
vi: Quan trọng, bắt đầu từ phiên bản này, Sound Transcriber sẽ chỉ hỗ trợ phiên bản Windows 64 bit.

source: - Added Spanish translation. Many thanks to Georgiana Frincu.
ar: - تمت إضافة الترجمة الإسبانية. جزيل الشكر لـ Georgiana Frincu.
es: - Añadida traducción al español. Muchas gracias a Georgiana Frincu.
fr: - Ajout d'une traduction en espagnol. Merci à Georgiana Frincu.
ru: - Добавлен перевод на испанский язык . Большое спасибо Георгиане Фринку .
tr: - İspanyolca çeviri eklendi. Georgiana Frincu'ya çok teşekkürler.
vi: - Đã thêm bản dịch tiếng Tây Ban Nha. Cảm ơn Georgiana Frincu rất nhiều.

source: - You can now convert videos from Youtube, Facebook, Twitter (X) and other services into text, so that Sound Transcriber will download the video and then convert it.
ar: - أصبح بإمكانك تحويل فيديوهات من Youtube وـ Facebook وـ Twitter (X) وغيرها من الخدمات إلى نص، بحيث سيقوم Sound Transcriber بتحميل الفيديو ثم تحويله.
es: - Ahora se puede convertir vídeos de Youtube, Facebook, Twitter (X) y otros servicios en texto, para que Sound Transcriber descargue el vídeo y luego lo convierta.
fr: - Vous pouvez maintenant convertir des vidéos de Youtube, Facebook, Twitter (X) et d'autres services en texte, de sorte que Sound Transcriber téléchargera la vidéo et la convertira ensuite.
ru: - Теперь вы можете конвертировать видео с Youtube, Facebook, Twitter (X) и других сервисов в текст, чтобы Sound Transcriber загрузил видео, а затем конвертировал его.
tr: - Artık Youtube, Facebook, Twitter (X) ve diğer hizmetlerden videoları metne dönüştürebilirsiniz, böylece Sound Transcriber videoyu indirir ve ardından dönüştürür.
vi: - Bây giờ bạn có thể chuyển đổi video từ Youtube, Facebook, Twitter (X) và các dịch vụ khác thành văn bản để Sound Transcriber tải video xuống rồi chuyển đổi.

source: - You can choose to keep the original file after conversion or delete it from the settings.
ar: - يمكنك اختيار الاحتفاظ بالملف الأصل بعد التحويل أو حذفه من الإعدادات.
es: - Se puede elegir entre conservar el archivo original tras la conversión o eliminarlo desde los ajustes.
fr: - Vous pouvez choisir de conserver le fichier original après la conversion ou de le supprimer dans les paramètres.
ru: - В настройках можно выбрать , сохранить ли исходный файл после конвертации или удалить его .
tr: - Dönüştürmeden sonra orijinal dosyayı saklamayı veya ayarlardan silmeyi seçebilirsiniz.
vi: - Bạn có thể chọn giữ lại tập tin gốc sau khi chuyển đổi hoặc xóa nó khỏi cài đặt.

source: - Pause and resume feature has been added to the transcription process.
ar: - تمت إضافة ميزة الإيقاف المؤقت والاستئناف لعملية التحويل.
es: - Se ha añadido la función de pausa y reanudación al proceso de transcripción.
fr: - La fonction de pause et de reprise a été ajoutée au processus de transcription.
ru: - В процесс транскрибирования добавлена функция паузы и возобновления .
tr: - Transkripsiyon sürecine duraklatma ve devam ettirme özelliği eklendi.
vi: - Tính năng tạm dừng và tiếp tục đã được thêm vào quá trình phiên âm.

source: - You can now paste file paths to be converted.
ar: - أصبح بإمكانك لصق مسارات ملفات ليتم تحويلها.
es: - Ahora se pueden pegar las rutas de los archivos a convertir.
fr: - Vous pouvez désormais coller les chemins d'accès aux fichiers à convertir.
ru: - Теперь можно вставлять пути к конвертируемым файлам .
tr: - Dönüştürülecek dosya yollarını yapıştırabilirsiniz.
vi: - Bây giờ bạn có thể dán đường dẫn tập tin cần chuyển đổi.

source: - You can specify the file extension that is sent to wit.ai for conversion from settings.
ar: - يمكنك تحديد امتداد الملف الذي يتم إرساله إلى wit.ai للتحويل من الإعدادات.
es: - Se puede especificar la extensión de archivo que se envía a wit.ai para la conversión desde la configuración.
fr: - Vous pouvez spécifier l'extension de fichier qui est envoyée à wit.ai pour la conversion à partir des paramètres.
ru: - В настройках можно указать расширение файла , который будет отправлен в wit.ai для конвертации.
tr: - wit.ai'ye gönderilecek dosya uzantısını ayarlardan belirleyebilirsiniz.
vi: - Bạn có thể chỉ định phần mở rộng tập tin được gửi tới wit.ai để chuyển đổi từ cài đặt.

source: - Sound Transcriber will try to handle files with names contain Emojis.
ar: - سيحاول Sound Transcriber التعامل مع الملفات التي تحتوي أسماؤها على رموز Emoji.
es: - Sound Transcriber intentará gestionar los archivos cuyos nombres contengan Emojis.
fr: - Sound Transcriber essaiera de traiter les fichiers dont le nom contient des Emojis.
ru: - Sound Transcriber будет пытаться обрабатывать файлы с именами, содержащими эмодзи.
tr: - Sound Transcriber, adlarında Emojiler bulunan dosyaları işlemeye çalışacaktır.
vi: - Sound Transcriber sẽ cố gắng xử lý các tập tin có tên chứa biểu tượng cảm xúc.

source: - Sound Transcriber no longer stops during conversion. If this happens, you will still be able to continue the process.
ar: - لم يعد Sound Transcriber يتوقف أثناء التحويل؛ وفي حال حدث ذلك, ستبقى قادرا على متابعة العملية.
es: - Sound Transcriber ya no se detiene durante la conversión. Si esto ocurre, se podrá continuar con el proceso.
fr: - Sound Transcriber ne s'arrêtera plus pendant la conversion. Si cela se produit, vous pourrez toujours continuer le processus.
ru: - Sound Transcriber больше не останавливается во время конвертации. Если это произойдёт, вы сможете продолжить процесс.
tr: - Sound Transcriber artık dönüştürme sırasında durmaz. Bu gerçekleşirse, işlemi devam ettirebilirsiniz.
vi: - Sound Transcriber sẽ không còn dừng lại trong quá trình chuyển đổi. Nếu điều này xảy ra, bạn vẫn có thể tiếp tục quá trình.

source: - Small improvements here and there.
ar: - تحسينات صغيرة هنا وهناك.
es: - Pequeñas mejoras aquí y allá.
fr: - Petites améliorations ici et là.
ru: - Различные мелкие улучшения .
tr: - Burada ve orada küçük iyileştirmeler.
vi: - Những cải tiến nhỏ chỗ này chỗ kia.

source: ### Notes
ar: ### ملاحظات
es: ### Notas
ru: ### Примечания
tr: ### Notlar
vi: ### Ghi chú

source: - Pausing is supported while extracting text but not while splitting files.
ar: - يمكنك إيقاف العملية مؤقتا أثناء استخراج النص, لكن لا يمكن إيقافها مؤقتا أثناء تقسيم الملف.
es: - Se puede pausar mientras se extrae texto, pero no mientras se dividen archivos.
fr: - La mise en pause est prise en charge lors de l'extraction de texte, mais pas lors de la division de fichiers.
ru: - Пауза поддерживается при извлечении текста , но не при разбиении файлов .
tr: - Metin çıkarma sırasında duraklatma desteklenir, ancak dosyaları bölme sırasında desteklenmez.
vi: - Hỗ trợ tạm dừng trong quá trình trích xuất văn bản nhưng không hỗ trợ trong quá trình chia nhỏ tập tin.

source: - If you temporarily stop a process and then start a new conversion process, you will lose everything related to the previous process; Therefore, it is advisable to save the current result before starting a new conversion.
ar: - في حال قمت بإيقاف عمليةٍ ما مؤقتا ثم بدأت عملية تحويل جديدة, ستفقد كل ما يخص العملية السابقة؛ لذا, يُنصَح بحفظ النتيجة الحالية قبل بدء عملية تحويل جديدة.
es: - Si se detiene temporalmente un proceso y luego se quiere iniciar un nuevo proceso de conversión, se perderá todo lo relacionado con el proceso anterior; Por lo tanto, es aconsejable guardar el resultado actual antes de iniciar una nueva conversión.
fr: - Si vous arrêtez temporairement un processus et que vous démarrez ensuite un nouveau processus de conversion, vous perdrez tout ce qui est lié au processus précédent ; par conséquent, il est conseillé de sauvegarder le résultat actuel avant de démarrer une nouvelle conversion.
ru: - Если вы временно остановите процесс , а затем начнете новый , вы потеряете все , что связано с предыдущим процессом ; поэтому рекомендуется сохранять текущий результат перед началом нового преобразования .
tr: - Bir işlemi geçici olarak durdurursanız ve ardından yeni bir dönüştürme işlemi başlatırsanız, önceki işle ilgili her şeyi kaybedersiniz; Bu nedenle, yeni bir dönüşüme başlamadan önce mevcut sonucu kaydetmeniz tavsiye edilir.
vi: - Nếu bạn tạm dừng một quy trình và sau đó bắt đầu một quy trình chuyển đổi mới, bạn sẽ mất mọi thứ liên quan đến quy trình trước đó; Do đó, nên lưu kết quả hiện tại trước khi bắt đầu quá trình chuyển đổi mới.
