Repository: Kostenkov-2021/SoundTranscriber
Catalog: documentation/*/WhatsNew.po
Languages: ar, es, fr, ru, tr, vi

source: - Choosing the wav format in wit.ai settings speeds up file splitting but leads to slower conversion and increased data usage. Consider trying .ogg and sharing your feedback on the results.
ar: - يؤدي اختيار صيغة wav في إعدادات wit.ai إلى تقسيم الملف بشكل أسرع بكثير, إلا أن تحويله سيكون أبطأ ويستهلك المزيد من بيانات الإنترنت. نوصي بتجربة صيغة ogg وإخبارنا بالنتائج.
es: - Elegir el formato wav en los ajustes de wit.ai acelera la división de archivos, pero provoca una conversión más lenta y un mayor uso de datos. Considere la posibilidad de probar .ogg y compartir sus comentarios sobre los resultados.
fr: - Choisir le format wav dans les paramètres de wit.ai accélèrera le découpage des fichiers mais entraînera une conversion plus lente et une utilisation accrue des données. Envisagez d'essayer le format .ogg et de partager vos commentaires sur les résultats.
ru: - Выбор формата wav в настройках wit.ai ускоряет разбиение файлов на части, но приводит к замедлению конвертации и увеличению расхода данных. Попробуйте использовать формат . ogg и поделитесь своими отзывами о результатах.
tr: - wit.ai ayarlarında wav formatını seçmek, dosya bölmeyi hızlandırır ancak dönüşümü yavaşlatır ve veri kullanımını artırır. .ogg'u denemeyi ve sonuçlar hakkındaki geri bildiriminizi paylaşmayı düşünün.
vi: - Việc chọn định dạng wav trong cài đặt wit.ai sẽ tăng tốc độ chia nhỏ tệp nhưng dẫn đến chuyển đổi chậm hơn và tăng mức sử dụng dữ liệu. Hãy cân nhắc dùng thử định dạng .ogg và chia sẻ phản hồi của bạn về kết quả.

source: ## Version 1.1.2:
ar: ## الإصدار 1.1.2:
es: ## Versión 1.1.2:
ru: ## Версия 1.1.2:
tr: ## Sürüm 1.1.2:
vi: ## Phiên bản 1.1.2:

source: - Fixed a bug that prevented proper conversion of .mp4 files.
ar: - تم إصلاح خطأ كان يمنع تحويل ملفات .mp4 بشكل صحيح.
es: - Se ha corregido un error que impedía la conversión correcta de archivos .mp4.
fr: - Correction d'un bogue qui empêchait la conversion correcte des fichiers .mp4.
ru: - Исправлена ошибка , препятствовавшая правильному преобразованию файлов .mp4.
tr: - .mp4 dosyalarının düzgün dönüştürülmesini engelleyen bir hata düzeltildi.
vi: - Đã sửa lỗi khiến việc chuyển đổi các tập tin .mp4 không đúng cách.

source: - Fixed a bug that caused the saved file format to retain the extension of the original file with the output files, and sometimes saved the output files with the same extension as the original file when opening a file via the clipboard.
ar: - تم إصلاح خطأ كان يتسبب بحفظ صيغة اسم الملف الأصل مع الملفات الناتجة, وأحيانا حفظ الملفات الناتجة بنفس امتداد الملف الأصل عند فتح ملف عن طريق الحافظة.
es: - Se ha corregido un error que provocaba que el formato de archivo guardado conservara la extensión del archivo original con los archivos de salida y, en ocasiones, guardaba los archivos de salida con la misma extensión que el archivo original al abrir un archivo a través del portapapeles.
fr: - Correction d'un bogue qui faisait que le format de fichier enregistré conservait l'extension du fichier d'origine avec les fichiers de sortie, et parfois enregistrait les fichiers de sortie avec la même extension que le fichier d'origine lors de l'ouverture d'un fichier via le presse-papiers.
ru: - Исправлена ошибка , из - за которой при сохранении формата файла в выходных файлах сохранялось расширение исходного файла , а при открытии файла через буфер обмена выходные файлы иногда сохранялись с тем же расширением , что и исходный файл .
tr: - Kaydedilen dosya formatının, çıkış dosyalarıyla birlikte orijinal dosyanın uzantısını korumasına ve bazen pano aracılığıyla bir dosya açıldığında çıkış dosyalarını orijinal dosyanın uzantısıyla kaydetmesine neden olan bir hata düzeltildi.
vi: - Đã sửa lỗi khiến định dạng tập tin được lưu giữ lại phần mở rộng của tập tin gốc với các tập tin đầu ra và đôi khi lưu các tập tin đầu ra với cùng phần mở rộng với tập tin gốc khi mở tập tin qua khay nhớ tạm.

source: - You can no longer switch between services and open Sound Transcriber settings during the conversion process.
ar: - لم يعد بإمكانك التبديل بين الخدمات وفتح إعدادات Sound Transcriber أثناء تقدم عملية التحويل.
es: - Ya no es posible cambiar entre servicios y abrir la configuración de Sound Transcriber durante el proceso de conversión.
fr: - Il n'est plus possible de passer d'un service à l'autre et d'ouvrir les paramètres de Sound Transcriber pendant le processus de conversion.
ru: - Вы больше не можете переключаться между службами и открывать настройки Sound Transcriber во время процесса конвертирования.
tr: - Dönüştürme işlemi sırasında hizmetler arasında geçiş yapamaz ve Sound Transcriber ayarlarını açamazsınız.
vi: - Bạn không thể chuyển đổi giữa các dịch vụ và mở cài đặt của Sound Transcriber trong quá trình chuyển đổi nữa.

source: - Sound Transcriber will now attempt to alert you when converting using an incorrect wit.ai API key.
ar: - سيحاول Sound Transcriber أن ينبهك عند التحويل باستخدام مفتاح wit.ai غير صحيح.
es: - Ahora Sound Transcriber intentará avisarle cuando realice la conversión utilizando una clave de API de wit.ai incorrecta.
fr: - Sound Transcriber tentera désormais de vous alerter en cas de conversion à l'aide d'une clé API wit.ai incorrecte.
ru: - Sound Transcriber теперь будет пытаться предупредить вас о конвертации при использовании неправильного API- ключа wit.ai.
tr: - Sound Transcriber artık yanlış bir wit.ai API anahtarı kullanarak dönüştürme yaparken sizi uyarmaya çalışacaktır.
vi: - Sound Transcriber bây giờ sẽ cố gắng cảnh báo bạn khi chuyển đổi sử dụng khóa API wit.ai không chính xác.

source: - Fixed a bug that caused the "Edit" button to appear twice after adding a wit.ai key.
ar: - تم إصلاح خطأ كان يتسبب في ظهور زر باسم "تعديل" مرتين بعد إضافة مفتاح wit.ai.
es: - Se ha corregido un error que provocaba que el botón "Editar" apareciera dos veces después de añadir una clave de wit.ai.
fr: - Correction d'un bogue à cause duquel le bouton "Modifier" apparaissait deux fois après l'ajout d'une clé wit.ai.
ru: - Исправлена ошибка , из - за которой кнопка " Редактировать " появлялась дважды после добавления ключа wit.ai.
tr: - Bir wit.ai anahtarı ekledikten sonra "Düzenle" düğmesinin iki kez görünmesine neden olan bir hata düzeltildi.
vi: - Đã sửa lỗi khiến nút "Chỉnh sửa" hiển thị hai lần sau khi thêm khóa wit.ai.

source: - Fixed a bug that caused the Update and Cancel buttons to appear in English when using Sound Transcriber in Arabic..
ar: - تم إصلاح خطأ كان يتسبب في ظهور أزرار التحديث والإلغاء بالأسماء الإنجليزية عند استخدام Sound Transcriber باللغة العربية.
es: - Se ha corregido un error que provocaba que los botones Actualizar y Cancelar aparecieran en inglés cuando se utilizaba Sound Transcriber en árabe.
fr: - Correction d'un bogue à cause duquel les boutons "Mettre à jour" et "Annuler" apparaissaient en anglais lorsque Sound Transcriber était utilisé en arabe.
ru: - Исправлена ошибка , из - за которой кнопки " Обновить " и " Отмена " отображались на английском языке при использовании Sound Transcriber на арабском.
tr: - Sound Transcriber'ı Arapça kullanırken Güncelle ve İptal düğmelerinin İngilizce görünmesine neden olan bir hata düzeltildi.
vi: - Đã sửa lỗi khiến các nút Cập nhật và Hủy xuất hiện bằng tiếng Anh khi sử dụng Sound Transcriber bằng tiếng Ả Rập.

source: - Various other bug fixes.
ar: - تم إصلاح بعض الأخطاء الأخرى.
es: - Otros errores corregidos.
fr: - Diverses autres corrections de bogues.
ru: - Исправлены другие ошибки .
tr: - Diğer çeşitli hata düzeltmeleri.
vi: - Một số lỗi khác đã được sửa.

source: ## Version 1.1.1:
ar: ## الإصدار 1.1.1:
es: ## Versión 1.1.1:
ru: ## Версия 1.1.1:
tr: ## Sürüm 1.1.1:
vi: ## Phiên bản 1.1.1:

source: - Fixed a bug that caused the cursor position to move to the beginning of the text constantly with the screen reader while extracting text.
ar: - تم إصلاح خطأ كان يجعل موضع المؤشر ينتقل إلى بداية النص باستمرار مع قارئ الشاشة أثناء استخراج النص.
es: - Corregido un error que provocaba que la posición del cursor se moviera al principio del texto constantemente con el lector de pantalla mientras se extraía texto.
fr: - Correction d'un bogue qui faisait que la position du curseur se déplaçait constamment au début du texte avec le lecteur d'écran lors de l'extraction du texte.
ru: - Исправлена ошибка , из - за которой при извлечении текста с помощью программы чтения с экрана позиция курсора постоянно перемещалась в начало текста .
tr: - Ekran okuyucu ile metin çıkarma sırasında imleç konumunun sürekli olarak metnin başına gitmesine neden olan bir hata düzeltildi.
vi: - Đã sửa lỗi khiến vị trí con trỏ di chuyển về đầu văn bản liên tục với trình đọc màn hình trong khi trích xuất văn bản.

source: - Fixed a bug that caused the save options to not work after the text extraction process was finished.
ar: - تم إصلاح خطأ كان يجعل خيارات الحفظ لا تعمل بعد انتهاء عملية استخراج النص.
es: - Corregido un error que provocaba que las opciones de guardado no funcionaran una vez finalizado el proceso de extracción de texto.
fr: - Correction d'un bogue qui faisait que les options d'enregistrement ne fonctionnaient pas après la fin du processus d'extraction du texte.
ru: - Исправлена ошибка , из - за которой опции сохранения не работали после завершения процесса извлечения текста .
tr: - Metin çıkarma işlemi tamamlandıktan sonra kaydetme seçeneklerinin çalışmamasına neden olan bir hata düzeltildi.
vi: - Đã sửa lỗi khiến tùy chọn lưu không hoạt động sau khi quá trình trích xuất văn bản hoàn tất.

source: - Fix some other bugs.
ar: - تم إصلاح بعض الأخطاء الصغيرة.
es: - Corregidos otros errores.
fr: - Correction d'autres bogues.
ru: - Исправлены некоторые другие ошибки .
tr: - Diğer bazı hatalar düzeltildi.
vi: - Đã sửa một số lỗi khác.

source: ## Version 1.1:
ar: ## الإصدار 1.1:
es: ## Versión 1.1:
ru: ## Версия 1.1:
tr: ## Sürüm 1.1:
vi: ## Phiên bản 1.1:

source: This version includes several bug fixes and some new features.
ar: يأتي هذا الإصدار بالعديد من إصلاحات الأخطاء وببعض الميزات الجديدة.
es: Esta versión incluye varias correcciones de errores y algunas funciones nuevas.
fr: Cette version comprend plusieurs corrections de bogues et quelques nouvelles fonctionnalités.
ru: В этой версии исправлено несколько ошибок и добавлено несколько новых функций.
tr: Bu sürümde birkaç hata düzeltmesi ve bazı yeni özellikler bulunmaktadır.
vi: Phiên bản này bao gồm một số sửa lỗi và một số tính năng mới.

source: - Support for various audio and video file formats has been added.
ar: - تم دعم العديد من صيغ ملفات الصوت والفيديو.
es: - Se ha añadido soporte para varios formatos de archivos de audio y vídeo.
fr: - La prise en charge de divers formats de fichiers audio et vidéo a été ajoutée.
ru: - Добавлена поддержка различных форматов аудио - и видеофайлов .
tr: - Çeşitli ses ve video dosya formatları için destek eklendi.
vi: - Đã hỗ trợ thêm nhiều định dạng tập tin âm thanh và video khác nhau.

source: - Word files are now saved as .docx instead of .doc.
ar: - من الآن فصاعداً سيتم حفظ ملفات Word بصيغة .docx بدلاً من .doc.
es: - Los archivos de Word se guardan ahora como .docx en lugar de .doc.
fr: - Les fichiers Word sont désormais enregistrés au format .docx au lieu de .doc.
ru: - Файлы Word теперь сохраняются в формате . docx, а не . doc.
tr: - Word dosyaları artık .doc yerine .docx olarak kaydediliyor.
vi: - Các tập tin Word hiện được lưu dưới dạng .docx thay vì .doc.

source: - Sound Transcriber will display a warning when closed during file conversion.
ar: - سيظهر Sound Transcriber تحذير عند إغلاقه أثناء تحويل ملف.
es: - Sound Transcriber mostrará una advertencia cuando se cierre durante la conversión de archivos.
fr: - Sound Transcriber affichera un avertissement si vous essayez de le fermer pendant la conversion d'un fichier.
ru: - Sound Transcriber отображает предупреждение о закрытии файла во время его конвертации.
tr: - Sound Transcriber, dosya dönüştürme sırasında kapatıldığında bir uyarı gösterecektir.
vi: - Sound Transcriber sẽ hiển thị cảnh báo khi đóng trong quá trình chuyển đổi tập tin.

source: - If auto saving is disabled and the extracted text is not saved in any file, Sound Transcriber will prompt you for what to do upon closing. If you choose to save, the file will be saved according to the options specified in the Save Options section in the settings.
ar: - في حال تعطيل الحفظ التلقائي وعدم حفظ النص المستخرج في أي ملف, سيسألك Sound Transcriber عما ينبغي فعله عند إغلاقه. في حال اخترت حفظ, سيتم حفظ الملف وفقا للخيارات المحددة في قسم الحفظ التلقائي في الإعدادات.
es: - Si el guardado automático está desactivado y el texto extraído no se guarda en ningún archivo, Sound Transcriber le preguntará qué hacer al cerrar. Si decide guardar, el archivo se guardará según las opciones especificadas en la sección Opciones de guardado de la configuración.
fr: - Si l'enregistrement automatique est désactivé et que le texte extrait n'est enregistré dans aucun fichier, Sound Transcriber vous demandera ce qu'il faut faire à la fermeture. Si vous choisissez d'enregistrer, le fichier sera enregistré selon les options spécifiées dans la section Options d'enregistrement des paramètres.
ru: - Если автосохранение отключено и извлечённый текст не сохраняется ни в одном файле , Sound Transcriber спросит вас, что делать при закрытии. Если вы выберете сохранение, файл будет сохранён в соответствии с параметрами, указанными в разделе настроек "Параметры сохранения".
tr: - Otomatik kaydetme devre dışı bırakıldığında ve çıkarılan metin herhangi bir dosyada kaydedilmediğinde, Sound Transcriber kapatılırken size ne yapmanız gerektiğini soracaktır. Kaydetmeyi seçerseniz, dosya ayarlardaki Kaydetme Seçenekleri bölümünde belirtilen seçeneklere göre kaydedilecektir.
vi: - Nếu tự động lưu bị tắt và văn bản được trích xuất không được lưu trong bất kỳ tập tin nào, Sound Transcriber sẽ nhắc bạn về việc cần làm khi đóng. Nếu bạn chọn lưu, tập tin sẽ được lưu theo các tùy chọn được chỉ định trong phần Tùy chọn Lưu trong cài đặt.

source: - Sound Transcriber now remembers the selected language for file conversion for each service.
ar: - سيتذكر Sound Transcriber اللغة المحددة لتحويل الملفات لكل خدمة.
es: - Sound Transcriber ahora recuerda el idioma seleccionado para la conversión de archivos para cada servicio.
fr: - Sound Transcriber mémorise désormais la langue sélectionnée pour la conversion des fichiers pour chaque service.
ru: - Sound Transcriber теперь запоминает выбранный язык для преобразования файлов для каждого сервиса.
tr: - Sound Transcriber artık her hizmet için dosya dönüştürme için seçilen dili hatırlayacaktır.
vi: - Sound Transcriber bây giờ sẽ ghi nhớ ngôn ngữ đã chọn để chuyển đổi tập tin cho mỗi dịch vụ.

source: - The extracted text is now displayed during the extraction process. In other words, if the extraction process stops for any reason, you will not lose the extracted text. The new text will be added as the process continues.
ar: - سيتم الآن عرض النص المستخرج أثناء استخراجه؛ وبعبارة أخرى، فإذا توقفت عملية الاستخراج لأي سبب, لن تفقد النص الذي تم استخراجه. وستتم إضافة النص الجديد أثناء تقدم العملية, وسيكتمل بعد انتهائها.
es: - El texto extraído se muestra ahora durante el proceso de extracción. Es decir, si el proceso de extracción se detiene por cualquier motivo, no perderá el texto extraído. El nuevo texto se añadirá a medida que continúe el proceso.
fr: - Le texte extrait est désormais affiché pendant le processus d'extraction. En d'autres termes, si le processus d'extraction s'arrête pour une raison quelconque, vous ne perdrez pas le texte extrait. Le nouveau texte sera ajouté au fur et à mesure que le processus se poursuit.
ru: - Извлечённый текст теперь отображается во время процесса извлечения . Иными словами , если процесс извлечения по какой - либо причине остановится , извлечённый текст не будет потерян . Новый текст будет добавляться по мере продолжения процесса .
tr: - Çıkarılan metin artık çıkarma işlemi sırasında görüntülenir. Başka bir deyişle, çıkarma işlemi herhangi bir nedenle durursa, çıkarılan metni kaybetmezsiniz. İşlem devam ettikçe yeni metin eklenecektir.
vi: - Văn bản được trích xuất giờ đây sẽ được hiển thị trong quá trình trích xuất. Nói cách khác, nếu quá trình trích xuất dừng lại vì bất kỳ lý do nào, bạn sẽ không bị mất văn bản đã trích xuất. Văn bản mới sẽ được thêm vào khi quá trình tiếp tục.

source: - You can now check the progress of the extraction by pressing P.
ar: - أصبح بإمكانك معرفة نسبة تقدم الاستخراج عن طريق ضغط حرف P.
es: - Ahora puede comprobar el progreso de la extracción pulsando P.
fr: - Vous pouvez désormais vérifier la progression de l'extraction en appuyant sur P.
ru: - Теперь вы можете проверить ход извлечения , нажав кнопку P.
tr: - Çıkarma ilerlemesini P tuşuna basarak kontrol edebilirsiniz.
vi: - Bây giờ bạn có thể kiểm tra tiến trình trích xuất bằng cách nhấn P.

source: - Fixed a bug that prevented the auto save path "Browse" button from working.
ar: - تم إصلاح خطأ كان يجعل زر تحديد مسار الحفظ التلقائي لا يعمل.
es: - Se ha corregido un error que impedía que funcionara el botón "Examinar" de la ruta de guardado automático.
fr: - Correction d'un bogue qui empêchait le bouton "Parcourir" du chemin d'enregistrement automatique de fonctionner.
ru: - Исправлена ошибка , из - за которой не работала кнопка автоматического сохранения пути " Обзор ".
tr: - Otomatik kaydetme yolu "Gözat" düğmesinin çalışmasını engelleyen bir hata düzeltildi.
vi: - Đã sửa lỗi khiến nút "Duyệt" đường dẫn tự động lưu không hoạt động.

source: - Fixed a bug that prevented changing API keys for languages other than the primary language in the wit.ai language list.
ar: - تم إصلاح خطأ كان يمنع تعديل المفاتيح لأي لغة غير اللغة الأولى في قائمة لغات wit.ai.
es: - Se ha corregido un error que impedía cambiar las claves API para idiomas distintos del idioma principal en la lista de idiomas de wit.ai.
fr: - Correction d'un bogue qui empêchait la modification des clés API pour les langues autres que la langue principale dans la liste des langues de wit.ai.
ru: - Исправлена ошибка , из - за которой нельзя было изменить API- ключи для языков, отличных от основного языка в списке языков wit.ai.
tr: - wit.ai dil listesinde birincil dilden farklı diller için API anahtarlarını değiştirmeyi engelleyen bir hata düzeltildi.
vi: - Đã sửa lỗi ngăn không cho thay đổi khóa API cho các ngôn ngữ khác ngoài ngôn ngữ chính trong danh sách ngôn ngữ của wit.ai.

source: - Fixed a bug that prevented from converting files with a language other than the primary language using Wit.ai.
ar: - تم إصلاح خطأ كان يمنع تحويل الملفات بأي لغة باستثناء اللغة الأولى مع wit.ai.
es: - Se ha corregido un error que impedía convertir archivos con un idioma distinto del idioma principal mediante Wit.ai.
fr: - Correction d'un bogue qui empêchait de convertir des fichiers avec une langue autre que la langue principale en utilisant Wit.ai.
ru: - Исправлена ошибка , не позволявшая конвертировать файлы с языком , отличным от основного , с помощью Wit.ai.
tr: - Wit.ai kullanarak birincil dilden farklı bir dille dosyaları dönüştürmeyi engelleyen bir hata düzeltildi.
vi: - Đã sửa lỗi khiến việc chuyển đổi tệp bằng Wit.ai không hoạt động với các ngôn ngữ khác ngoài ngôn ngữ chính.

source: - Fixed a bug that prevented restoring default settings.
ar: - تم إصلاح خطأ كان يمنع استعادة الإعدادات إلى الإعدادات الافتراضية.
es: - Se ha corregido un error que impedía restaurar la configuración predeterminada.
fr: - Correction d'un bogue qui empêchait la restauration des paramètres par défaut.
ru: - Исправлена ошибка , не позволявшая восстановить настройки по умолчанию .
tr: - Varsayılan ayarları geri yüklemeyi engelleyen bir hata düzeltildi.
vi: - Đã sửa lỗi khiến việc khôi phục cài đặt mặc định không hoạt động.

source: - Adjusted the layout of the settings dialog to display items correctly.
ar: - تم تعديل حجم محاورة الإعدادات لتظهر العناصر بالشكل الصحيح.
es: - Se ha ajustado el diseño del cuadro de diálogo de configuración para mostrar los elementos correctamente.
fr: - Ajustement de la présentation de la boîte de dialogue des paramètres pour afficher les éléments correctement.
ru: - Скорректировано оформление диалога настроек для корректного отображения элементов .
tr: - Ayarlar iletişim kutusunun düzeni öğeleri doğru şekilde görüntüleyecek şekilde ayarlandı.
vi: - Điều chỉnh bố cục của hộp thoại cài đặt để hiển thị các mục chính xác.

source: - Made some improvements to the Arabic translation.
ar: - تم إجراء بعض التحسينات على الترجمة العربية.
es: - Mejoras a la traducción árabe.
fr: - Amélioration de la traduction en arabe.
ru: - Внесены некоторые улучшения в арабский перевод .
tr: - Arapça çeviriye bazı iyileştirmeler yapıldı.
vi: - Đã thực hiện một số cải tiến đối với bản dịch tiếng Ả Rập.

source: - Fixed some minor bugs here and there.
ar: - تم إصلاح بعض الأخطاء الصغيرة هنا وهناك.
es: - Corrección de errores menores.
fr: - Correction de quelques bogues mineurs ici et là.
ru: - Исправлено несколько мелких ошибок .
tr: - Burada ve orada bazı küçük hatalar düzeltildi.
vi: - Sửa một số lỗi nhỏ chỗ này chỗ kia.

source: ## Version 1.0:
ar: ## الإصدار 1.0:
es: ## Versión 1.0:
ru: ## Версия 1.0:
tr: ## Sürüm 1.0:
vi: ## Phiên bản 1.0:

source: Initial release.
ar: إصدار أولي.
es: Versión inicial.
fr: Version initiale.
ru: Первоначальный выпуск.
tr: İlk sürüm.
vi: Bản phát hành đầu tiên.
