Repository: Kostenkov-2021/SoundTranscriber
Catalog: documentation/*/WhatsNew.po
Languages: ar, es, fr, ru, tr, vi

source: # What's new in Sound Transcriber?
ar: # ما الجديد في Sound Transcriber?
es: # Novedades en Sound Transcriber?
fr: # Quoi de neuf dans Sound Transcriber ?
ru: # Что нового в Sound Transcriber?
tr: # Sound Transcriber'deki Yenilikler?
vi: # Có gì mới trong Sound Transcriber?

source: ## Version 1.4.6:
ar: ## الإصدار 1.4.6:
es: ## Versión 1.4.6:
ru: ## Версия 1.4.6:
tr: ##Sürüm 1.4.6:
vi: ## Phiên bản 1.4.6:

source: - Sound Transcriber no longer checks the API key during its addition due to some bugs; the feature will be fixed later.
ar: - لم يعد Sound Transcriber يتحقق من مفتاح API أثناء الإضافة بسبب بعض الأخطاء. سيتم إصلاح هذه الميزة لاحقًا.
es: - Sound Transcriber ya no verifica la clave API durante su adición debido a algunos errores; esta función se corregirá más adelante.
fr: - Sound Transcriber ne vérifie plus la clé API lors de son ajout en raison de certains bugs ; cette fonctionnalité sera corrigée plus tard.
ru: - Sound Transcriber больше не проверяет ключ API при добавлении из-за некоторых ошибок; эта функция будет исправлена позже.
tr: - Sound Transcriber, bazı hatalar nedeniyle artık API anahtarını eklerken kontrol etmiyor; bu özellik daha sonra düzeltilecektir.
vi: - Sound Transcriber hiện không kiểm tra khóa API khi thêm vào do một số lỗi; tính năng này sẽ được sửa sau.

source: - Updated Python version to Python 3.13.
ar: - تم تحديث إصدار Python إلى Python 3.13.
es: - Actualizada la versión de Python usada a Python 3.13.
fr: - Mise à jour de la version de Python utilisée à Python 3.13.
ru: - Обновлена используемая версия Python до Python 3.13.
tr: - Python sürümü 3.13'e güncellendi.
vi: - Đã cập nhật phiên bản Python được sử dụng lên Python 3.13.

source: - You can now install Sound Transcriber on ARM64 devices.
ar: - يمكنك الآن تثبيت Sound Transcriber على أجهزة ARM64.
es: - Ahora puedes instalar Sound Transcriber en dispositivos ARM64.
fr: - Vous pouvez désormais installer Sound Transcriber sur les appareils ARM64.
ru: - Теперь можно устанавливать Sound Transcriber на устройства ARM64.
tr: - Artık Sound Transcriber'ı ARM64 cihazlara kurabilirsiniz.
vi: - Bạn hiện có thể cài đặt Sound Transcriber trên thiết bị ARM64.

source: - Updated yt-dlp to resolve download issues.
ar: - تم تحديث yt-dlp لحل مشكلات التنزيل.
es: - Se actualizó yt-dlp para resolver problemas de descarga.
fr: - Mise à jour de yt-dlp pour résoudre les problèmes de téléchargement.
ru: - Обновлён yt-dlp для устранения проблем со скачиванием.
tr: - İndirme sorunlarını gidermek için yt-dlp güncellendi.
vi: - Cập nhật yt-dlp để khắc phục sự cố tải xuống.

source: - Fixed an encoding-related bug with the log file.
ar: - تم إصلاح خطأ متعلق بالترميز في ملف السجل.
es: - Se solucionó un error relacionado con la codificación en el archivo de registro.
fr: - Correction d’un bug lié à l’encodage dans le fichier journal.
ru: - Исправлена ошибка кодировки в лог-файле.
tr: - Günlük dosyasında kodlama ile ilgili bir hata düzeltildi.
vi: - Đã sửa lỗi liên quan đến mã hóa trong tệp nhật ký.

source: - Updated dependencies to the latest versions.
ar: - تم تحديث الملحقات إلى أحدث الإصدارات.
es: - Se actualizaron las dependencias a sus últimas versiones.
fr: - Mises à jour des dépendances vers leurs dernières versions.
ru: - Обновлены зависимости до последних версий.
tr: - Bağımlılıklar en son sürümlere güncellendi.
vi: - Cập nhật các thư viện phụ thuộc lên phiên bản mới nhất.

source: - Some improvements.
ar: - بعض التحسينات.
es: - Algunas mejoras.
fr: - Quelques améliorations.
ru: - Некоторые улучшения .
tr: - Bazı iyileştirmeler.
vi: Một số cải tiến nhỏ.

source: ## Version 1.4.5:
ar: ## الإصدار 1.4.5:
es: ## Versión 1.4.5:
ru: ## Версия 1.4.5:
tr: ##Sürüm 1.4.5:
vi: ## Phiên bản 1.4.5:

source: - Sound Transcriber will now display all supported files in the Open File dialog.
ar: - سيعرض Sound Transcriber جميع الملفات المدعومة في محاورة فتح ملف.
es: - Sound Transcriber ahora mostrará todos los archivos compatibles en el cuadro de diálogo de abrir
fr: - Sound Transcriber affiche désormais tous les fichiers pris en charge dans la boîte de dialogue Ouvrir un fichier.
ru: - Теперь Sound Transcriber показывает все поддерживаемые файлы в окне выбора файла.
tr: - Sound Transcriber artık Dosya Aç iletişim kutusunda tüm desteklenen dosyaları gösterecek.
vi: Sound Transcriber hiện sẽ hiển thị tất cả các tệp được hỗ trợ trong hộp thoại Mở tệp.

source: - Some improvements...
ar: - بعض التحسينات.
es: - Algunas mejoras...
fr: - Quelques améliorations.
ru: - Некоторые улучшения ...
tr: - Bazı iyileştirmeler.
vi: - Một số cải tiến...

source: ## Version 1.4.4:
ar: ## الإصدار 1.4.4:
es: ## Versión 1.4.4:
ru: ## Версия 1.4.4:
tr: ##Sürüm 1.4.4:
vi: ## Phiên bản 1.4.4:

source: - Added Vietnamese translation, many thanks to Nguyen Anh Duc.
ar: - تمت إضافة الترجمة الفيتنامية، جزيل الشكر لNguyen Anh Duc.
es: - Añadida traducción al Vietnamita, muchas gracias a Nguyen Anh Duc.
fr: - Ajout de la traduction en vietnamien, un grand merci à Nguyen Anh Duc.
ru: - Добавлен перевод на вьетнамский, большое спасибо Нгуен Ань Дыку.
tr: - Viyetnamca çeviri eklendi,Nguyen Anh Duc'a çok teşekkür ederiz.
vi: - Đã thêm bản dịch tiếng Việt, xin chân thành cảm ơn Nguyễn Anh Đức.

source: - Transitioned to a new system for translating the changelog and Sound Transcriber User Guide. More details can be found in the User Guide.
ar: - تم الانتقال إلى نظام جديد لترجمة سجل التغييرات ودليل مستخدم Sound Transcriber. يمكن العثور على مزيد من التفاصيل في دليل المستخدم.
es: - Realizada transición a un nuevo sistema para traducir el registro de cambios (novedades) y la Guía de usuario de Sound Transcriber. Se pueden encontrar más detalles en la guía de usuario.
fr: - Nous avons adopté un nouveau système pour traduire le journal des modifications et le guide de l'utilisateur de Sound Transcriber. Vous trouverez plus d'informations dans le guide de l'utilisateur.
ru: - Осуществлён переход на новую систему перевода журнала изменений и Руководства пользователя Sound Transcriber. Более подробную информацию можно найти в Руководстве пользователя.
tr: - deyişiklik günlüğü ve kullanım kılavuzu için yeni bir çeviri sisremine geçiş yabıldı, dahafazla bilgiyi sound transcriber kullanım kılavuzunda bulabilirsiniz.
vi: - Đã chuyển sang hệ thống mới để dịch nhật ký thay đổi và Hướng dẫn Sử dụng Sound Transcriber. Bạn có thể tìm thêm thông tin trong Hướng dẫn Sử dụng.

source: - Fixed a bug that prevented Sound Transcriber from successfully downloading YouTube videos.
ar: - تم إصلاح خطأ كان يمنع Sound Transcriber من تنزيل فيديوهات YouTube بنجاح.
es: - Corregido un error que hacía que Sound Transcriber no descaragara correctamente vídeos de YouTube.
fr: - Correction d'un bug qui empêchait Sound Transcriber de télécharger correctement des vidéos YouTube.
ru: - Исправлена ошибка, из-за которой программа Sound Transcriber не могла успешно загружать видео с YouTube.
tr: - sound transcriberin youtube videolarını indirememesine sebep olan bir hata düzeltildi.
vi: - Đã sửa lỗi khiến Sound Transcriber không thể tải xuống video YouTube thành công.

source: - Fixed a bug that prevented Sound Transcriber from stopping downloads correctly when the "Keep Downloaded Files" option was enabled.
ar: - تم إصلاح خطأ كان يمنع Sound Transcriber من إيقاف التنزيل بشكل صحيح عند تفعيل خيار الاحتفاظ بالملفات التي تم تنزيلها.
es: - Corregido un error que impedía que Sound Transcriber pausara las descargas correctamente cuando la opción "Mantener ficheros descargados" estaba marcada.
fr: - Correction d'un bug empêchant Sound Transcriber d'arrêter correctement les téléchargements lorsque l'option "Conserver les fichiers téléchargés" était activée.
ru: - Исправлена ошибка, из-за которой программа Sound Transcriber не могла корректно останавливать загрузку при включённой опции "Сохранять загруженные файлы".
tr: - İndirilen Dosyaları Sakla" seçeneği etkinleştirildiğinde Sound Transcriber'ın indirmeleri doğru şekilde durdurmasını engelleyen bir hata düzeltildi.
vi: - Đã sửa lỗi ngăn chặn Sound Transcriber dừng tải xuống đúng cách khi tùy chọn "Giữ Tập Tin Đã Tải Xuống "được bật".

source: - Fixed a bug that caused Sound Transcriber to improperly log errors returned by services.
ar: - تم إصلاح خطأ تسبب في قيام Sound Transcriber بتسجيل الأخطاء التي تعيدها الخدمات بشكل غير صحيح.
es: - Corregido un error que hacía que Sound Transcriber registrara incorrectamente los registros devueltos por los servicios.
fr: - Correction d'un bug qui empêchait Sound Transcriber de correctement enregistrer les erreurs retournées par les services.
ru: - Исправлена ошибка, из-за которой Sound Transcriber неправильно регистрировал ошибки, возвращаемые сервисами.
tr: - sound transcriber'in servisler tarafından döndürülen hataları yanlış şekilde günlüğe kaydetmesine neden olan bir hata düzeltildi.
vi: - Đã sửa lỗi khiến Sound Transcriber ghi nhật ký lỗi trả về từ dịch vụ không chính xác.

source: - Improved Sound Transcriber user guide.
ar: - تم تحسين دليل مستخدم Sound Transcriber.
es: - Mejorada la guía de usuario de Sound Transcriber.
fr: - Amélioration du guide utilisateur de Sound Transcriber.
ru: - Улучшено руководство пользователя Sound Transcriber.
tr: - sound transcriber kullanım kılavuzu geliştirildi.
vi: - Hướng dẫn sử dụng Sound Transcriber được cải tiến.

source: - Upgraded to wxPython 4.2.2 and Python 3.12.7.
ar: - تمت الترقية إلى wxPython 4.2.2 و Python 3.12.7.
es: - Actualizado a wxPython 4.2.2 y Python 3.12.7.
fr: Mis à niveau vers wxPython 4.2.2 et Python 3.12.7.
ru: - Обновлена библиотека wxPython 4.2.2 и Python 3.12.7.
tr: - wx python sürüm wxPython 4.2.2 ve python sürümPython 3.12.7 ye güncellendi.
vi: - Nâng cấp lên wxPython 4.2.2 và Python 3.12.7.

source: ## Version 1.4.3:
ar: ## الإصدار 1.4.3:
es: ## Versión 1.4.3:
ru: ## Версия 1.4.3:
tr: ## Sürüm 1.4.3:
vi: ## Phiên bản 1.4.3:

source: - Some improvements....
ar: - بعض التحسينات.
es: - Algunas mejoras...
fr: - Quelques améliorations.
ru: - Некоторые улучшения ...
tr: - Bazı iyileştirmeler.
vi: - Một số cải tiến...

source: ## Version 1.4.2:
ar: ## الإصدار 1.4.2:
es: ## Versión 1.4.2:
ru: ## Версия 1.4.2:
tr: ## Sürüm 1.4.2:
vi: ## Phiên bản 1.4.2:

source: - Added Turkish translation. Thanks to Kadir öz.
ar: - تمت إضافة الترجمة التركية. شكراً لـ Kadir öz.
es: - Añadida traducción al turco. Gracias a Kadir öz.
fr: - Ajout de la traduction turque. Merci à Kadir öz.
ru: - Добавлен перевод на турецкий . Спасибо Kadir öz.
tr: - Türkçe çeviri eklendi. Kadir öz'e te ş ekkürler.
vi: - Đã thêm bản dịch tiếng Thổ Nhĩ Kì. Cảm ơn Kadir öz.

source: - fixed a bug related to downloading from YouTube.
ar: - تم إصلاح خطأ متعلق بالتنزيل من YouTube.
es: - Se corrigió un error relacionado con la descarga desde YouTube.
fr: - Correction d'un bug lié au téléchargement depuis YouTube.
ru: - исправлена ошибка , связанная с загрузкой с YouTube.
tr: - YouTube'dan indirme ile ilgili bir hata düzeltildi.
vi: - đã sửa lỗi liên quan đến việc tải xuống từ YouTube.

source: - Some improvements.....
ar: - بعض التحسينات.
es: - Algunas mejoras...
fr: - Quelques améliorations.
ru: - Некоторые улучшения ...
tr: - Bazı iyileştirmeler.
vi: - Một số cải tiến...

source: ## Version 1.4.1:
ar: ## الإصدار 1.4.1 :
es: ## Versión 1.4.1:
ru: ## Версия 1.4.1:
tr: ## Sürüm 1.4.1:
vi: ## Phiên bản 1.4.1:

source: - Several minor improvements.
ar: - بعض التحسينات الصغيرة.
es: - Varios cambios menores.
fr: - Diverses améliorations mineures.
ru: - Несколько незначительных улучшений .
tr: - Birkaç küçük iyileştirme.
vi: - Một số cải tiến nhỏ.

source: ## Version 1.4.0:
ar: ## الإصدار 1.4.0:
es: ## Versión 1.4.0:
ru: ## Версия 1.4.0:
tr: ## Sürüm 1.4.0:
vi: ## Phiên bản 1.4.0:

source: - Added Beta updates system. You can enable this option in settings to receive beta updates. Please note that beta updates may contain significant bugs. You can disable the option and revert to the latest stable version at any time.
ar: - تم إضافة نظام التحديثات التجريبية. يمكنك تفعيل خيار الحصول على التحديثات التجريبية من الإعدادات, ويجب ملاحظة أن التحديثات التجريبية قد تحتوي على أخطاء كبيرة, عطل الخيار وأعد تثبيت أحدث نسخة مستقرة متاحة في أي وقت.
es: - Añadido sistema de actualizaciones Beta. Se puede añadir desde los ajustes para recibir actualizaciones en fase Beta. Tenga en cuenta que estas actualizaciones pueden tener errores importantes. Podrá desactivar esta función y volver a la última versión estable en cualquier momento.
fr: - Ajout d'un système de mises à jour bêta. Vous pouvez activer cette option dans les paramètres pour recevoir les mises à jour bêta. Veuillez noter que les mises à jour bêta peuvent contenir des bogues importants. Vous pouvez désactiver cette option et revenir à la dernière version stable à tout moment.
ru: - Добавлена система бета - обновлений . Вы можете включить эту опцию в настройках , чтобы получать бета - обновления . Обратите внимание , что бета - версии могут содержать значительные ошибки . Вы можете отключить эту опцию и вернуться к последней стабильной версии в любое время .
tr: - Beta güncellemeleri sistemi eklendi. Ayarlardan bu seçeneği etkinleştirerek beta güncellemelerini alabilirsiniz. Beta güncellemelerinin önemli hatalar içerebileceğini unutmayın. İstediğiniz zaman bu seçeneği devre dışı bırakabilir ve en son kararlı sürüme dönebilirsiniz.
vi: - Đã thêm hệ thống cập nhật Beta. Bạn có thể kích hoạt tùy chọn này trong cài đặt để nhận các bản cập nhật beta. Xin lưu ý rằng các bản cập nhật beta có thể chứa các lỗi nghiêm trọng. Bạn có thể tắt tùy chọn này và quay lại phiên bản ổn định mới nhất bất kỳ lúc nào.

source: - Added an option to specify the number of files to be converted simultaneously.
ar: - تم إضافة خيار لتحديد عدد الملفات التي سيتم تحويلها في نفس الوقت.
es: - Añadida una opción para especificar el número de ficheros a convertir simultáneamente.
fr: - Ajout d'une option permettant de spécifier le nombre de fichiers à convertir simultanément.
ru: - Добавлена возможность указать количество одновременно конвертируемых файлов .
tr: - Aynı anda dönüştürülecek dosya sayısını belirleme seçeneği eklendi.
vi: - Đã thêm tùy chọn để chỉ định số lượng tệp sẽ được chuyển đổi đồng thời.

source: - Sound Transcriber will no longer generate an event log by default. You can enable it from the settings when encountering errors and then repeat the steps. By default, the log will retain the details of the last step, and previous operations details will be deleted when disabled.
ar: - لن يكتب Sound Transcriber سجل الأحداث بشكل افتراضي بعد الآن. قم بتفعيله من الإعدادات عند ما تواجه أخطاء ثم كرر الخطوات, افتراضيًا, سيحتفظ السجل بتفاصيل آخر خطوة, وسيتم حذف تفاصيل العمليات السابقة في حال قمت بتعطيله.
es: - Sound Transcriber no seguirá generando un archivo de registro (log) de manera automática. Se podrá activar la opción desde los ajustes cuando se encuentren errores y en ese momento repetir los pasos que provocaron el error. Por defecto, el log conservará los detalles del último paso, y los detalles de las operaciones anteriores serán eliminados cuando la opción se desactive.
fr: - Sound Transcriber ne génère plus de journal d'événements par défaut. Vous pouvez l'activer dans les paramètres lorsque vous rencontrez des erreurs, puis répéter les étapes. Par défaut, le journal conservera les détails de la dernière étape, et les détails des opérations précédentes seront supprimés si désactivé.
ru: - Sound Transcriber больше не будет генерировать журнал событий по умолчанию. Вы можете включить его в настройках при возникновении ошибок, а затем повторить все действия. По умолчанию в журнале сохраняются сведения о последнем шаге, а при отключении удаляются сведения о предыдущих операциях.
tr: - Sound Transcriber varsayılan olarak bir olay günlüğü oluşturmayacaktır. Hatalarla karşılaştığınızda ayarlardan etkinleştirebilir ve ardından adımları tekrarlayabilirsiniz. Varsayılan olarak, günlük son adımın ayrıntılarını saklayacak ve devre dışı bırakıldığında önceki işlem ayrıntıları silinecektir.
vi: - Sound Transcriber sẽ không còn tạo nhật ký sự kiện theo mặc định. Bạn có thể kích hoạt nó từ cài đặt khi gặp lỗi và sau đó lặp lại các bước. Theo mặc định, nhật ký sẽ giữ chi tiết của bước cuối cùng và chi tiết các thao tác trước đó sẽ bị xóa khi bị vô hiệu.

source: - The logs now display more information.
ar: - يعرض السجل الآن المزيد من المعلومات.
es: - Los archivos de registro (logs) ahora muestran más información.
fr: - Les journaux affichent désormais davantage d'informations.
ru: - В журналах теперь отображается больше информации .
tr: - Günlükler artık daha fazla bilgi gösteriyor.
vi: - Nhật ký bây giờ hiển thị nhiều thông tin hơn.

source: - The functionality of the copy button has been enhanced. As a result, the copy button should remain available as long as the result field contains transcribed texts.
ar: - تم تحسين وظيفة زر النسخ. نتيجة لذلك، يجب أن يظل زر النسخ متاحًا طالما أن مربع النتيجة يحتوي على نصوص تم تحويلها.
es: - La funcionalidad del botón de copiar se ha mejorado. El botón de copiar estará habilitado mientras el campo de resultado tenga texto transcrito.
fr: - La fonctionnalité du bouton de copie a été améliorée. En conséquence, le bouton de copie devrait rester disponible tant que le champ de résultat contient des textes transcrits.
ru: - Улучшена функциональность кнопки копирования . В результате кнопка копирования должна оставаться доступной до тех пор , пока поле результатов содержит расшифрованный текст .
tr: - Kopyala düğmesinin işlevselliği geliştirildi. Sonuç alanında transkrip edilmiş metinler olduğu sürece kopyala düğmesi kullanılabilir durumda kalacaktır.
vi: - Chức năng của nút sao chép đã được nâng cao. Do đó, nút sao chép sẽ vẫn khả dụng miễn là trường kết quả chứa văn bản được phiên âm.

source: - Added a donation option for developers.
ar: - تمت إضافة خيار للتبرع للمطورين.
es: - Añadida una opción de donaciones para los desarrolladores.
fr: - Ajout d'une option de donation pour les développeurs.
ru: - Добавлена возможность пожертвования разработчикам .
tr: - Geliştiriciler için bağış seçeneği eklendi.
vi: - Đã thêm tùy chọn quyên góp cho nhà phát triển.

source: - Attempted to minimize errors returned by the Google service.
ar: - تم إجراء محاولة لتقليل رسائل الأخطاء التي ترجعها خدمة Google.
es: - Se ha intentado minimizar los errores devueltos por el servicio de Google.
fr: - Tentative de minimiser les erreurs renvoyées par le service Google.
ru: - Сделана попытка свести к минимуму ошибки , возвращаемые сервисом Google.
tr: - Google hizmeti tarafından döndürülen hataları en aza indirmeye çalışıldı.
vi: - Đã cố gắng giảm thiểu các lỗi do dịch vụ Google trả về.

source: - Fixed several bugs, particularly those related to pausing and resuming the transcription process.
ar: - تم إصلاح بعض الأخطاء, خصوصأ الأخطاء المتعلقة بإيقاف واستئناف عملية التحويل.
es: - Corregidos varios errores, en particular algunos relacionados con pausar y reanudar el proceso de transcripción.
fr: - Correction de plusieurs bogues, en particulier ceux liés à la mise en pause et à la reprise du processus de transcription.
ru: - Исправлено несколько ошибок , в частности , связанных с приостановкой и возобновлением расшифровки .
tr: - Transkripsiyon sürecini duraklatma ve devam ettirme ile ilgili birkaç hata düzeltildi.
vi: - Đã sửa một số lỗi, đặc biệt là các lỗi liên quan đến việc tạm dừng và tiếp tục quá trình phiên âm.

source: - Updated the user guide to include translation details, beta updates, and other important information. We highly recommend reviewing it for the latest info.
ar: - تم تحديث دليل المستخدم ليشمل تفاصيل الترجمة والتحديثات التجريبية وغيرها من المعلومات المهمة. نوصي بشدة بمراجعته للحصول على أحدث المعلومات.
es: - Actualizada la guía de usuario para que ahora incluya detalles de traducción, actualizaciones Beta y otra información importante. Recomendamos su consulta para conocer las últimas novedades.
fr: - Mise à jour du guide de l'utilisateur pour inclure les détails de la traduction, les mises à jour de la version bêta et d'autres informations importantes. Nous vous recommandons vivement de le consulter pour obtenir les dernières informations.
ru: - Обновлено руководство пользователя , в которое включены подробности перевода , обновления бета - версии и другая важная информация . Мы настоятельно рекомендуем ознакомиться с ним , чтобы получить самую свежую информацию .
tr: - Kullanıcı kılavuzu, çeviri detayları, beta güncellemeleri ve diğer önemli bilgileri içerecek şekilde güncellendi. En son bilgiler için gözden geçirmenizi şiddetle tavsiye ederiz.
vi: - Đã cập nhật hướng dẫn sử dụng để bao gồm chi tiết bản dịch, bản cập nhật beta và các thông tin quan trọng khác. Chúng tôi thực sự khuyên bạn nên xem lại nó để biết thông tin mới nhất.

source: - Updated the Python version used to Python 3.12.
ar: - تم تحديث إصدار Python المستخدم إلى Python3.12.
es: - Actualizada la versión de Python usada a Python 3.12.
fr: - Mise à jour de la version de Python utilisée à Python 3.12.
ru: - Обновлена используемая версия Python до Python 3.12.
tr: - Kullanılan Python sürümü Python 3.12'ye güncellendi.
vi: - Đã cập nhật phiên bản Python được sử dụng lên Python 3.12.

source: - Several minor improvements...
ar: - بعض التحسينات الصغيرة...
es: - Pequeñas mejoras.
fr: - Plusieurs améliorations mineures.
ru: - Несколько незначительных улучшений .
tr: - Birkaç küçük iyileştirme.
vi: - Một số cải tiến nhỏ...

source: ## Version 1.3.3:
ar: ## الإصدار 1.3.3:
es: ## Versión 1.3.3:
ru: ## Версия 1.3.3:
tr: ## Sürüm 1.3.3:
vi: ## Phiên bản 1.3.3:

source: - Added Russian translation, many thanks to Danil.
ar: - تمت إضافة الترجمة الروسية، جزيل الشكر ل Danil.
es: - Añadida traducción al ruso. Muchas gracias a Danil.
fr: - Ajout d'une traduction en russe, merci à Danil.
ru: - Добавлен русский перевод , большое спасибо Данилу .
tr: - Rusça çeviri eklendi, Danil'e çok teşekkürler.
vi: - Đã thêm bản dịch tiếng Nga, cảm ơn Danil rất nhiều.

source: - made code improvements that increased response speed and reduced size.
ar: - تم إجراء تحسينات على الكود زادت من سرعة الاستجابة وقللت حجم البرنامج.
es: - Mejoras en el código que mejoran la velocidad de respuesta y la reducción de tamaño.
fr: - amélioration du code pour augmenter la vitesse de réponse et réduire la taille.
ru: - Внесены улучшения в код , которые увеличили скорость отклика и уменьшили размер программы .
tr: - Cevap hızını artıran ve boyutu azaltan kod iyileştirmeleri yapıldı.
vi: - thực hiện các cải tiến về mã giúp tăng tốc độ phản hồi và giảm kích thước.

source: - replaced Accessible Output 2 with PythonUniversalSpeech.
ar: - تم استبدال Accessible Output 2 بـ PythonUniversalSpeech.
es: - Cambiado Accessible Output 2 por PythonUniversalSpeech.
fr: - Remplacement de Accessible Output 2 par PythonUniversalSpeech.
ru: - Accessible Output 2 заменён на PythonUniversalSpeech.
tr: - Accessible Output 2, PythonUniversalSpeech ile değiştirildi.
vi: - Đã thay thế Accessible Output 2 bằng PythonUniversalSpeech.

source: - Sound Transcriber no longer uses Sapi5 to speak actions when used without a screen reader.
ar: - لم يعد Sound Transcriber يستخدم Sapi5 لنطق الإجراءات عند استخدامه دون قارئ الشاشة.
es: - Sound Transcriber ya no usa Sapi5 para las acciones habladas cuando se usa sin un lector de pantalla.
fr: - Sound Transcriber n'utilise plus Sapi5 pour énoncer les actions lorsqu'il est utilisé sans lecteur d'écran.
ru: - Sound Transcriber больше не использует Sapi5 для озвучивания действий при использовании без программы чтения с экрана.
tr: - Sound Transcriber artık ekran okuyucu olmadan kullanıldığında Sapi5 kullanmaz.
vi: - Sound Transcriber sẽ không còn sử dụng Sapi5 để đọc lời nhắc hành động khi được sử dụng mà không có trình đọc màn hình.
